export const translations = {
    global: {
        main: "الرئيسية",
        rare: "نادر",
        plat: "100٪",
        topleft: "أعلى اليسار",
        topcenter: "أعلى الوسط",
        topright: "أعلى اليمين",
        bottomleft: "أسفل اليسار",
        bottomcenter: "أسفل الوسط",
        bottomright: "أسفل اليمين",
        ok: "موافق",
        preview: "معاينة",
        save: "حفظ",
        back: "رجوع",
        settings: "الإعدادات",
        appversion: "إصدار التطبيق",
        image: "صورة",
        audio: "صوت",
        folder: "مجلد",
        font: "خط",
        select: "اختيار",
        gametitle: "عنوان اللعبة",
        congrats: "مبروك!",
        achievementunlocked: "تم فتح الإنجاز",
        gamecomplete: "اللعبة مكتملة 100٪",
        achievementdesc: "انقر على زر إظهار الإخطار التجريبي",
        gamecompletedesc: "لقد فتحت جميع الإنجازات!",
        defaultcustomfont: "الافتراضي (لم يتم اختيار خط)",
        defaultsoundfile: "الافتراضي (لم يتم اختيار ملف صوتي)",
        defaultsounddir: "الافتراضي (لم يتم اختيار مجلد)",
        nowtracking: "يتم تتبع الإنجازات الآن لـ:",
        nopreview: "المعاينة غير متاحة لنظام التشغيل الأصلي",
        options: "خيارات",
        resetwindow: "إعادة تعيين النافذة",
        show: "عرض",
        exit: "خروج",
        releasegame: "إطلاق اللعبة",
        releasegamesub: [
            `أعد تشغيل عملية العامل الخلفية وأطلق اللعبة الحالية من التتبع`,
            `جرب هذا الخيار إذا كنت قد أغلقت لعبة مؤخرًا ولكن Steam لا يزال يظهر أنها تعمل، أو إذا كان Steam Achievement Notifier لا يزال يظهر كما يتبع لعبة تم إغلاقها بالفعل`
        ],
        noupdateavailable: "لا توجد تحديثات متاحة",
        latestversion: "تم تثبيت أحدث إصدار",
        missingdeps: "التبعية المفقودة",
        missingdepssub: [
            `يبدو أنك تحاول تمكين الخيار <span class="hl">التقاط لقطة شاشة في Steam</span>. ومع ذلك، على نظام Linux، لا يمكن تشغيل التقاط الشاشة تلقائيًا دون تثبيت حزمة <code class="dialogcode">xdotool</code> أولاً`,
            `يرجى تشغيل <code class="dialogcode" style="user-select: text;">sudo apt-get install xdotool</code> لتثبيت هذه التبعية، والتي ستضمن أن يمكن التقاط لقطات شاشة في Steam على هذا الجهاز`
        ],
        restartapp: "إعادة تشغيل التطبيق",
        restartappsub: [
            `إذا لم تعمل الأمور بشكل صحيح، استخدم هذا الخيار لإغلاق التطبيق وإعادة فتحه`,
            `إذا استمرت المشكلة بعد إعادة تشغيل التطبيق، يرجى النظر في الإبلاغ عنها باستخدام الروابط داخل التطبيق على شاشة الصفحة الرئيسية`
        ],
        suspend: "تعليق",
        resume: "استئناف",
        new: "جديد...",
        nodata: "لا توجد بيانات",
        findappid: "العثور على AppID",
        findappidsub: [
            `كل لعبة Steam لها رقم فريد مرتبط بها - يُسمى <span class="hl">AppID</span>. يمكنك العثور على AppID المرتبط بأي لعبة Steam عن طريق التحقق من أحد الآتي:`,
            `في <span class="hl">عميل Steam</span>، انقر بزر الماوس الأيمن على لعبة في <span class="hl">المكتبة</span> الخاصة بك وحدد <i>الخصائص</i> > <i>التحديثات</i> - سيتم سرد AppID هنا`,
            `عنوان <span class="hl">URL</span> لصفحة <span class="hl">المتجر</span> الخاصة باللعبة - سيكون الرقم المدرج بعد <span class="hl">app/</span>: <code class="appidhelpcode">https://store.steampowered.com/app/<span class="hl">4000</span></code>`,
            `مواقع الويب مثل <span class="hl">SteamDB</span> - سيقوم القسم <span class="hl">معلومات الأطباق</span> بسرد AppID لكل لعبة`
        ],
    },
    app: {
        content: {
            game: "لم يتم اكتشاف لعبة",
            customise: "تخصيص",
            test: "إظهار إشعار الاختبار"
        }
    },
    settings: {
        language: {
            title: "اللغة"
        },
        os: {
            title: "نظام التشغيل",
            content: {
                desktop: "إنشاء اختصار سطح المكتب",
                startwin: "البدء عند تسجيل الدخول",
                startmin: "البدء بحالة مصغرة",
                nohwa: "تعطيل التسارع العتادي",
                litemode: "وضع خفيف"
            }
        },
        notifications: {
            title: "الإشعارات",
            content: {
                rarity: "نسبة الندرة",
                rareonly: "ندرة فقط",
                all: "الكل",
                off: "إيقاف",
                showpercent: "إظهار النسبة المئوية",
                soundonly: "وضع الصوت فقط",
                extwin: "إشعارات البث",
                audiosrc: "مصدر الصوت",
                notify: "الإشعار",
                app: "التطبيق",
                nowtracking: "عرض إشعار التتبع",
                nowtrackingscale: "مقياس التتبع",
                shortcuts: "اختصارات الإشعار",
                noiconcache: "تعطيل ذاكرة التخزين المؤقت للرموز"
            }
        },
        media: {
            title: "وسائط",
            content: {
                steamss: "التقاط لقطة شاشة Steam",
                screenshots: "وسائط إضافية",
                off: "إيقاف",
                overlay: "التقاط لقطة شاشة مع تراكب الإشعار",
                monitors: "مصدر اللقطة الشاشة",
                ovpos: "موقع التراكب",
                ovmatch: "مطابقة موقع التخصيص",
                ovx: "إزاحة أفقية",
                ovy: "إزاحة رأسية",
                ovpath: "مسار اللقطة الشاشة",
                ssdelay: "تأخير اللقطة الشاشة",
                notifyimg: "صورة الإشعار",
                imgpath: "مسار الصورة"
            }
        },
        games: {
            title: "الألعاب",
            content: {
                linkedgames: "الألعاب المرتبطة",
                exclusionlist: "قائمة الاستبعاد"
            }
        },
        accessibility: {
            title: "سهولة الوصول",
            content: {
                noanim: "تعطيل الرسوم المتحركة لنافذة التطبيق",
                nvda: "تمكين دعم NVDA",
                tooltips: "إظهار تلميحات الأدوات"
            }
        },
        advanced: {
            title: "متقدم",
            content: {
                pollrate: "معدل الاستطلاع",
                releasedelay: "تأخير الإصدار",
                maxretries: "أقصى عدد لإعادة المحاولة",
                debug: "لوحة التصحيح",
                userust: "نمط المعالجة البديل",
                notifydebug: "عرض إشعار أدوات التطوير",
                usecustomfiles: "استخدام ملفات التطبيق المخصصة",
                showcustomfiles: "عرض ملفات التطبيق المخصصة"
            }
        },
        misc: {
            title: "متفرقات",
            content: {
                checkforupdates: "التحقق من التحديثات",
                log: "سجل التطبيق",
                reset: "إعادة تعيين التطبيق"
            }
        }
    },    
    customiser: {
        preset: {
            title: "الإعداد المسبق",
            content: {
                preset: "التنبيه المسبق",
                iconanim: "تحريك الرمز النادر",
                alldetails: "عرض كافة التفاصيل",
                usepercent: "استخدم النسبة المئوية",
                displaytime: "وقت العرض",
                scale: "مقياس",
                customtext: "النص المخصص",
                usegametitle: "استخدام عنوان اللعبة",
                customfont: "الخط المخصص"
            }
        },
        sound: {
            title: "الصوت",
            content: {
                soundmode: "وضع الصوت",
                file: "ملف",
                folder: "عشوائي",
                soundfile: "ملف الصوت",
                sounddir: "مجلد الصوت",
                volume: "الصوت"
            }
        },
        style: {
            title: "النمط",
            content: {
                bgstyle: "نمط الخلفية",
                solid: "صلب",
                gradient: "تدرج",
                img: "صورة",
                gameart: "فن اللعبة",
                gradientangle: "زاوية التدرج",
                bgimg: "صورة الخلفية",
                bgimgbrightness: "السطوع",
                brightness: "السطوع",
                blur: "ضبابية",
                roundness: "الدوران",
                fontsize: "حجم الخط",
                opacity: "الشفافية",
                bgonly: "الخلفية فقط",
                glow: "توهج",
                glowcolor: "اللون",
                glowsize: "الحجم",
                glowanim: "الرسوم المتحركة",
                glowspeed: "السرعة",
                off: "بلا",
                pulse: "نبض",
                rainbow: "قوس قزح",
                mask: "قناع",
                maskimg: "صورة القناع"
            }
        },
        colors: {
            title: "الألوان",
            content: {
                primarycolor: "اللون الأساسي",
                secondarycolor: "اللون الثانوي",
                tertiarycolor: "اللون الثالثي",
                fontcolor: "لون الخط",
                fontoutline: "خط الخط",
                fontoutlinecolor: "لون خط الخط",
                fontshadow: "ظل الخط",
                fontshadowcolor: "لون ظل الخط"
            }
        },
        icons: {
            title: "الرموز",
            content: {
                iconroundness: "دوران الرمز",
                plat: "شعار 100%",
                usegameicon: "استخدام رمز اللعبة",
                logo: "الشعار",
                decoration: "زخرفة",
                showdecoration: "إظهار الزخرفة",
                rarity: "الندرة",
                showhiddenicon: "عرض الرمز المخفي",
                hiddenicon: "الرمز المخفي",
                replacelogo: "استبدال الشعار"
            }
        },
        position: {
            title: "الموضع",
            content: {
                pos: "موضع الشاشة",
                usecustompos: "استخدام موضع مخصص",
                setcustompos: "تعيين",
                resetcustompos: "إعادة تعيين"
            }
        },
        theme: {
            title: "السمة",
            content: {
                updatetheme: "تحديث الثيم",
                savetheme: "حفظ السمة",
                sub: [
                    `يمكن اختيار <span class="hl">سمات المستخدم المحفوظة</span> من قائمة <span class="hl">تحديد السمة</span> على شاشة الصفحة الرئيسية.`,
                    `تأكد من أن <span class="hl">اسم السمة</span> م <u>فريد</u> - سيتم استبدال السمة السابقة بالسمة التي تطابق الاسم!`
                ],
                placeholder: "اسم السمة",
                theme: "السمة",
                importtheme: "استيراد السمة",
                import: "استيراد",
                importsub: [
                    `استيراد <span class="hl">ملف سمة</span> أنشأه المستخدم`,
                    `<span class="hl">السمات المستوردة</span> سيتم تحميلها تلقائيًا بمجرد استيرادها بنجاح، ويمكن اختيارها من قائمة <span class="hl">اختيار السمة</span>`,
                ],
                importidle: `حدد <span class="hl">ملف سمة</span> للاستيراد`,
                importcopied: `تم نسخ السمة بنجاح`,
                importrenamed: `تم إعادة تسمية السمة بنجاح`,
                importextracted: `تم استخراج السمة بنجاح`,
                importrewriting: `إعادة كتابة مسارات ملفات السمة...`,
                importconverting: `تحويل السمة...`,
                importcreating: `إنشاء السمة...`,
                importdone: `تم استيراد السمة بنجاح`,
                importfailed: `حدث خطأ أثناء استيراد ملف السمة المحدد!`,
                exporttheme: "تصدير السمة",
                export: "تصدير"                
            }
        }
    },
    logwin: {
        content: {
            tagline: "إليك ما حدث منذ بدء تشغيل التطبيق في",
            copylog: "نسخ محتويات السجل"
        }
    },
    reset: {
        content: {
            sub: `
                <div class="wrapper" id="resetsub">
                    <span>هل أنت متأكد؟</span>
                    <span>سيتم إعادة تعيين جميع البيانات التي تم تكوينها مسبقًا، <u>بما في ذلك التخصيصات</u>، إلى الإعدادات الافتراضية.</span>
                    <span>🛑 لا يمكن التراجع عن هذا الإجراء!</span>
                </div>
            `,
            reset: "إعادة تعيين"
        }
    },
    error: {
        content: {
            subtitle: "Steam Achievement Notifier واجه مشكلة ويحتاج إلى الإغلاق.",
            details: "إليك تفاصيل الخطأ:",
            sub: "انقر على الأزرار أدناه للإبلاغ عن هذه المشكلة عبر منصتك المفضلة.",
            report: "الإبلاغ",
            log: "سجل التطبيق",
            exit: "الخروج"
        }
    },
    tooltips: {
        game: "اللعبة التي يتم تتبع الإنجازات الخاصة بها حاليًا",
        usertheme: "حدد سمة محفوظة مسبقًا",
        customise: "تخصيص إشعارات الإنجازات",
        test: "عرض إشعار اختبار، بما في ذلك أي تخصيصات",
        kofi: "تبرع على Ko-Fi!",
        discord: "انضم على Discord!",
        github: "الإبلاغ عن مشكلة",
        lang: "حدد لغة واجهة المستخدم المستخدمة في التطبيق",
        desktop: "تبديل اختصار على سطح المكتب لتشغيل التطبيق",
        startwin: "بدء Steam Achievement Notifier تلقائيًا بعد تسجيل الدخول",
        startmin: "بعد التشغيل، إخفاء نافذة واجهة المستخدم للتطبيق حتى يتم فتحها من علبة النظام",
        nohwa: `تعطيل التسارع الأجهزة، مما قد يحسن الأداء على الأنظمة ذات الموارد المنخفضة، أو الأنظمة بدون وحدة معالجة رسومات مخصصة<br><br><span class="ttdesc">سيتم إعادة تشغيل التطبيق بعد تمكين/تعطيل هذا الخيار</span>`,
        litemode: "تعطيل جميع عناصر واجهة المستخدم التفاعلية، مع توفير وظائف محدودة فقط عبر أيقونة علبة النظام. قد يحسن استهلاك الموارد من التطبيق",
        rarity: "النسبة المئوية التي سيتم فيها تشغيل إشعارات الإنجازات النادرة. سيتم عرض أي إنجاز يتجاوز هذه القيمة كإشعار رئيسي",
        showpercent: "عرض نسبة فتح الإنجاز في الإشعار لأنواع محددة",
        soundonly: "تعطيل الإشعارات، وتشغيل الأصوات فقط المضبوطة عبر مخصص الإشعارات",
        extwin: "إنشاء نافذة خلفية مخفية تكرر أي إشعارات يتم عرضها حاليًا على الشاشة. يمكن بعد ذلك إضافة هذه النافذة كمصدر لالتقاط النافذة لاستخدامه في برامج البث مثل OBS",
        audiosrc: "حدد مصدر الصوت (أو تعطيله) الذي يتم إنشاؤه بواسطة التطبيق",
        nowtracking: "عرض إشعار يخطر المستخدم بأن الإنجازات للعبة قيد التشغيل يتم تتبعها",
        nowtrackingscale: `تعيين حجم إشعار التتبع`,
        shortcuts: "تشغيل إشعار اختبار عبر اختصار لوحة المفاتيح. يمكن تخصيص الاختصارات لكل نوع من أنواع الإشعارات",
        noiconcache: `تعطيل تخزين ذاكرة التخزين المؤقت لرموز الإنجازات أثناء تشغيل الألعاب.<br><br><span class="ttdesc">يمكن أن يحسن ذلك بشكل كبير من أداء التطبيق عند تشغيل الألعاب، وقد يحل أيضًا مشكلات التتبع مع الألعاب التي تحتوي على عدد كبير من الإنجازات. ومع ذلك، في الحالات النادرة، قد يؤدي تعطيل ذاكرة التخزين المؤقت للرموز إلى عدم ظهور رموز الإنجازات في الإشعارات</span>`,
        steamss: "التقاط لقطة شاشة من Steam عند فتح إنجاز",
        screenshots: "حدد نوع الوسائط الإضافية التي سيتم إنشاؤها عند عرض إشعار",
        monitors: "الشاشة التي سيتم التقاطها عند التقاط لقطة الشاشة",
        ovpos: "موضع التراكب للإشعار داخل لقطة الشاشة",
        ovmatch: "مطابقة موقع الشاشة المحدد في المخصص لهذا النوع من الإشعار",
        ovpath: "الموقع الذي سيتم حفظ لقطات الشاشة التي تم إنشاؤها بواسطة هذا الخيار",
        ssdelay: "إضافة تأخير من وقت حدوث الإشعار إلى وقت التقاط لقطة الشاشة",
        sspreview: "عرض معاينة لكيفية ظهور لقطة الشاشة عندما تتم حفظها",
        noanim: "تعطيل جميع الرسوم المتحركة للنوافذ وتأثيرات الانتقال في التطبيق",
        nvda: "تمكين نسخ معلومات الإنجاز إلى الحافظة عند فتح إنجاز، لتكون قابلة للقراءة بواسطة برامج قارئ الشاشة، مثل NVDA",
        tooltips: "عرض تلميحات عند تحويل المؤشر فوق بعض عناصر واجهة المستخدم",
        pollrate: `تعيين فاصل تحديث بيانات الإنجازات أثناء اللعب<br><br><span class="ttdesc">قد يزداد أو ينقص الأداء اعتمادًا على القيمة أو موارد النظام. تؤدي القيم الأعلى عادة إلى تحميل نظام أقل، ولكن قد تؤدي إلى تأخير إشعارات أكثر</span>`,
        releasedelay: `تعيين مدى الوقت الذي ينتظر فيه عملية العمل الخلفية لإعادة التشغيل بعد إصدار اللعبة الحالية. يؤثر على تتبع العمليات التلقائي والألعاب المرتبطة يدويًا<br><br><span class="ttdesc">يسمح بفترة زمنية أطول للتخلص الكامل من Steamworks من التطبيق. زيادة هذه القيمة يمكن أن تمنع السلوك غير العادي، مثل تتبع لعبة سُلِفَت مسبقًا</span>`,
        maxretries: `تعيين الحد الأقصى لعدد محاولات الربط بعملية تعمل بالفعل مع معرف تطبيق مكتشف. يؤثر على تتبع العمليات التلقائي والألعاب المرتبطة يدويًا<br><br><span class="ttdesc">يتم محاولة إعادة المحاولة مرة كل ثانية. إذا لم يتم ربط عملية تعمل بالفعل بمعرف التطبيق الحالي بعد هذا العدد من المحاولات، سيتم إرجاع عملية غير صالحة. في مثل هذه الحالات، ستحتاج اللعبة إلى الإصدار يدويًا عبر علبة النظام > الخيارات > إصدار اللعبة</span>`,
        debug: "افتح لوحة التصحيح، التي تعرض معلومات تتبع العملية بتفصيل",
        userust: "استخدم وظيفة بديلة مبنية على Rust للتحقق مما إذا كانت العمليات المتتبعة للعبة قيد التشغيل حاليًا على النظام. عند عدم التحقق، سيتم استخدام التحقق الافتراضي المعتمد على NodeJS بدلاً من ذلك.",
        notifydebug: "إنشاء نافذة أدوات المطور لجميع الإشعارات. مفيدة لتصحيح أخطاء / مشاكل الإشعار",
        usecustomfiles: "يتيح التنبيهات تحميل ملفات قابلة للتخصيص من قبل المستخدم. يُنصح بالحذر للمستخدمين العاديين",
        showcustomfiles: "فتح موقع الملفات المخصصة",
        log: "فتح نافذة سجل التطبيق، التي تعرض معلومات حول نشاط العملية، والتحذيرات والأخطاء",
        reset: "إزالة جميع بيانات التكوين وإعادة تشغيل التطبيق",
        playback: "إيقاف / استئناف تشغيل الرسوم المتحركة لمعاينة الإشعار",
        replay: "إعادة تشغيل الرسوم المتحركة لمعاينة الإشعار",
        preset: "حدد الإعداد المسبق للإشعار للتخصيص",
        iconanim: "تبديل حدود الرمز النادر والرسوم المتحركة",
        alldetails: "عرض كافة العناصر النصية داخل الإشعار، بما في ذلك تلك المخفية افتراضيًا لهذا الإعداد المسبق",
        usepercent: "عرض نسبة فتح الإنجاز بدلاً من قيمة الخبرة / ثانية",
        displaytime: "تعيين عدد الثواني التي سيتم عرض الإشعار فيها",
        scale: "زيادة أو تقليل حجم الإشعار",
        customtext: "تعيين رسالة مخصصة لتظهر ضمن الإشعار",
        usegametitle: "عرض عنوان اللعبة الحالية ضمن الإشعار",
        customfont: "تحميل خط مخصص لاستخدامه ضمن الإشعار",
        soundmode: "حدد إما ملف صوتي واحد، أو ملف صوتي مختار عشوائيًا من داخل مجلد يحتوي على عدة ملفات صوتية عند حدوث إشعار",
        soundfile: "تحديد ملف صوتي لتشغيله عند حدوث إشعار",
        sounddir: "حدد مجلدًا منه سيتم تحديد ملف صوتي بشكل عشوائي عند حدوث إشعار",
        volume: "تعيين مستوى الصوت للتشغيل للملف الصوتي",
        preview: "معاينة الملف الصوتي المحدد، أو ملف صوتي محدد عشوائيًا من المجلد",
        bgstyle: "حدد النمط لخلفية الإشعار",
        gradientangle: "تعيين زاوية التدرج",
        bgimg: "تحميل ملف صورة لاستخدامه كخلفية للإشعار",
        bgimgbrightness: "تعيين سطوع الصورة المستخدمة كخلفية الإشعار",
        brightness: "تعيين سطوع فن اللعبة المستخدم كخلفية للإشعار",
        roundness: "تعيين الدوران لحواف الإشعار",
        blur: "تعيين مستوى الضبابية المطبقة على خلفية الإشعار",
        fontsize: "تعيين حجم الخط المستخدم في الإشعار",
        opacity: "تعيين شفافية الإشعار بشكل عام",
        bgonly: "تعيين الشفافية فقط لخلفية الإشعار، مع الاحتفاظ ببقية العناصر على شفافية كاملة",
        glow: "تمكين تأثير السطوع الذي يحيط بالإشعار",
        glowcolor: "تعيين لون تأثير السطوع",
        glowsize: "تعيين حجم تأثير السطوع",
        glowanim: "تحديد رسم متحرك مُعدّ مسبقًا لتطبيقه على تأثير السطوع",
        glowspeed: "تعيين سرعة الرسم المتحرك المطبق على تأثير السطوع",
        mask: "تمكين تقنية الإخفاء لأجزاء من الإشعار باستخدام صورة مخصصة",
        maskimg: `تحميل ملف صورة لاستخدامه كإخفاء<br><br><span class="ttdesc">في CSS، <code class="ttcode">mask-mode: alpha</code> تعمل بالطريقة المعاكسة لما يتوقع عادة - ستُخفى مناطق الشفافية في ملف الصورة، وستسمح مناطق اللون الأسود / الرمادي بظهور العناصر أدناه</span>`,
        primarycolor: "تعيين اللون الأساسي للإشعار",
        secondarycolor: "تعيين اللون الثانوي للإشعار",
        tertiarycolor: "تعيين اللون الثالثي للإشعار",
        fontcolor: "تعيين لون النص المعروض ضمن الإشعار",
        fontoutline: "إضافة حدود لجميع النصوص المعروضة ضمن الإشعار",
        fontoutlinecolor: "تعيين لون حدود النص",
        fontshadow: "إضافة ظل لجميع النصوص المعروضة ضمن الإشعار",
        fontshadowcolor: "تعيين لون ظل النص",
        iconroundness: "تعيين الدوران لرمز الإنجاز / اللعبة المعروض ضمن الإشعار",
        plat: "تحميل ملف صورة لاستخدامه كرمز 100%",
        usegameicon: "استبدال الرمز الافتراضي للإشعار برمز اللعبة الحالية",
        showhiddenicon: "عرض صورة تشير إلى أن الإنجاز مخفي في الإشعار",
        hiddenicon: "تحميل ملف صورة لاستبدال رمز الإنجاز المخفي",
        logo: "تحميل ملف صورة لاستبدال رمز الشعار",
        decoration: "تحميل ملف صورة لاستبدال رمز الزخرفة",
        showdecoration: "تبديل رؤية رمز الزخرفة",
        replacelogo: "استبدال أيقونة الشعار في الإشعار بالزخرفة المحددة",
        pos: "تعيين موضع الإشعار على الشاشة",
        usecustompos: "تمكين التمرير المخصص للإشعار",
        setcustompos: "تعيين الموضع المخصص للإشعار",
        resetcustompos: "إعادة تعيين موضع الإشعار إلى الموضع المخصص الافتراضي",
        updatetheme: "تحديث الثيم الحالي مع الخيارات المخصصة المختارة",
        savetheme: "حفظ كل الخيارات المكونة للتخصيص كسمة جديدة",
        visibilitybtn: "تبديل رؤية العنصر في المعاينات المخصصة والإشعارات التجريبية",
        delbtn: "إعادة تعيين العنصر إلى الافتراضي",
        link: `افتح <span class="hl">قائمة إدارة الألعاب المرتبطة</span>`,
        imgpath: "الموقع الذي ستحفظ فيه صور الإشعارات التي تم إنشاؤها بهذا الخيار",
        linkedgames: `تخطي <span class="hl">تتبع العملية التلقائية</span> لألعاب Steam محددة<br><br><span class="ttdesc">يجب استخدام هذا الخيار فقط لحالات محددة جدًا. يجب ألا يحتاج المستخدمون إلى استخدام هذا الخيار في الظروف العادية!</span>`,
        exclusionlist: `منع تتبع الإنجازات في ألعاب Steam محددة بواسطة التطبيق<br><br><span class="ttdesc">يجب استخدام هذا الخيار فقط لحالات محددة جدًا. يجب ألا يحتاج المستخدمون إلى استخدام هذا الخيار في الظروف العادية!</span>`,
        ovx: "إزاحة الإشعار المعروض في لقطة الشاشة أفقيًا",
        ovy: "إزاحة الإشعار المعروض في لقطة الشاشة عموديًا",
        importtheme: `استيراد التخصيصات عبر <span class="hl">ملف سمة</span> أنشأه المستخدم`,
        exporttheme: `تصدير <span class="hl">السمة</span> المحددة حاليًا للمشاركة<br><br><span class="ttdesc">قبل محاولة التصدير، يرجى التأكد من اختيار <span class="hl">السمة</span> المطلوبة (من قائمة <span class="hl">اختيار السمة</span>). يرجى أيضًا التأكد من حفظ التخصيصات على <span class="hl">السمة</span> المحددة (من قائمة <span class="hl">حفظ السمة</span>)<br><br><u>أي تخصيصات لم يتم حفظها بعد على <span class="hl">السمة</span> الحالية لن يتم تصديرها!</u></span>`
    },
    update: {
        updateavailable: "تحديث متاح",
        sub: [
            `<span id="newversion"></span>`,
            "توجد تحديث جديد لـ Steam Achievement Notifier!",
            `تتوفر ملاحظات الإصدار الكاملة على <span id="discordreleasenotes"></span> و <span id="githubreleasenotes"></span>`
        ],
        update: "تحديث"
    },
    linkgame: {
        content: {
            exepath: "مسار التنفيذ",
            managesub: [
                `ربط ملف تنفيذ لعبة يدويًا بـ <span class="hl">AppID</span> محدد، أو <span class="hl">إلغاء الربط</span> للملف الموجود بالفعل`,
                `لن يستخدم Steam Achievement Notifier تتبع العملية <span class="hl">التلقائي</span> لأي <span class="hl">الألعاب المرتبطة</span> - بدلاً من ذلك، سيتم تتبع الملف التنفيذي المحدد عندما يتم الكشف عن <span class="hl">AppID</span> المقترن`,
                `<span class="hl" id="appidhelp"><u>كيف يمكنني العثور على AppID لعبة Steam؟</u></span>`
            ],
            linknew: "لعبة جديدة مرتبطة",
            linknewsub: [
                `إنشاء رابط جديد بين <span class="hl">ملف تنفيذ اللعبة</span> والـ <span class="hl">AppID</span> المرتبط به`,
                `بمجرد الإنشاء، يمكن <span class="hl">إلغاء الربط</span> عبر الحوار السابق <span class="hl">إدارة الألعاب المرتبطة</span>`
            ],
            "link": "ربط",
        }
    },
    exclusions: {
        content: {
            managesub: [
                `أضف <span class="hl">AppID</span> لأي لعبة Steam إلى <span class="hl">قائمة الاستبعاد</span>`,
                `لن يحاول Steam Achievement Notifier تتبع بيانات الإنجازات لأي <span class="hl">AppID</span> لعبة تمت إضافتها إلى <span class="hl">قائمة الاستبعاد</span>`,
                `<span class="hl" id="appidhelp"><u>كيف يمكنني العثور على AppID لعبة Steam؟</u></span>`
            ],
            exclusionnew: "استبعاد جديد",
            exclusionnewsub: [
                `أدخل <span class="hl">AppID</span> لإضافته إلى <span class="hl">قائمة الاستبعاد</span>`
            ]
        }
    }
}