export const translations = {
    global: {
        main: "Главна",
        semi: "Полу",
        rare: "Рядък",
        plat: "100%",
        trophymain: "Бронзов",
        trophysemi: "Сребърен",
        trophyrare: "Златен",
        trophyplat: "Платинен",
        test: "Тестване на известия",
        topleft: "Горе вляво",
        topcenter: "Горе в средата",
        topright: "Горе вдясно",
        bottomleft: "Долу вляво",
        bottomcenter: "Долу в средата",
        bottomright: "Долу вдясно",
        ok: "Добре",
        preview: "Преглед",
        save: "Запазване",
        back: "Назад",
        edit: "Редактиране",
        lockedby: "Заключено от $lock",
        settings: "Настройки",
        appversion: "Версия на приложението",
        image: "Изображение",
        audio: "Аудио",
        folder: "Папка",
        font: "Шрифт",
        select: "Избор",
        gametitle: "Заглавие на играта",
        congrats: "Поздравления!",
        achievementunlocked: "Отключено постижение",
        gamecomplete: "100% Завършена",
        achievementdesc: "Цъкнахте бутона за показване на тестово известие",
        gamecompletedesc: "Отключихте всички постижения!",
        defaultcustomfont: "По подразбиране (Не е избран шрифт)",
        defaultsoundfile: "По подразбиране (Не е избран файл за звук)",
        defaultsounddir: "По подразбиране (Не е избрана папка)",
        nowtracking: "В момента проследяване на постижения за:",
        nopreview: "Прегледът не е наличен за нативната операционна система",
        options: "Опции",
        resetwindow: "Нулиране на прозореца",
        show: "Показване",
        exit: "Изход",
        donotshowagain: "Не показвай този диалог отново",
        releasegame: "Освободи игра",
        releasegamesub: [
            `Рестартирайте процеса на работника във фона и освободете текущата игра от проследяване`,
            `Опитайте тази опция, ако наскоро сте затворили игра, но Steam все още я показва като работеща, или ако Steam Achievement Notifier все още показва, че проследява игра, която вече е била затворена`
        ],
        noupdateavailable: "Няма налични актуализации",
        latestversion: "Последната версия е инсталирана",
        missingdeps: "Липсваща зависимост",
        restartapp: "Рестартиране на приложението",
        restartappsub: [
            `Ако нещата не функционират правилно, използвайте тази опция, за да затворите и отворите отново приложението`,
            `Ако проблемът продължава след рестартиране на приложението, моля, обмислете да го сигнализирате, като използвате вградените връзки на началния екран на приложението`
        ],
        suspend: "Приоставяне",
        resume: "Възобновяване",
        new: "Ново...",
        nodata: "Няма данни",
        findappid: "Намерете AppID",
        findappidsub: [
            `Всяка игра в Steam има уникален номер, наречен <span class="hl">AppID</span>. Можете да намерите съответният AppID на всяка игра в Steam, като проверите един от следните методи:`,
            `В <span class="hl">клиента на Steam</span>, щракнете с десния бутон на мишката върху игра във вашата <span class="hl">библиотека</span> и изберете <i>Свойства</i> > <i>Актуализации</i> - AppID ще бъде изброен тук`,
            `URL адресът на страницата на <span class="hl">магазина</span> на играта - това е числото, изброено след <span class="hl">app/</span>: <code class="appidhelpcode">https://store.steampowered.com/app/<span class="hl">4000</span></code>`,
            `Уебсайтове като <span class="hl">SteamDB</span> - секцията <span class="hl">Информация за App</span> ще изброи AppID за всяка игра`
        ],
        noexe: "EXE файлът на играта не е намерен!",
        noexesub: "Кликнете тук за повече информация",
        noexedialogsub: [
            `Steam Achievement Notifier не успя автоматично да открие изпълнимия файл за тази игра. Местоположението на изпълнимия файл на играта е необходимо, за да може играта да бъде „освободена“ след затварянето ѝ`,
            `За да освободите играта ръчно след затварянето ѝ, <i>щракнете с десния бутон</i> върху <span class="hl">иконата в System Tray</span> > <span class="hl">Опции</span> > <span class="hl">Освобождаване на играта</span>, или използвайте <span class="hl">прекият път за освобождаване на играта</span>`,
            `Като алтернатива, щракнете върху бутона <span class="hl">Добавяне</span> по-долу, за да добавите изпълнимия файл, свързан с който и да е активен прозорец, към <span class="hl">Настройки</span> > <span class="hl">Игри</span> > <span class="hl">Автоматично освобождаване на игри</span>`,
        ],
        autorelease: "Автоматично освобождаване на игра",
        autoreleasesub: [
            `Ако Steam все още показва игра като <i>В игра</i> след затваряне на прозореца на играта, опитайте да добавите нов запис към <span class="hl">Автоматично освобождаване на игри</span>`,
            `За да направите това за текущата игра, щракнете върху бутона <span class="hl">Добавяне</span> по-долу, за да добавите изпълнимия файл, свързан с който и да е активен прозорец, към <span class="hl">Настройки</span> > <span class="hl">Игри</span> > <span class="hl">Автоматично освобождаване на игри</span>`,
        ],
        linkgamehelplink: `<span class="hl help" id="linkgamehelp"><u>Какво се случва, когато щракна бутона Добавяне?</u></span>`,
        linkgamehelp: "Добавяне на запис чрез фокус",
        linkgamehelpsub: [
            `Щракването върху бутона <span class="hl">Добавяне</span> автоматично ще добави нов запис към <span class="hl">Настройки</span> > <span class="hl">Игри</span> > <span class="hl">Автоматично освобождаване на игри</span>, използвайки информация от текущо активния прозорец.`,
            `След щракване върху бутона <span class="hl">Добавяне</span> ще започне 5-секунден таймер`,
            `Преди таймерът да изтече, поставете фокус върху прозореца на играта`,
            `След като таймерът приключи, нов запис за текущия <span class="hl">AppID</span> ще бъде добавен към <span class="hl">Настройки</span> > <span class="hl">Игри</span> > <span class="hl">Автоматично освобождаване на игри</span>, използвайки изпълнимия файл, свързан с активния прозорец`,
            `Новите опити ще презапишат съществуващите записи, или записът може да бъде премахнат чрез <span class="hl">Настройки</span> > <span class="hl">Игри</span> > <span class="hl">Автоматично освобождаване на игри</span> чрез щракване върху бутона <span id="linkhelpunlink"></span>`
        ],
        addlinkfailed: "Неуспешно добавяне на прозореца",
        addlinkfailedsub: `Щракнете върху бутона <span class="hl">Добавяне</span>, за да опитате отново`,
        webhookunlockmsg: "$user отключи постижение",
        webhookunlockmsgplat: "$user отключи всички постижения",
        webhookingame: "в $gamename",
        notconnected: "Няма връзка",
        raloghelp: "Моята игра не се разпознава",
        raenablelog: `Файлове на логовете на емулатора`,
        raenablelogsub: [
            `За да получите достъп до вътрешни събития на играта (като текущото състояние на играта, информация за отключени постижения и др.), трябва да бъде активирано записването в <span class="hl">файл с дневник</span> <u>във всеки избран емулатор</u>.<br><br>Всеки избран емулатор <u>трябва да използва този <span class="hl">файл с дневник</span></u> като стойност за <span class="hl">Път на файла с дневник</span>.`,
            `<details>
                <summary id="retroarch">RetroArch</summary>
                <div>
                    <span class="hl">RetroArch > Настройки > Регистрация</span> трябва да бъде конфигуриран със следните настройки:
                    <br>
                    <ul>
                        <li><span class="hllb">Подробност на дневника</span>: <span class="hlgreen">ВКЛЮЧЕНО</span></li>
                        <li><span class="hllb">Ниво на регистрация на интерфейса</span>: <span class="hlgreen">1 (Информация)</span></li>
                        <li><span class="hllb">Запис в файл</span>: <span class="hlgreen">ВКЛЮЧЕНО</span></li>
                        <li><span class="hllb">Отбелязване с времеви печат</span>: <span class="hlred">ИЗКЛЮЧЕНО</span></li>
                    </ul>
                    <br>
                    При стандартни настройки на инсталацията <span class="hl">"retroarch.log"</span> се съхранява в:
                    <br>
                    <ul>
                        <li><span class="hllb">%SYSTEMDRIVE%\\RetroArch-Win64\\Logs</span></li>
                    </ul>
                </div>
            </details>`,
            `<details>
                <summary id="dolphin">Dolphin</summary>
                <div>
                    <span class="hl">Dolphin > Изглед > Показване на конфигурация на дневника</span> трябва да бъде конфигуриран със следните настройки:
                    <br>
                    <ul>
                        <li><span class="hllb">Подробност</span>: <span class="hlgreen">Информация</span></li>
                        <li><span class="hllb">Изходи на дневника</span> > <span class="hlgreen">Запис в файл</span></li>
                        <li><span class="hllb">Типове дневници</span> > <span class="hlgreen">Постижения (RetroAchievements)</span></li>
                    </ul>
                    <br>
                    При стандартни настройки на инсталацията <span class="hl">"dolphin.log"</span> се съхранява на едно от следните места:
                    <br>
                    <ul>
                        <li><span class="hllb">%APPDATA%\\Dolphin Emulator\\Logs</span></li>
                        <li><span class="hllb">%USERPROFILE%\\Documents\\Dolphin Emulator\\Logs</span></li>
                        <li>🐧 <span class="hllb">$XDG_DATA_HOME/dolphin-emu/Logs</span></li>
                    </ul>
                </div>
            </details>`,
            `<details>
                <summary id="pcsx2">PCSX2</summary>
                <div>
                    <span class="hl">PCSX2 > Инструменти > Активиране на регистриране във файл</span> трябва да бъде активирано
                    <br>
                    <br>
                    При използване на стандартни настройки за инсталация, <span class="hl">"emulog.txt"</span> се съхранява в:
                    <br>
                    <ul>
                        <li><span class="hllb">%USERPROFILE%\\Documents\\PCSX2\\Logs</span></li>
                    </ul>
                </div>
            </details>`,
            `<details>
                <summary id="duckstation">Duckstation</summary>
                <div>
                    <ul style="background-color: var(--primary); outline: 0.1rem solid red;">
                        <li>❗ <span class="dialogcode" style="background-color: var(--mediumgrey);">RA_Integration-x64.dll</span> трябва да бъде <span class="hl help" url="https://retroachievements.org/bin/RA_Integration-x64.dll"><u>изтеглен</u></span> и преместен в <span class="hl">инсталационната директория на Duckstation</span></li>
                    </ul>
                    <br>
                    <span class="hl">Duckstation > Настройки > Постижения > RAIntegration (само за разработчици)</span> трябва да бъде активирано
                    <br>
                    <br>
                    При използване на настройките по подразбиране за инсталация, <span class="hl">"RALog.txt"</span> се съхранява в:
                    <br>
                    <ul>
                        <li><span class="hllb">%USERPROFILE%\\Downloads\\duckstation-windows-x64-release\\RACache</span></li>
                    </ul>
                </div>
            </details>`,
            `<details>
                <summary id="dolphin">PPSSPP</summary>
                <div>
                    <span class="hl">PPSSPP > Settings > Developer Tools > General > Log to File</span> трябва да бъде активирано и конфигурирано със следните настройки:
                    <br>
                    <ul>
                        <li><span class="hllb">Achievements</span>: <span class="hlgreen">Info</span></li>
                    </ul>
                    <br>
                    При използване на стандартните настройки за инсталация, <span class="hl">"log.txt"</span> се съхранява в:
                    <br>
                    <ul>
                        <li><span class="hllb">%PROGRAMFILES%\\PPSSPP\\PSP\\memstick\\PSP\\SYSTEM\\DUMP</span></li>
                    </ul>
                </div>
            </details>`
        ],
        betaunsupported: "Неподдържана Бета версия",
        betaunsupportedsub: [
            "Излязла е нова версия на Steam Achievement Notifier!",
            `<u>Тази Бета версия вече не се поддържа</u>. Моля, изтеглете и инсталирайте най-новата официална версия от Github, като използвате бутона <span class="hl">Публикации</span> по-долу.`,
            "Благодарим ви, че тествахте! 💜"
        ],
        betaghreleases: "Публикации",
        checkapplog: "Моля, проверете журнала на приложението за подробности."
    },
    app: {
        content: {
            game: "Няма засечена игра",
            customise: "Персонализиране",
            test: "Покажи тестово уведомление"
        }
    },
    settings: {
        language: {
            title: "Език",
            content: {
                steamlang: "Превод на постиженията на езика на Steam",
                maxsteamlangretries: "Максимален брой опити за превод"
            }
        },
        os: {
            title: "Операционна система",
            content: {
                desktop: "Създай пряк път на работния плот",
                startwin: "Стартиране при влизане в системата",
                startmin: "Започни минимизирано",
                nohwa: "Изключи хардуерно ускорение",
                litemode: "Лек режим"
            }
        },
        notifications: {
            title: "Известия",
            content: {
                rarity: "Процент на рядкост",
                semirarity: "Процент на сребро",
                rareonly: "Само рядки",
                all: "Всички",
                off: "Изключено",
                showpercent: "Покажи процент",
                soundonly: "Само звук",
                nowtracking: "Показване на Известие за Проследяване",
                nowtrackingscale: "Мащаб за Проследяване",
                nowtrackingpos: "Проследяване на Позиция",
                shortcuts: "Известия за бърз достъп",
                noiconcache: "Изключване на кеша за икони",
                webhooks: "Публикувай в Discord сървър",
                webhooktypes: "Типове уебкукове",
                webhookurl: `URL на Webhook`,
                webhookcaution: `Чрез активирането на тази опция и предоставянето на валиден Discord Webhook линк, вие се съгласявате, че разбирате, че <u>всички постижения и информация за игрите на текущия Steam потребител</u> ще бъдат публикувани в определения Discord сървър чрез предоставения Webhook линк.<br><br>Ако не желаете Steam Achievement Notifier да публикува тази информация от ваше име, моля, деактивирайте тази опция.`,
                webhooklaststatus: "Последен статус",
                webhookspoilers: `Добави етикет за спойлер`,
                webhookappid: `Показване на AppID`,
                replaynotify: "Известие за повторение",
                replaynotifyshortcut: "Преки път за повторение",
                customtrigger: "Персонализиран Тригер",
                customtriggershortcut: "Бърз Клавиш за Тригера",
                customtriggerdelay: "Закъснение на Тригера",
                customtriggerusedisplaytime: "Използвай Време за Показване",
                trophymode: "Режим Трофеи",
                notifymax: "Максимален брой известия", 
                notifyspace: "Разстояние между известията",
                notify1line: "Ограничаване на текста до 1 ред"
            }
        },
        games: {
            title: "Игри",
            content: {
                linkedgames: "Автоматично освобождаване на игри",
                themeswitch: "Автоматична смяна на теми",
                exclusionlist: "Списък за изключване",
                inclusionlist: "Списък за включване",
                listmode: "Режим на списъка",
                exclusion: "Изключване",
                inclusion: "Включване"
            }
        },
        media: {
            title: "Медия",
            content: {
                steamss: "Вземи скрийншот на Steam",
                screenshots: "Допълнителни медии",
                off: "Изключено",
                ssonly: "Само екранна снимка",
                overlay: "Снимка на екрана с известия",
                monitors: "Източник на скрийншот",
                hdrmode: "HDR режим",
                ovpos: "Позиция на слоя",
                ovmatch: "Съвпадение с персонализирана позиция",
                ovx: "Хоризонтално отместване",
                ovy: "Вертикално отместване",                
                ovpath: "Път на скрийншота",
                ssdelay: "Забавяне на скрийншота",
                notifyimg: "Изображение за известие",
                imgpath: "Път на изображението",
                ssenabled: "Активиране",
                ssmode: "Режим на екранна снимка",
                screen: "Екран",
                window: "Прозорец",
                rauseemudir: "Запазване в поддиректория на емулатора",
                ssext: "Формат на екранната снимка",
                png: "PNG",
                jpg: "JPG",
                ssaddtosteam: "Добавяне към Steam"
            }
        },
        streaming: {
            title: "Излъчване",
            content: {
                extwin: "Известия за поточно предаване",
                extwinframerate: "Честота на кадрите",
                extwinshow: "Показване на прозореца",
                audiosrc: "Аудио източник",
                notify: "Известие",
                app: "Приложение",
                off: "Изключен звук",
                statwin: "Прозорец за статистика на постиженията",
                statwinaot: "Винаги отгоре",
                noachievements: "Няма постижения за показване",
                startgame: "Стартирайте игра, за да покажете постиженията!",
                max: "Максимум",
                custom: "Персонализирано...",
                statwinshortcut: "Пряк път за наслагване",
                gametimerwin: "Таймер за завършване на играта",
                gametimerwinshortcut: "Клавишна комбинация за таймера",
                gametimerwinaot: "Винаги отгоре",
                resetgametimer: "Нулиране на таймера",
                resetgametimersub: `
                    <div class="wrapper resetsub">
                        <span>Сигурни ли сте?</span>
                        <span>Това ще нулира таймера за завършване на играта за текущата игра обратно до 00:00:00.000.</span>
                        <span class="noundo">🛑 Това не може да бъде отменено!</span>
                    </div>
                `,
                resetgametimerfailed: "Неуспешно нулиране на таймера.",
                resetgametimercomplete: "AppID $appid вече е завършен.",
                extwinnotify: "Показване на известие на екрана"
            }
        },
        accessibility: {
            title: "Достъпност",
            content: {
                noanim: "Изключи анимации на прозореца на приложението",
                noupdatedialog: "Деактивиране на диалог за актуализация",
                nvda: "Включи поддръжка за NVDA",
                tooltips: "Покажи подсказки",
                showsystrayopts: "Показване на опции за системната лента",
                releaseshortcut: "Пряк път за освобождаване на игра",
                noshortcuts: "Деактивиране на клавишните комбинации"
            }
        },
        advanced: {
            title: "Напреднали",
            content: {
                pollrate: "Честота на Анкета",
                initdelay: "Забавяне на проследяването",
                releasedelay: "Забавяне на Пускането",
                maxretries: "Максимален Брой Опити за Обработка",
                debug: "Панел за отстраняване на грешки",
                userust: "Алтернативен режим на обработка",
                notifydebug: "Показване на Известие за Дебъгване",
                exportachdata: "Експортиране на данни за постижения",
                lognum: "Предишни лог файлове", 
                audiocooldown: "Интервал за аудио",
                usecustomfiles: "Използване на Персонализирани Файлове на Приложението",
                showcustomfiles: "Показване на Персонализирани Файлове на Приложението",
                appdatadir: "Покажи папката AppData",
                backup: "Архивиране",
                backuppath: "Път за архивиране",
                backupsub: [
                    "Архивирайте съдържанието на папката AppData на приложението на избрано място",
                    "Този архив ще служи като точка за възстановяване на текущото състояние на приложението",
                    `Възстановете всеки предишен архив чрез <span class="hl">Настройки</span> > <span class="hl">Разширени</span> > <span class="hl">Възстановяване</span>`
                ],
                backupfailed: "Неуспешно създаване на архив.",
                restore: "Възстановяване",
                restoresub: [
                    "Възстановете съдържанието на папката AppData на приложението от предишен архив",
                    `Изберете архивен файл <span class="hl">.sanbak</span> за възстановяване. Този файл ще бъде запазен след завършване на възстановяването`,
                    "❗ След потвърждение, приложението ще се рестартира, за да възстанови избрания архивен файл"
                ],
                restorefailed: "Неуспешно възстановяване на архива.",
                usesanwatcher: "SANWatcher",
                releasewaittime: "Време за изчакване преди освобождаване"
            }
        },
        ra: {
            title: "Retro Achievements",
            content: {
                raemus: "Емулатори",
                rauser: "Потребителско име",
                rakey: "API ключ",
                retroarch: "RetroArch",
                dolphin: "Dolphin",
                pcsx2: "PCSX2",
                duckstation: "Duckstation",
                ppsspp: "PPSSPP",
                installdir: "Път до лог файл",
                rapercenttype: "Тип на процента",
                hard: "Хардкор",
                soft: "Софткор",
                placeholder: "Въведете пътя до лог файла",
                logfile: "Файл с дневник",
                status: "Статус",
                game: "Игра",
                lastachievement: "ID на последното постижение",
                wait: "Изчакване на емулатора",
                idle: "Изчакване на събитие в играта",
                start: "Започване на играта",
                stop: "Спиране на играта",
                achievement: "Постижение отключено"
            }
        },
        misc: {
            title: "Разни",
            content: {
                colorprofile: "Цветови профил",
                checkforupdates: "Проверка за актуализации",
                log: "Дневник на Приложението",
                reset: "Нулиране на приложението"
            }
        }
    },
    customiser: {
        preset: {
            title: "Предварителна настройка",
            content: {
                preset: "Предварителна настройка за известия",
                iconanim: "Рядко анимиран икона",
                alldetails: "Показване на всички детайли",
                usepercent: "Използване на процент",
                displaytime: "Време за показване",
                scale: "Мащаб",
                customtext: "Персонализиран текст",
                usegametitle: "Използване на заглавие на играта",
                customfont: "Персонализиран шрифт"
            }
        },
        sound: {
            title: "Звук",
            content: {
                soundmode: "Режим на звук",
                file: "Файл",
                folder: "Случаен",
                soundfile: "Аудио файл",
                sounddir: "Папка със звук",
                volume: "Сила на звука"
            }
        },
        style: {
            title: "Стил",
            content: {
                bgstyle: "Стил на фона",
                solid: "Единен цвят",
                gradient: "Градиент",
                img: "Изображение",
                gameart: "Гейм арт",
                gradientangle: "Ъгъл на градиента",
                bgimg: "Фоново изображение",
                bgachicon: "Използвайте икона на постижение",
                bgimgbrightness: "Яркост",
                brightness: "Яркост",
                blur: "Замъгляване",
                roundness: "Закръгленост",
                fontsize: "Размер на шрифта",
                usecustomfontsizes: "Използване на персонализирани размери на шрифта",
                unlockmsgfontsize: "Съобщение за отключване",
                titlefontsize: "Заглавие",
                descfontsize: "Описание",
                textvspace: "Разстояние между текстовете",
                opacity: "Прозрачност",
                bgonly: "Само фон",
                glow: "Сияние",
                glowcolor: "Цвят",
                glowsize: "Размер",
                glowx: "Хоризонтално Отместване",
                glowy: "Вертикално Отместване",
                glowopacity: "Непрозрачност",
                glowanim: "Анимация",
                glowspeed: "Скорост",
                glowrarity: "Използване на рядкост",
                glowcolorbronze: "Рядкост: > $semirarity",
                glowcolorsilver: "Рядкост: < $semirarity & > $rarity",
                glowcolorgold: "Рядкост: < $rarity",
                off: "Няма",
                pulse: "Пулс",
                double: "Двойно",
                focus: "Фокус",
                orbit: "Орбита",
                fluorescent: "Флуоресцентен",
                rainbow: "Дъга",
                mask: "Маска",
                maskimg: "Изображение на маска",
                useoutline: "Контур",
                outline: "Тип на контура",
                outlinecolor: "Цвят на контура",
                outlinewidth: "Ширина на контура",
                dashed: "Пунктир",
                dotted: "Точков"
            }
        },
        colors: {
            title: "Цветове",
            content: {
                primarycolor: "Основен цвят",
                secondarycolor: "Вторичен цвят",
                tertiarycolor: "Третиран цвят",
                iconshadowcolor: "Цвят на сянката на рядката икона",
                iconanimcolor: "Цвят на анимацията на рядката икона",
                fontcolor: "Цвят на шрифта",
                usecustomfontcolors: "Използване на персонализирани цветове за шрифта",
                unlockmsgfontcolor: "Цвят 1",
                titlefontcolor: "Цвят 2",
                descfontcolor: "Цвят 3",
                fontoutline: "Очертаване на шрифта",
                fontoutlinecolor: "Цвят на контура на шрифта",
                fontoutlinescale: "Мащаб на контура на шрифта",
                fontshadow: "Сянка на шрифта",
                fontshadowcolor: "Цвят на сянката на шрифта",
                fontshadowscale: "Мащаб на сянката на шрифта",
                fontshadowx: "Хоризонтално изместване",
                fontshadowy: "Вертикално изместване"
            }
        },
        icons: {
            title: "Икони",
            content: {
                iconscale: "Мащаб на иконата",
                iconroundness: "Закръгленост на иконата",
                showiconborder: "Показване на граница на иконата",
                iconborderimg: "Граница на иконата",
                iconborderpos: "Позиция на границата",
                iconborderscale: "Мащаб на границата",
                iconborderx: "Хоризонтално изместване",
                iconbordery: "Вертикално изместване",
                iconborderrarity: "Използвай рядкост",
                iconborderimgbronze: "Рядкост: > $semirarity",
                iconborderimgsilver: "Рядкост: < $semirarity & > $rarity",
                front: "Отпред",
                back: "Отзад",
                plat: "100% Лого",
                usegameicon: "Използване на иконата на играта",
                gameicontype: "Тип на иконата на играта",
                usecustomimgicon: "Използване на персонализирана икона",
                customimgicon: "Персонализирана икона",
                icon: "Икона",
                logo: "Лого",
                logoscale: "Мащаб на логото",
                decoration: "Украса",
                decorationscale: "Мащаб на декорацията",
                showdecoration: "Показване на украсата",
                rarity: "Рядкост",
                showhiddenicon: "Показване на скрита икона",
                hiddenicon: "Скрита икона",
                replacelogo: "Заменете логото"
            }
        },
        position: {
            title: "Позиция",
            content: {
                pos: "Позиция на екрана",
                usecustompos: "Използване на персонализирана позиция",
                setcustompos: "Задаване",
                copycustompos: "Приложи за всички",
                resetcustompos: "Нулиране"
            }
        },
        theme: {
            title: "Тема",
            content: {
                updatetheme: "Актуализиране на Темата",
                savetheme: "Запази темата",
                sub: [
                    `Запазените <span class="hl">Потребителски теми</span> могат да бъдат избрани от менюто <span class="hl">Изберете тема</span> на началния екран.`,
                    `Уверете се, че <span class="hl">Името на темата</span> е <u>уникално</u> - име, което съвпада със съществуваща тема <u>ще презапише предишната</u>!`
                ],
                placeholder: "Име на темата",
                theme: "Тема",
                importtheme: "Импортиране на тема",
                import: "Импортиране",
                importsub: [
                    `Импортиране на <span class="hl">файл с тема</span>, създаден от потребител`,
                    `<span class="hl">Импортираните теми</span> ще бъдат заредени автоматично след успешен импорт и могат да бъдат избрани от менюто <span class="hl">Избор на тема</span>`,
                ],
                importidle: `Изберете <span class="hl">файл с тема</span> за импортиране`,
                importcopied: `Темата беше успешно копирана`,
                importrenamed: `Темата беше успешно преименувана`,
                importextracted: `Темата беше успешно извлечена`,
                importrewriting: `Пренаписване на пътищата към файловете на темата...`,
                importconverting: `Конвертиране на тема...`,
                importcreating: `Създаване на тема...`,
                importdone: `Темата беше успешно импортирана`,
                importfailed: `Грешка при импортиране на избрания файл с тема!`,
                exporttheme: "Експортиране на тема",
                export: "Експортиране",
                exporterrortitle: "Грешка при експортиране",
                exporterrorsub: [
                    "Възникна грешка при опит за експортиране на избраната тема",
                    `Опитайте да запазите текущата тема (<i>чрез <span class="hl">Запази темата</span></i>) и опитайте отново да експортирате`,
                    `Ако проблемът продължава, моля, копирайте грешката по-долу и докладвайте чрез бутоните за връзка на <span class="hl">Началния екран</span>`
                ],
                synctheme: "Синхронизиране на темата",
                syncedwith: "Синхронизирано с",
                themeselect: "Избрана тема",
                copytheme: "Копиране на тема",
                copythemesub: "Изберете типа(овете) известия, към които да се копира избраната тема"
            }
        }
    },
    logwin: {
        content: {
            tagline: "Ето какво се е случило от момента на стартиране на приложението в",
            copylog: "Копиране на съдържанието на регистъра"
        }
    },
    reset: {
        content: {
            sub: `
                <div class="wrapper" id="resetsub">
                    <span>Сигурни ли сте?</span>
                    <span>Всички предишно конфигурирани данни, <u>включително персонализациите</u>, ще бъдат нулирани до стандартни настройки.</span>
                    <span>🛑 Това не може да бъде отменено!</span>
                </div>
            `,
            reset: "Нулиране"
        }
    },
    error: {
        content: {
            subtitle: "Steam Achievement Notifier се е сблъскал с проблем и трябва да бъде затворен.",
            details: "Ето детайлите за грешката:",
            sub: "Натиснете бутоните по-долу, за да докладвате проблема чрез предпочитаната си платформа.",
            report: "Докладване",
            log: "Регистър на приложението",
            exit: "Изход"
        }
    },    
    tooltips: {
        game: "Играта, за която в момента се проследяват постижения",
        usertheme: "Изберете предварително запазена тема",
        customise: "Персонализиране на известията за постижения",
        test: "Показване на тестово известие, включително всички персонализации",
        kofi: "Дарете в Ko-Fi!",
        discord: "Присъединете се към Discord!",
        github: "Докладване на проблем",
        lang: "Изберете езика на потребителския интерфейс, използван в приложението",
        steamlang: `Опит за зареждане на преводи, намиращи се в приложните файлове на Steam, за да се показва информацията за постиженията на избрания от потребителя език в клиента на Steam<br><br><span class="ttdesc">Тази опция се опитва да намери преводи в JSON файл, съхраняван в данните на приложението Steam. Ако не може да бъде намерен превод за текущото постижение, вместо това ще се покаже информацията за постижението, извлечена от Steamworks.</span>`,
        maxsteamlangretries: `Броят опити (на всеки 100ms) за намиране на валидни преводи за текущото постижение<br><br><span class="ttdesc">В момента Steam съхранява само малко количество данни за постиженията в свързания с всяка игра JSON файл. Всички постижения, които не присъстват в този файл, ще бъдат добавени след отключването на постижението.<br><br>Тъй като добавянето на нови данни може да отнеме време, увеличаването на тази стойност ще увеличи вероятността да бъдат намерени данни за превод на текущото постижение, но може също така да забави показването на известието на екрана с времето, изчислено от тази настройка.<br><br>Ако не могат да бъдат намерени валидни данни за превод за текущото постижение, преводите ще се върнат към езика, зададен в Steamworks.</span>`,
        desktop: "Превключване на прекия път до приложението на работния плот, за да го стартирате",
        startwin: "Автоматично стартиране на Steam Achievement Notifier след влизане в системата",
        startmin: "Скриване на прозореца на приложението в системния трей след стартиране, докато не се отвори",
        nohwa: `Изключване на Хардуерно Ускорение, което може да подобри производителността на системи с по-ниски ресурси или системи без посветена GPU<br><br><span class="ttdesc">Приложението ще се рестартира след активиране/деактивиране на тази опция</span>`,
        litemode: "Изключване на всички интерактивни елементи на потребителския интерфейс, като се осигурява само ограничена функционалност на приложението чрез иконата в системния трей. Може да подобри използваните от приложението ресурси",
        rarity: `Процентът, при който ще се показват известията за редки постижения.<br><br>Всяко постижение с процент на отключване над тази стойност ще се показва като основно известие<br><br><span class="ttdesc">Ако е активиран <span class="hl">Режим Трофеи</span>, всяко постижение с процент на отключване над тази стойност ще се показва като сребърно известие вместо това</span>`,
        semirarity: `Процентът, при който ще се показват елементите за известия "Сребро" (напр. <span class="hl">Значки за рядкост</span>, <span class="hl">Украси</span> и т.н.).<br><br>Всяко постижение с процент на отключване под (или равно на) тази стойност и над стойността на <span class="hl">Процент на рядкост</span>, ще показва елементи за известия, конфигурирани за "Сребърни" постижения.<br><br>Всяко постижение с процент на отключване над тази стойност ще показва елементи за известия, конфигурирани за "Бронзови" постижения<br><br><span class="ttdesc">Ако е активиран <span class="hl">Режим Трофеи</span>, всяко постижение с процент на отключване над тази стойност ще се показва като бронзово известие вместо това</span>`,
        showpercent: "Показване на процента на отключване на постижението в известието за избраните типове",
        soundonly: "Изключване на известията, като се възпроизвеждат само звуци, зададени чрез персонализатора",
        extwin: "Създайте прозорец, който дублира всички известия, които в момента се показват на екрана. Този прозорец може след това да бъде добавен като източник на заснемане на прозорец за използване в софтуер за излъчване, като OBS",
        extwinframerate: "Задаване на целева честота на кадрите за известията за излъчване",
        extwinshow: `Превключване на видимостта на прозореца за известия при излъчване<br><br><span class="ttdesc">Когато е фокусиран в лентата на задачите, натиснете и задръжте клавиша <code class="ttcode">Ctrl</code>, за да покажете текущото местоположение на прозореца</span>`,
        audiosrc: "Изберете източник на аудио (или изключете) генериран от приложението",
        nowtracking: "Показване на известие, уведомяващо потребителя, че се проследяват постижения за игра, която се изпълнява",
        nowtrackingscale: `Задайте размера на известието за проследяване`,
        nowtrackingpos: `Задайте позицията на известието за проследяване`,
        shortcuts: "Пускане на тестово известие чрез клавишна комбинация. Клавишните комбинации могат да бъдат персонализирани за всеки тип известия",
        noiconcache: `Изключва кеширането на икони за постижения при стартиране на игрите.<br><br><span class="ttdesc">Това може значително да подобри производителността на приложението при стартиране на игрите и също така може да разреши проблеми с проследяването на игри, които имат голям брой постижения. Въпреки това, в редки случаи, изключването на кеширането на икони може да доведе до липса на икони за постижения в известията</span>`,
        steamss: "Заснемане на Steam снимка, когато се отключи постижение",
        screenshots: "Изберете типа на допълнителните медийни файлове, които да се създават, когато се показва известие",
        monitors: "Мониторът, който ще бъде заснет при правене на снимката",
        hdrmode: `Правене на снимки на екрана с метод, съвместим с монитори, използващи Висок Динамичен Обхват (HDR)`,
        ovpos: "Позицията на прозореца с известието върху снимката",
        ovmatch: "Съответствие на позицията на екрана, зададена в персонализатора, за този тип известия",
        ovpath: "Мястото, където ще бъдат запазени снимките, генерирани от тази опция",
        ssdelay: "Добавяне на забавяне от момента, в който се появява известието, до момента, в който се прави снимката",
        sspreview: "Показване на преглед на начина, по който ще изглежда снимката, когато бъде запазена",
        noanim: "Изключване на всички анимации и ефекти на преходи в прозорците на приложението",
        noupdatedialog: `Предотвратяване на автоматичното показване и фокусиране на диалога <span class="hl">Налична актуализация</span><br><br><span class="ttdesc">Диалогът все още може да бъде достъпен, като щракнете върху бутона за актуализация, когато е наличен</span>`,
        nvda: "Активиране на копирането на информация за постижението в клипборда, когато се отключи постижение, за да може да бъде прочетена от софтуер за четене на екран, като NVDA",
        tooltips: "Показване на подсказки при плъзгане на курсора върху определени елементи на потребителския интерфейс",
        colorprofile: `Принуждава всички прозорци на приложението да се визуализират с избрания цветови профил<br><br><span class="ttdesc">Изисква рестартиране на приложението</span>`,
        pollrate: `Задаване на интервал за обновяване на данни за постижения по време на игра<br><br><span class="ttdesc">Производителността може да нарасне/намалее в зависимост от стойността или хардуерните ресурси на системата. По-високите стойности обикновено водят до по-ниско натоварване на системата, но могат да доведат до по-забавени известия</span>`,
        initdelay: `Задайте забавяне между засичането на текущото <span class="hl">AppID</span> и започването на проследяване на процеси/постижения<br><br><span class="ttdesc">Увеличаването на тази стойност може да предотврати сценарии, при които Steam не може да стартира текущата игра (поради инициализацията на приложението в Steamworks преди стартирането на играта)</span><br><br><span class="ttdesc">Алтернативно, увеличаването на тази стойност също може да се използва за заобикаляне на неправилно засичане на процеси на стартиране преди играта</span>`,
        releasedelay: `Задайте колко дълго фоновият Worker процес изчаква преди да се рестартира, след като текущата игра бъде освободена. Засяга както автоматичното проследяване на процеси, така и Автоматично освобождаване на игри<br><br><span class="ttdesc">Позволява по-дълъг времеви прозорец, за да може Steamworks да бъде напълно освободен от приложението. Увеличаването на тази стойност може да предотврати необичайно поведение, като проследяване на вече затворена игра</span>`,
        maxretries: `Задайте максималния брой опити за свързване на работещ процес с открит AppID. Засяга както автоматичното проследяване на процеси, така и Автоматично освобождаване на игри<br><br><span class="ttdesc">Опитите се извършват веднъж в секунда. Ако работещ процес не бъде свързан с текущия AppID след този брой опити, ще бъде върнат невалиден процес. В такива случаи играта ще трябва да бъде освободена ръчно чрез System Tray > Опции > Освобождаване на играта</span>`,
        debug: "Отворете панела за отстраняване на грешки, който показва подробна информация за проследяване на процесите",
        userust: "Използвайте алтернативна функция, базирана на Rust, за да проверите дали проследяваните игрални процеси в момента се изпълняват на системата. Когато не е отметнато, ще се използва вместо това стандартната проверка на процесите, базирана на NodeJS.",
        notifydebug: "Създаване на прозорец на DevTools за всички известия. Полезно за отстраняване на грешки и проблеми с известията",
        usecustomfiles: "Позволява зареждането на потребителски настраиваеми файлове за известия. Препоръчително е да се използва с внимание от обикновените потребители",
        showcustomfiles: "Отваряне на местоположението на потребителските файлове",
        log: "Отваряне на прозореца с приложението Log, който показва информация за дейността на процеса, предупреждения и грешки",
        reset: "Изтриване на всички конфигурационни данни и рестартиране на приложението",
        playback: "Паузиране/възобновяване на анимацията на прегледа на известието",
        replay: "Рестартиране на анимацията на прегледа на известието",
        preset: "Изберете предварително зададеното известие, което да персонализирате",
        iconanim: "Превключване на границата и анимацията на иконата за редките постижения",
        alldetails: "Показване на всички текстови елементи в известието, включително тези, които по подразбиране са скрити за това предварително зададено известие",
        usepercent: "Показване на процента на отключване на постижението, вместо стойността XP/S",
        displaytime: "Задаване на броя секунди, през които известието ще се показва",
        scale: "Увеличаване или намаляване на размера на известието",
        customtext: "Задаване на персонализирано съобщение, което да се показва в известието",
        usegametitle: "Показване на заглавието на текущата игра в известието",
        customfont: "Зареждане на персонализиран шрифт, който да се използва в известието",
        soundmode: "Изберете единичен аудио файл или случайно избран аудио файл от папка, съдържаща множество аудио файлове, когато се появи известие",
        soundfile: "Изберете аудио файл, който да се възпроизвежда, когато се появи известие",
        sounddir: "Изберете папка, от която да се избира случайно аудио файл, когато се появи известие",
        volume: "Задаване на силата на звука на аудио файла",
        preview: "Преглед на избрания аудио файл или на случайно избран аудио файл от папката",
        bgstyle: "Изберете стила на фона на известието",
        gradientangle: "Задаване на ъгъла на градиента",
        bgimg: "Зареждане на изображение, което да се използва като фон на известието",
        bgachicon: "Използвайте иконата на отключеното постижение като фон на уведомлението",
        bgimgbrightness: "Задайте яркостта на изображението, използвано като фон на известие",
        brightness: "Задаване на яркостта на изображението на играта, използвано като фон на известието",
        blur: "Задайте нивото на замъгляване, приложено към задната част на известията",
        roundness: "Задаване на закръглеността на ръбовете на известието",
        fontsize: "Задаване на размера на шрифта, използван в известието",
        opacity: "Задаване на общата прозрачност на известието",
        bgonly: "Задаване само на прозрачността на фона на известието, като оставят другите елементи с пълна прозрачност",
        glow: "Активиране на ефект на светене, който обгръща известията",
        glowcolor: "Задайте цвета на ефекта на светене",
        glowsize: "Задайте размера на ефекта на светене",
        glowx: "Отместете позицията на ефекта на сияние хоризонтално",
        glowy: "Отместете позицията на ефекта на сияние вертикално",
        glowopacity: "Задайте непрозрачността на ефекта на сияние",
        glowanim: "Изберете предварително зададена анимация, която да се приложи към ефекта на светене",
        glowspeed: "Задайте скоростта на анимацията, приложена към ефекта на светене",
        glowrarity: "Промяна на цвета на ефекта на сиянието според рядкостта на отключеното постижение",
        glowcolorbronze: "Цветът на светене, показван когато процентът на отключване е > $semirarity",
        glowcolorsilver: "Цветът на светене, показван когато процентът на отключване е < $semirarity и > $rarity",
        glowcolorgold: "Цветът на сиянието, когато процентът на отключване е < $rarity",
        mask: "Активиране на замаскиране на части от известията с персонализирано изображение",
        maskimg: `Зареждане на файл с изображение, който да се използва като маска<br><br><span class="ttdesc">В CSS, <code class="ttcode">mask-mode: alpha</code> работи в обратна посока на очакваното - областите с прозрачност във файла с изображение ще бъдат засенчени, а черните/сивите области ще позволят на елементите под тях да бъдат видими</span>`,
        useoutline: "Показване на контур около известието",
        outline: "Изберете типа контур, който да се показва около известието",
        outlinecolor: "Задайте цвета на контура около известието",
        outlinewidth: "Задайте ширината на контура около известието",
        primarycolor: "Задаване на основния цвят на известието",
        secondarycolor: "Задаване на вторичния цвят на известието",
        tertiarycolor: "Задаване на третичния цвят на известието",
        fontcolor: "Задаване на цвета на всички текстове, показвани в известието",
        fontoutline: "Добавяне на контур на всички текстове, показвани в известието",
        fontoutlinecolor: "Задаване на цвета на контура на текста",
        fontoutlinescale: "Задаване на дебелината на контура на текста",
        fontshadow: "Добавяне на сянка на всички текстове, показвани в известието",
        fontshadowcolor: "Задаване на цвета на сянката на текста",
        fontshadowscale: "Задаване на дебелината на сянката на текста",
        fontshadowx: "Изместване на позицията на сянката на текста по хоризонтала",
        fontshadowy: "Изместване на позицията на сянката на текста по вертикала",
        iconroundness: "Задаване на закръглеността на иконата на постижението/играта, показвана в известието",
        plat: "Зареждане на изображение, което да се използва като икона за 100%",
        usegameicon: "Заменете иконата на отключеното постижение с иконата на текущата игра",
        gameicontype: `Изберете какъв тип изображение да се показва като икона на играта`,
        usecustomimgicon: "Заменете иконата на отключеното постижение с персонализиран файл с изображение",
        customimgicon: "Заредете файл с изображение, който да се използва като персонализирана икона",
        showhiddenicon: "Показване на изображение, което показва, че постижението е скрито в известие",
        hiddenicon: "Зареждане на файл с изображение, за да се замени иконата на скрито постижение",
        logo: "Зареждане на изображение, което да замени иконата на логото",
        decoration: "Зареждане на изображение, което да замени иконата за декорация",
        showdecoration: "Превключване на видимостта на иконата за декорация",
        replacelogo: "Заменете иконата на логото в уведомлението с избраната декорация",
        pos: "Задаване на позицията на известието на екрана",
        usecustompos: "Активиране на персонализирано позициониране за известието",
        setcustompos: "Задаване на персонализираната позиция за известието",
        copycustompos: "Приложи персонализираната позиция към всички други типове известия",
        resetcustompos: "Нулиране на позицията на известието до персонализираната позиция по подразбиране",
        updatetheme: "Актуализиране на текущата Тема с избраните опции за персонализация",
        savetheme: "Запазване на всички конфигурирани опции за персонализация като нова тема",
        visibilitybtn: "Превключване на видимостта на елемента в персонализирани прегледи и тестови известия",
        delbtn: "Нулиране на елемента до стойността по подразбиране",
        imgpath: "Местоположението, където ще се запазват изображенията за известия, генерирани от тази опция",
        ssenabled: "Активиране или деактивиране на генерирането на медия за този тип",
        checkforupdates: `Проверете дали нова версия на приложението е издадена в GitHub. Ако има налична актуализация, тя ще бъде автоматично изтеглена и инсталирана, след като бъде потвърдена чрез диалоговия прозорец <span class="hl">Налична актуализация</span>`,
        linkedgames: `Пропускане на <span class="hl">автоматично проследяване на процеса</span> за конкретни игри в Steam<br><br><span class="ttdesc">Тази опция трябва да се използва само за много специфични сценарии. Потребителите не трябва да използват тази опция при нормални обстоятелства!</span>`,
        exclusionlist: `Предотвратяване на проследяването на постижения в конкретни игри в Steam от приложението<br><br><span class="ttdesc">Тази опция трябва да се използва само за много специфични сценарии. Потребителите не трябва да използват тази опция при нормални обстоятелства!</span>`,
        inclusionlist: `Предотвратява проследяването на всички Steam игри от приложението, освен ако не са изрично посочени<br><br><span class="ttdesc">Тази опция трябва да се използва само в много специфични случаи. Потребителите не трябва да имат нужда да използват тази опция при нормални обстоятелства!</span>`,
        ovx: "Отместване на известието, показано на екранната снимка, хоризонтално",
        ovy: "Отместване на известието, показано на екранната снимка, вертикално",
        importtheme: `Импортиране на персонализации чрез <span class="hl">файл с тема</span>, създаден от потребител`,
        exporttheme: `Експортиране на текущо избраната <span class="hl">тема</span> за споделяне<br><br><span class="ttdesc">Преди да опитате да експортирате, моля уверете се, че желаната <span class="hl">тема</span> е избрана (чрез менюто <span class="hl">Избор на тема</span>). Също така уверете се, че персонализациите са запазени в избраната <span class="hl">тема</span> (чрез менюто <span class="hl">Запазване на тема</span>)<br><br><u>Всякакви персонализации, които все още не са запазени в текущата <span class="hl">тема</span>, няма да бъдат експортирани!</u></span>`,
        webhooks: "Използвайте URL на Webhook, за да публикувате в Discord сървър при отключване на постижение",
        webhookmain: `Превключва дали да се изпраща информация за постижението към Discord сървър при отключване на $main постижение`,
        webhooksemi: `Превключва дали да се изпраща информация за постижението към Discord сървър при отключване на $semi постижение`,
        webhookrare: "Превключва дали да се изпраща информация за постижението към Discord сървър при отключване на $rare постижение",
        webhookplat: "Превключва дали да се изпраща информация за постижението към Discord сървър при отключване на $plat постижение",
        webhooktest: "Превключване на това дали да се изпраща тестова информация към Discord сървър при задействане на тестови известия от какъвто и да е тип",
        webhookurl: `Задайте <span class="hl">URL на Webhook</span> за желания Discord сървър<br><br><span class="ttdesc"><span class="hl">URL на Webhook</span> се използва за публикуване в Discord сървър/канал от името на потребител или приложение. За да създадете нов Webhook за Discord сървър, потребителят трябва да има роля в желания сървър, която позволява създаването на Webhooks<br><br><u>URL на Webhook е необходим при използване на тази опция</u><br><br>Вижте официалната документация на Discord за повече информация</span>`,
        webhookspoilers: `Добави етикет за спойлер към "Скрити" постижения при публикуване в Discord`,
        webhookappid: "Показване на AppID на текущата игра в долния колонтитул на вграденото съдържание на webhook",
        unlockmsg: "Задайте позицията на съобщението за отключване/потребителски текст в $type",
        title: "Задайте позицията на заглавието на постижението в $type",
        desc: "Задайте позицията на описанието на постижението в $type",
        notification: "известие",
        screenshot: "екранна снимка",
        percentpos: "Задайте позицията на процента на рядкост в $type",
        sspercentpos: "Задайте позицията на процента на рядкост в $type",
        hiddeniconpos: "Задайте позицията на иконата на скритото/тайното постижение в $type",
        sshiddeniconpos: "Задайте позицията на иконата на скритото/тайното постижение в $type",
        decorationpos: "Задайте позицията на елемента на декорацията в $type",
        ssdecorationpos: "Задайте позицията на елемента на декорацията в $type",
        percentbadge: "Показване на процентното отключване в значка, разположена над иконата на постижението/играта",
        sspercentbadge: "Показване на процентното отключване в значка, разположена над иконата на постижението/играта",
        percentbadgepos: "Задаване на позицията на значката",
        sspercentbadgepos: "Задаване на позицията на значката",
        percentbadgecolor: "Задаване на цвета на фона на значката",
        sspercentbadgecolor: "Задаване на цвета на фона на значката",
        percentbadgefontcolor: "Задайте цвета на шрифта на значката",
        sspercentbadgefontcolor: "Задайте цвета на шрифта на значката",
        percentbadgefontsize: "Задаване на размера на значката",
        sspercentbadgefontsize: "Задаване на размера на значката",
        percentbadgeroundness: "Задаване на закръглеността на значката",
        sspercentbadgeroundness: "Задаване на закръглеността на значката",
        percentbadgex: "Отместване на позицията на елемента за значка по хоризонтала",
        sspercentbadgex: "Отместване на позицията на елемента за значка по хоризонтала",
        percentbadgey: "Отместване на позицията на елемента за значка по вертикала",
        sspercentbadgey: "Отместване на позицията на елемента за значка по вертикала",
        percentbadgeimg: "Показване на икона, базирана на рядкост, като елемент за значка",
        sspercentbadgeimg: "Показване на икона, базирана на рядкост, като елемент за значка",
        percentbadgeimgbronze: "Иконата на значката, показвана когато процентът на отключване е > $semirarity",
        sspercentbadgeimgbronze: "Иконата на значката, показвана когато процентът на отключване е > $semirarity",
        percentbadgeimgsilver: "Иконата на значката, показвана когато процентът на отключване е < $semirarity и > $rarity",
        sspercentbadgeimgsilver: "Иконата на значката, показвана когато процентът на отключване е < $semirarity и > $rarity",
        percentbadgeimggold: "Иконата за значка, която се показва, когато процентът на отключване е < $rarity",
        sspercentbadgeimggold: "Иконата за значка, която се показва, когато процентът на отключване е < $rarity",
        percentbadgeimgplat: "Иконата на значката, показвана когато всички постижения са отключени",
        sspercentbadgeimgplat: "Иконата на значката, показвана когато всички постижения са отключени",
        resetpbimgs: "Възстановяване на всички икони за значки по подразбиране",
        elemsmatch: `Съответствие с настройките за елементи на известията, зададени в персонализатора за този тип известие<br><br><span class="ttdesc">Някои предварителни настройки за известия не могат напълно да съвпаднат с настройките на персонализатора, поради разлики между известията на екрана и тези, базирани на снимки на екрана</span>`,
        themeswitch: `Автоматично превключване към всеки запазен <span class="hl">Тема</span> при откриване на определена игра`,
        userthemesync: `Синхронизиране на персонализациите в избраната <span class="hl">Тема</span> с всички други типове известия`,
        showsystrayopts: `Показване на всички опции, които обикновено се намират под <span class="hl">Системна лента</span> > <span class="hl">Опции</span> в <span class="hl">Настройки</span> > <span class="hl">Други</span>`,
        releaseshortcut: "Освобождаване на текущо проследяваната игра с помощта на зададената клавишна комбинация",
        themeselect: "Изберете предварително запазена Тема",
        statwin: `Показване на конфигурируема статистика за постиженията на текущата игра във външен прозорец<br><br><span class="ttdesc">Когато се използва заедно с опцията <span class="hl">Превод на постиженията на езика на Steam</span>, някои преводи може да не са налични, докато съответното постижение не бъде отключено</span>`,
        statwinaot: `Задайте прозореца за статистики на постижения в режим "Винаги отгоре", което позволява прозорецът да се показва над прозореца на играта<br><br><span class="ttdesc">Когато е активирано, прозорецът за статистики на постижения няма да регистрира потребителски взаимодействия, като например събития за "кликване". За да се активира отново взаимодействието с прозореца, тази опция трябва да бъде деактивирана</span>`,
        statwinshortcut: "Превключване на наслагването на статистиките за постижения с посочения клавишен пряк път",
        ssdisplay: "Показване на предварителен преглед на заснетия екран в известието",
        iconscale: "Увеличаване или намаляване на размера на иконата на постижението",
        showiconborder: "Показване на изображение като граница около иконата на постижението",
        iconborderimg: "Зареждане на файл с изображение за използване като граница около иконата на постижението",
        iconborderpos: "Определяне дали границата на иконата да се показва пред или зад иконата на постижението",
        iconborderscale: "Увеличаване или намаляване на размера на границата на иконата в известието",
        iconborderx: "Увеличаване или намаляване на хоризонталното изместване на границата на иконата в известието",
        iconbordery: "Увеличаване или намаляване на вертикалното изместване на границата на иконата в известието",
        iconborderrarity: "Променя рамката на иконата според рядкостта на отключеното постижение",
        iconborderimgbronze: "Рамката на иконата, показвана когато процентът на отключване е > $semirarity",
        iconborderimgsilver: "Рамката на иконата, показвана когато процентът на отключване е < $semirarity и > $rarity",
        iconshadowcolor: "Задаване на цвета на сянката около иконата на постижението при отключване на рядко постижение",
        iconanimcolor: "Задаване на цвета на анимационния ефект зад иконата на постижението при отключване на рядко постижение",
        logoscale: "Увеличаване или намаляване на размера на логото в известието",
        decorationscale: "Увеличаване или намаляване на размера на декоративния елемент в известието",
        usecustomfontsizes: `Индивидуално увеличаване или намаляване на размера на текстовите елементи в известието<br><br><span class="ttdesc">Запазването на оригиналното оформление на известието не може да бъде гарантирано при промяна на отделни стойности за размер на шрифта</span>`,
        unlockmsgfontsize: "Увеличаване или намаляване на размера на текстовия елемент за съобщението за отключване",
        titlefontsize: "Увеличаване или намаляване на размера на текстовия елемент за заглавието на постижението",
        descfontsize: "Увеличаване или намаляване на размера на текстовия елемент за описанието на постижението",
        webhookembedcolormain: "Задайте цвета, използван в вграденото съобщение на webhook при отключване на $main постижение",
        webhookembedcolorsemi: "Задайте цвета, използван в вграденото съобщение на webhook при отключване на $semi постижение",
        webhookembedcolorrare: "Задайте цвета, използван в вграденото съобщение на webhook при отключване на $rare постижение",
        webhookembedcolorplat: "Задайте цвета, използван в вграденото съобщение на webhook при отключване на $plat постижение",
        raemus: "Показване на известия при разпознаване на игри в поддържаните емулатори",
        rauser: "Задайте потребителско име за Retro Achievements, за да проследявате постиженията",
        rakey: `Задайте Web API ключа за удостоверяване към Retro Achievements API<br><br><span class="ttdesc">Web API ключ може да бъде копиран или генериран отново, като влезете в уебсайта на Retro Achievements и навигирате до <span class="hl">Настройки > Ключове > Web API ключ</span><br><br>🔒 Предоставеният ключ ще бъде криптиран преди да се съхрани локално на системата (ако текущата операционна система поддържа криптиране)</span>`,
        rapercenttype: "Задайте дали да се показва процентът на отключените хардкор или софткор постижения в известията",
        retroarch: `Показване на известия за Retro Achievements за игри, емулирани чрез RetroArch<br><br><span class="ttdesc"><span class="hl">RetroArch > Настройки > Регистрация</span> трябва да бъде конфигуриран със следните настройки:<br><br><ul><li><span class="hllb">Подробност на дневника</span>: <span class="hlgreen">ВКЛЮЧЕНО</span></li><li><span class="hllb">Ниво на регистрация на интерфейса</span>: <span class="hlgreen">1 (Информация)</span></li><li><span class="hllb">Запис в файл</span>: <span class="hlgreen">ВКЛЮЧЕНО</span></li><li><span class="hllb">Отбелязване с времеви печат</span>: <span class="hlred">ИЗКЛЮЧЕНО</span></li></ul></span>`,
        dolphin: `Показване на известия за Retro Achievements за игри, емулирани чрез Dolphin<br><br><span class="ttdesc"><span class="hl">Dolphin > Изглед > Показване на конфигурация на дневника</span> трябва да бъде конфигуриран със следните настройки:<br><br><ul><li><span class="hllb">Подробност</span>: <span class="hlgreen">Информация</span></li><li><span class="hllb">Изходи на дневника</span> > <span class="hlgreen">Запис в файл</span></li><li><span class="hllb">Типове дневници</span> > <span class="hlgreen">Постижения (RetroAchievements)</span></li></ul></span>`,
        pcsx2: `Показване на известия за Retro Achievements за игри, емулирани чрез PCSX2<br><br><span class="ttdesc"><span class="hl">PCSX2 > Инструменти > Активиране на регистриране във файл</span> трябва да бъде активирано</span>`,
        duckstation: `Показване на известия от Retro Achievements за игри, емулирани чрез Duckstation<br><br><span class="ttdesc">❗ Файлът <span class="dialogcode" style="background-color: var(--mediumgrey);">RA_Integration-x64.dll</span> трябва да бъде изтеглен и преместен в <span class="hl">директорията за инсталация на Duckstation</span></span><br><br><span class="ttdesc"><span class="hl">Duckstation > Настройки > Постижения > RAIntegration (Само за разработчици)</span> трябва да бъде активирано</span>`,
        ppsspp: `Показвай известия от Retro Achievements за игри, емулирани чрез PPSSPP<br><br><span class="ttdesc"><span class="hl">Settings > Tools > Developer Tools > General > Log to File</span> трябва да бъде активирано и конфигурирано със следните настройки:<br><br><ul><li><span class="hllb">Achievements</span>: <span class="hlgreen">Info</span></span>`,
        retroarchpath: `Задайте пътя до лог файла на RetroArch <span class="hl">"retroarch.log"</span> <br><br><span class="ttdesc">При стандартни настройки на инсталацията <span class="hl">"retroarch.log"</span> се съхранява в <span class="hllb">%SYSTEMDRIVE%\\RetroArch-Win64\\Logs</span></span>`,
        dolphinpath: `Задайте пътя до лог файла на Dolphin <span class="hl">"dolphin.log"</span><br><br><span class="ttdesc">При стандартни настройки на инсталацията <span class="hl">"dolphin.log"</span> се съхранява на едно от следните места:<br><br><ul><li><span class="hllb">%APPDATA%\\Dolphin Emulator\\Logs</span></li><li><span class="hllb">%USERPROFILE%\\Documents\\Dolphin Emulator\\Logs</span></li><li>🐧 <span class="hllb">$XDG_DATA_HOME/dolphin-emu/Logs</span></li></ul></span>`,
        pcsx2path: `Задайте пътя до лог файла на PCSX2 <span class="hl">"emulog.txt"</span><br><br><span class="ttdesc">При използване на стандартни настройки за инсталация, <span class="hl">"emulog.txt"</span> се съхранява в <span class="hllb">%USERPROFILE%\\Documents\\PCSX2\\Logs</span></span>`,
        duckstationpath: `Задайте пътя до лог файла <span class="hl">"RALog.txt"</span> на Duckstation<br><br><span class="ttdesc">При стандартни настройки на инсталацията, <span class="hl">"RALog.txt"</span> се съхранява в <span class="hllb">%USERPROFILE%\\Downloads\\duckstation-windows-x64-release\\RACache</span></span>`,
        ppsspppath: `Задайте пътя до лог файла <span class="hl">"log.txt"</span> на PPSSPP<br><br><span class="ttdesc">При използване на стандартните настройки за инсталация, <span class="hl">"log.txt"</span> се съхранява в <span class="hllb">%PROGRAMFILES%\\PPSSPP\\PSP\\memstick\\PSP\\SYSTEM\\DUMP</span></span>`,
        usecustomfontcolors: "Задаване на индивидуални цветове за текстовите елементи в известието",
        unlockmsgfontcolor: "Задаване на цвят за първия текстов елемент",
        titlefontcolor: "Задаване на цвят за втория текстов елемент",
        descfontcolor: "Задаване на цвят за третия текстов елемент",
        exportachdata: `Експортиране на данните за постижения в JSON файл при отключване на постижение<br><br><span class="ttdesc">Ако е активирано, <span class="ttcode">achdata.json</span> ще бъде експортиран в:<br><br><ul><li><span class="hllb">%localappdata%\\Steam Achievement Notifier (V1.9)</span></li><li>🐧 <span class="hllb">~/.local/share/Steam Achievement Notifier (V1.9)</span></li></ul></span>`,
        textvspace: "Регулира вертикалното разстояние между текстовите елементи в известието",
        ssmode: `Задайте дали екранните снимки да улавят целия екран или текущия прозорец на играта<span style="color: red;">*</span><br><br><span class="ttdesc">Ако <span class="hl">изпълнимият файл</span> на текущата игра не може да бъде открит (<i>независимо дали чрез <span class="hl">автоматично проследяване на процеси</span> или когато е добавена като запис в <span class="hl">Автоматично освобождаване на игри</span></i>), тази опция по подразбиране ще бъде зададена на режим „Екран“</span>`,
        replaynotify: "Повтори последното известие за постижение",
        replaynotifyshortcut: "Повтори последното известие за постижение чрез зададения клавишен пряк път",
        replaynotifyempty: `<br><br><span class="ttdesc">Опашката за повторение е празна. Отключете постижение, за да повторите известието</span>`,
        customtrigger: "Задейства клавиш/комбинация при отключване на постижение. Може да се използва за задействане на бързи клавиши, регистрирани във външни приложения",
        customtriggershortcut: `Задейства посочения клавиш/комбинация при отключване на постижение<br><br><span class="ttdesc">Поддържа между 1-3 клавиша на бърз клавиш. За натискания/комбинации с по-малко от 3 клавиша, натиснете желаните клавиши и изчакайте таймера (5 сек.) да изтече</span>`,
        customtriggerdelay: "Закъснение за посочения персонализиран клавиш/комбинация",
        customtriggerusedisplaytime: `Закъснение за посочения персонализиран клавиш/комбинация според стойността на Време за Показване за текущия тип известие`,
        trophymode: "Заменя основните/редки/100% типове известия с Бронзови/Сребърни/Златни/Платинени",
        lognum: `Броят на предишните лог файлове, съхранявани преди изтриване. Нов лог файл ще се създава при всяко стартиране на приложението<br><br><span class="ttdesc">Когато е зададено на 0, всички предишни лог файлове ще бъдат изтрити при изход</span>`, 
        detectedappid: `Използвай <span class="hl">AppID</span> на текущо откритата игра`,
        listmode: `Задава поведението на <span class="hl">Изключване</span>/<span class="hl">Списък за включване</span><br><br><span class="ttdesc">• <span class="hl">Изключване</span>: Игнорира само игрите, посочени в списъка<br>• <span class="hl">Включване</span>: Игнорира всички игри, освен тези, посочени в списъка</span>`,
        notifymax: `Задава максималния брой известия, които могат да се показват едновременно на екрана<br><br><span class="ttdesc">Увеличаването на броя едновременни известия изисква повече ресурси и може да доведе до по-ниска производителност</span>`,
        notifyspace: "Задава разстоянието между едновременно показваните известия на екрана",
        audiocooldown: `Задава времето, което следващите известия изчакват, преди да може да се възпроизведе нов звук<br><br><span class="ttdesc">Аудиото няма да бъде засегнато, ако Максимален брой известия е настроен на 1</span>`,
        rauseemudir: "Запазване на екранни снимки/изображения на известия, отключени чрез RetroAchievements, в поддиректория за текущия емулатор в рамките на зададената директория за екранни снимки/изображения",
        ssext: "Задаване на файловия формат на екранните снимки, генерирани чрез опцията за екранна снимка с наслагване на известия",
        notify1line: `Ограничаване на броя редове текст, показвани във всички известия, до 1<br><br><span class="ttdesc">Препълващите текстови низове, които не могат да се поберат в един ред, ще бъдат съкратени с "..."</span>`,
        copytheme: "Копиране на избраната тема към друг тип известие",
        ssaddtosteam: "Автоматично добавяне на генерираните медии към записите и екранните снимки на текущата игра в Steam",
        appdatadir: "Отвори местоположението на папката AppData на приложението",
        backup: "Архивирайте съдържанието на папката AppData на приложението на избрано място, което ще служи като точка за възстановяване на текущото състояние на приложението",
        restore: "Възстановете съдържанието на папката AppData на приложението от предишен архив",
        gametimerwin: "Показва таймер на екрана, показващ времето, необходимо за отключване на всички постижения за текущата игра",
        gametimerwinshortcut: "Превключва таймера за завършване на играта чрез зададената клавишна комбинация",
        gametimerwinaot: `Задава таймера за завършване на играта в режим "Винаги отгоре", позволявайки прозорецът да се показва над прозореца на играта<br><br><span class="ttdesc">Когато е активирано, таймерът за завършване на играта повече няма да регистрира потребителски взаимодействия, като събития от "клик". За да се активира отново взаимодействието с прозореца, тази опция трябва да бъде деактивирана</span>`,
        resetgametimer: "Нулира таймера за завършване на играта за текущата игра",
        noshortcuts: `Деактивира всички клавишни комбинации в приложението<br><br><span class="ttdesc">Когато е активирано, <u>всички клавишни комбинации в приложението повече няма да работят</u>. Всички опции, свързани с клавишните комбинации, също ще бъдат скрити</span>`,
        extwinnotify: "Превключва видимостта на всички известия на екрана при използване на Stream Notifications",
        usesanwatcher: `Активиране на новия наблюдател на игрови процеси на SAN<br><br><span class="ttdesc">Разликите между новия SANWatcher и старите методи за автоматично проследяване на процеси са следните:<br><br><div class="wrapper sanwatcher"><span class="hl">ВКЛ.</span><ul><li>Активно следи събитията за стартиране/прекратяване на всеки процес, съхраняван в директорията за инсталация на играта</li><li>Не е необходимо да е известен изпълнимият файл на играта, за да бъде освободена текущата игра</li><li>Поведението на стартовите програми преди играта може да варира, така че пълна съвместимост с всички Steam игри не е гарантирана</li></ul></div><br><div class="wrapper sanwatcher"><span class="hl" style="color: firebrick;">ИЗКЛ.</span><ul><li>Сканира директорията за инсталация на играта за работещи изпълними файлове след стартиране на играта</li><li>Необходимо е да е известен изпълнимият файл на играта, за да бъде освободена текущата игра</li><li>Ако процесът на играта не може да бъде определен автоматично, потребителят трябва ръчно да добави нов запис в <span class="hl">Автоматично освобождаване на игри</span>, за да могат игрите да бъдат освобождавани автоматично</li></ul></div>`,
        releasewaittime: `Задайте колко дълго SANWatcher ще изчаква появата на нови игрови процеси, преди да освободи текущата игра<br><br><span class="ttdesc">Например, ако текущата игра стартира прозорец за стартиране/конфигуриране преди действителната игра, тази настройка определя броя секунди, които SANWatcher ще изчака за появата на действителния игрови прозорец след затварянето на прозореца за стартиране/конфигуриране<br><br>Ако в рамките на това време за изчакване бъде открит нов активен игрови процес, освобождаването ще бъде отменено и вместо това ще бъде проследяван новият активен процес<br><br>💡 Името на играта ще <span style="animation: release calc(var(--transition) * 2.5) linear alternate infinite;">мига</span> в полето <span class="hl">Показване на играта</span>, докато текущата игра изчаква освобождаване</span>`
    },
    update: {
        updateavailable: "Налична е актуализация",
        sub: [
            `<span id="newversion"></span>`,
            "Налична е нова актуализация на Steam Achievement Notifier!",
            `Пълният списък с промени е достъпен на <span id="discordreleasenotes"></span> и <span id="githubreleasenotes"></span>`
        ],
        update: "Актуализиране"
    },
    linkgame: {
        content: {
            exepath: "Път на изпълнимия файл",
            managesub: [
                `Ако Steam все още показва игра като <i>В игра</i> след затваряне на прозореца на играта, опитайте да добавите нов запис към <span class="hl">Автоматично освобождаване на игри</span>`,
                `Добавете <span class="hl">AppID</span> на конкретна игра заедно с очаквания <span class="hl">изпълним файл на играта</span>, или <span class="hl">премахнете</span> съществуващ запис`,
                `Нови записи могат също да бъдат добавяни чрез <i>щракване с десния бутон</i> върху <span class="hl">иконата в System Tray</span> > <span class="hl">Автоматично освобождаване на игра</span>, след като игра бъде открита`,
                `<span class="hl help" id="appidhelp"><u>Как да намеря AppID на игра в Steam?</u></span>`
            ],
            linknew: "Нов запис",
            linknewsub: [
                `Добавете <span class="hl">AppID</span> на нова игра заедно с очаквания <span class="hl">изпълним файл на играта</span>`,
                `След добавянето записите могат да бъдат <span class="hl">премахнати</span> чрез предишното меню <span class="hl">Автоматично освобождаване на игри</span>`
            ],
            linkedit: "Редактиране на запис",
            linkeditsub: [
                `Редактирайте <span class="hl">AppID</span> на съществуваща игра заедно с очаквания <span class="hl">изпълним файл на играта</span>`,
                `След добавянето записите могат да бъдат <span class="hl">премахнати</span> чрез предишното меню <span class="hl">Автоматично освобождаване на игри</span>`
            ],
            link: "Добавяне"
        }
    },
    exclusions: {
        content: {
            managesub: [
                `Добавяне на <span class="hl">AppID</span> на всяка игра в Steam към <span class="hl">Списък за изключване</span>`,
                `Steam Achievement Notifier няма да се опитва да проследява данни за постижения за всяка игра с добавен <span class="hl">AppID</span> към <span class="hl">Списък за изключване</span>`,
                `<span class="hl" id="appidhelp"><u>Как да намеря AppID на игра в Steam?</u></span>`
            ],
            exclusionnew: "Ново изключване",
            exclusionnewsub: [
                `Въведете <span class="hl">AppID</span>, за да го добавите към <span class="hl">Списък за изключване</span>`
            ],
            exclusionedit: "Редактиране на изключение",
            exclusioneditsub: [
                `Редактиране на съществуващия <span class="hl">AppID</span> в <span class="hl">Списъка с изключения</span>`
            ]
        }
    },
    inclusions: {
        content: {
            managesub: [
                `Добавете <span class="hl">AppID</span> на която и да е Steam игра към <span class="hl">Списъка за включване</span>`,
                `Steam Achievement Notifier ще се опита да проследява данни за постижения само за игрите, чиито <span class="hl">AppID</span> са добавени към <span class="hl">Списъка за включване</span>`,
                `<span class="hl help" id="appidhelp"><u>Как да намеря AppID на Steam игра?</u></span>`
            ],
            inclusionnew: "Ново включване",
            inclusionnewsub: [
                `Въведете <span class="hl">AppID</span>, за да го добавите към <span class="hl">Списъка за включване</span>`
            ],
            inclusionedit: "Редактиране на включване",
            inclusioneditsub: [
                `Редактирайте съществуващия <span class="hl">AppID</span> в <span class="hl">Списъка за включване</span>`
            ]
        }
    },
    notificationelems: {
        title: "Елементи на известието",
        content: {
            unlockmsg: "Съобщение за отключване",
            title: "Заглавие на постижението",
            desc: "Описание на постижението",
            hiddeniconpos: "Скрит икон",
            sshiddeniconpos: "Скрит икон",
            decorationpos: "Декорация",
            ssdecorationpos: "Декорация",
            percentpos: "Процент на рядкост",
            sspercentpos: "Процент на рядкост",
            percentbadge: "Значка за процент",
            sspercentbadge: "Значка за процент",
            percentbadgepos: "Позиция на значката",
            sspercentbadgepos: "Позиция на значката",
            percentbadgecolor: "Цвят на значката",
            sspercentbadgecolor: "Цвят на значката",
            percentbadgefontcolor: "Цвят на шрифта на значката",
            sspercentbadgefontcolor: "Цвят на шрифта на значката",
            percentbadgefontsize: "Размер на значката",
            sspercentbadgefontsize: "Размер на значката",
            percentbadgeroundness: "Закръгленост на значката",
            sspercentbadgeroundness: "Закръгленост на значката",
            percentbadgex: "Хоризонтално отместване",
            sspercentbadgex: "Хоризонтално отместване",
            percentbadgey: "Вертикално отместване",
            sspercentbadgey: "Вертикално отместване",
            percentbadgeimg: "Използване на икона",
            sspercentbadgeimg: "Използване на икона",
            percentbadgeimgbronze: "Редкост: > $semirarity",
            sspercentbadgeimgbronze: "Редкост: > $semirarity",
            percentbadgeimgsilver: "Редкост: < $semirarity & > $rarity",
            sspercentbadgeimgsilver: "Редкост: < $semirarity & > $rarity",
            percentbadgeimggold: "Редкост: < $rarity",
            sspercentbadgeimggold: "Редкост: < $rarity",
            resetpbimgs: "Възстановяване на иконите за значки",
            elemsmatch: "Съответствие с настройките на персонализатора",
            ssdisplay: "Визуализация на екрана"
        }
    },
    themeswitch: {
        content: {
            managesub: [
                `Добавете <span class="hl">AppID</span> на която и да е игра, за да превключите автоматично на <span class="hl">Теми</span>, когато бъде открита`,
                `Всяка запазена <span class="hl">Тема</span> може да бъде избрана за всеки тип известие, заедно с желания монитор за използване като <span class="hl">Източник на екранна снимка</span>`,
                `<span class="hl" id="appidhelp"><u>Как да намеря AppID на игра в Steam?</u></span>`
            ],
            themeswitchnew: "Нова автоматична смяна",
            themeswitchnewsub: [
                `Въведете <span class="hl">AppID</span> на играта, заедно с желания монитор за използване като <span class="hl">Източник на екранна снимка</span>`,
                `Изберете коя <span class="hl">Тема</span> да се превключи за всеки тип известие, когато бъде открит <span class="hl">AppID</span> на тази игра`
            ],
            themeswitchedit: "Редактиране на автоматично превключване",
            themeswitcheditsub: [
                `Редактирайте желания монитор, който да се използва като <span class="hl">източник на екранни снимки</span> за <span class="hl">AppID</span> на тази игра`,
                `Променете кой <span class="hl">тема</span> да се използва за всеки тип известие, когато бъде открит <span class="hl">AppID</span> на тази игра`
            ],
            themes: "Теми",
            src: "Източник на екранна снимка",
            themedeleted: "Тема изтрита"
        }
    }
}

export const missingdepssub = (opt: string,dep: string) => [
    `Изглежда се опитвате да активирате опцията <span class="hl">${opt}</span>, но тази опция не може да бъде активирана без първо да се инсталира пакетът <code class="dialogcode">${dep}</code>`,
    `Моля, изпълнете <code class="dialogcode" style="user-select: text;">sudo apt-get install ${dep}</code>, за да инсталирате тази зависимост`
]