export const translations = {
    global: {
        main: "Κύριο",
        rare: "Σπάνιο",
        plat: "100%",
        topleft: "Πάνω αριστερά",
        topcenter: "Πάνω κέντρο",
        topright: "Πάνω δεξιά",
        bottomleft: "Κάτω αριστερά",
        bottomcenter: "Κάτω κέντρο",
        bottomright: "Κάτω δεξιά",
        ok: "Εντάξει",
        preview: "Προεπισκόπηση",
        save: "Αποθήκευση",
        back: "Πίσω",
        settings: "Ρυθμίσεις",
        appversion: "Έκδοση εφαρμογής",
        image: "Εικόνα",
        audio: "Ήχος",
        folder: "Φάκελος",
        font: "Γραμματοσειρά",
        select: "Επιλογή",
        gametitle: "Τίτλος παιχνιδιού",
        congrats: "Συγχαρητήρια!",
        achievementunlocked: "Κατάκτηση ξεκλείδωτη",
        gamecomplete: "Ολοκλήρωση 100%",
        achievementdesc: "Κάνατε κλικ στο κουμπί Εμφάνιση δοκιμαστικής ειδοποίησης",
        gamecompletedesc: "Ξεκλειδώσατε όλες τις επιτεύξεις!",
        defaultcustomfont: "Προεπιλογή (Δεν έχει επιλεγεί γραμματοσειρά)",
        defaultsoundfile: "Προεπιλογή (Δεν έχει επιλεγεί αρχείο ήχου)",
        defaultsounddir: "Προεπιλογή (Δεν έχει επιλεγεί φάκελος)",
        nowtracking: "Παρακολούθηση επιτευγμάτων για:",
        nopreview: "Η προεπισκόπηση δεν είναι διαθέσιμη για το φυσικό λειτουργικό σύστημα",
        options: "Επιλογές",
        resetwindow: "Επαναφορά παραθύρου",
        show: "Εμφάνιση",
        exit: "Έξοδος",
        releasegame: "Απελευθέρωση Παιχνιδιού",
        releasegamesub: [
            `Επανεκκινήστε τη διαδικασία Worker στο παρασκήνιο και απελευθερώστε το τρέχον παιχνίδι από την παρακολούθηση`,
            `Δοκιμάστε αυτήν την επιλογή αν έχετε κλείσει πρόσφατα ένα παιχνίδι αλλά το Steam συνεχίζει να το εμφανίζει ως ενεργό, ή αν το Steam Achievement Notifier συνεχίζει να εμφανίζει ως παρακολούθηση ενός παιχνιδιού που έχει ήδη κλείσει`
        ],
        noupdateavailable: "Δεν υπάρχει διαθέσιμη ενημέρωση",
        latestversion: "Εγκατεστημένη η τελευταία έκδοση",
        missingdeps: "Λείπουσα εξάρτηση",
        missingdepssub: [
            `Φαίνεται ότι προσπαθείτε να ενεργοποιήσετε την επιλογή <span class="hl">Λήψης στιγμιοτύπου στο Steam</span>. Ωστόσο, στο Linux, οι στιγμιότυποι οθόνης δεν μπορούν να εκκινηθούν αυτόματα χωρίς πρώτα να εγκατασταθεί το πακέτο <code class="dialogcode">xdotool</code>`,
            `Παρακαλώ εκτελέστε την εντολή <code class="dialogcode" style="user-select: text;">sudo apt-get install xdotool</code> για να εγκαταστήσετε αυτήν την εξάρτηση, η οποία θα εξασφαλίσει ότι μπορούν να γίνουν λήψεις οθόνης στο Steam σε αυτή τη συσκευή`
        ],
        restartapp: "Επανεκκίνηση Εφαρμογής",
        restartappsub: [
            `Αν τα πράγματα δεν λειτουργούν σωστά, χρησιμοποιήστε αυτήν την επιλογή για να κλείσετε και να ξανανοίξετε την εφαρμογή`,
            `Αν το πρόβλημα εξακολουθεί να υπάρχει αφότου επανεκκινήσετε την εφαρμογή, παρακαλούμε να σκεφτείτε να το αναφέρετε χρησιμοποιώντας τους ενσωματωμένους συνδέσμους στην αρχική οθόνη`
        ]
    },
    app: {
        content: {
            game: "Δεν ανιχνεύθηκε παιχνίδι",
            customise: "Προσαρμογή",
            test: "Εμφάνιση δοκιμαστικής ειδοποίησης"
        }
    },
    settings: {
        language: {
            title: "Γλώσσα"
        },
        os: {
            title: "Λειτουργικό σύστημα",
            content: {
                desktop: "Δημιουργία συντόμευσης επιφάνειας εργασίας",
                startwin: "Έναρξη κατά την σύνδεση",
                startmin: "Έναρξη με ελαχιστοποίηση",
                nohwa: "Απενεργοποίηση επιτάχυνσης υλικού",
                litemode: "Λειτουργία ελαφράς έκδοσης"
            }
        },
        notifications: {
            title: "Ειδοποιήσεις",
            content: {
                rarity: "Ποσοστό σπανιότητας",
                rareonly: "Μόνο σπάνια",
                all: "Όλα",
                off: "Απενεργοποίηση",
                showpercent: "Εμφάνιση ποσοστού",
                soundonly: "Μόνο ήχος",
                extwin: "Ειδοποιήσεις ροής",
                audiosrc: "Πηγή ήχου",
                notify: "Ειδοποίηση",
                app: "Εφαρμογή",
                nowtracking: "Εμφάνιση Ειδοποίησης Παρακολούθησης",
                nowtrackingscale: "Κλίμακα Παρακολούθησης",
                shortcuts: "Συντομεύσεις ειδοποιήσεων"
            }
        },
        media: {
            title: "Πολυμέσα",
            content: {
                steamss: "Λήψη στιγμιότυπου Steam",
                screenshots: "Πρόσθετα μέσα",
                off: "Απενεργοποίηση",
                overlay: "Στιγμιότυπο με επικάλυψη ειδοποιήσεων",
                monitors: "Πηγή στιγμιοτύπου",
                ovpos: "Θέση επικάλυψης",
                ovmatch: "Αντιστοίχιση θέσης προσαρμογής",
                ovpath: "Διαδρομή στιγμιότυπου",
                ssdelay: "Καθυστέρηση στιγμιοτύπου",
                notifyimg: "Εικόνα ειδοποίησης",
                imgpath: "Διαδρομή εικόνας"
            }
        },
        accessibility: {
            title: "Προσβασιμότητα",
            content: {
                noanim: "Απενεργοποίηση κινήσεων παραθύρου εφαρμογής",
                nvda: "Ενεργοποίηση υποστήριξης NVDA",
                tooltips: "Εμφάνιση εργαλειοθηκών"
            }
        },
        advanced: {
            title: "Προχωρημένες ρυθμίσεις",
            content: {
                pollrate: "Ρυθμός δημοσκόπησης",
                releasedelay: "Καθυστέρηση Κυκλοφορίας",
                maxretries: "Μέγιστος αριθμός επαναλαμβανόμενων προσπαθειών",
                notifydebug: "Εμφάνιση ειδοποιήσεων αποσφαλμάτωσης",
                usecustomfiles: "Χρήση προσαρμοσμένων αρχείων εφαρμογής",
                showcustomfiles: "Εμφάνιση προσαρμοσμένων αρχείων εφαρμογής"
            }
        },        
        misc: {
            title: "Διάφορα",
            content: {
                checkforupdates: "Έλεγχος για ενημερώσεις",
                log: "Καταγραφή Εφαρμογής",
                reset: "Επαναφορά εφαρμογής"
            }
        }
    },
    customiser: {
        preset: {
            title: "Προεπιλογή",
            content: {
                preset: "Προεπιλεγμένη Ειδοποίηση",
                iconanim: "Σπάνια Κινούμενη Εικόνα",
                alldetails: "Εμφάνιση Όλων των Λεπτομερειών",
                usepercent: "Χρήση Ποσοστού",
                displaytime: "Χρόνος Εμφάνισης",
                scale: "Κλίμακα",
                customtext: "Προσαρμοσμένο Κείμενο",
                usegametitle: "Χρήση Τίτλου Παιχνιδιού",
                customfont: "Προσαρμοσμένη Γραμματοσειρά"
            }
        },
        sound: {
            title: "Ήχος",
            content: {
                soundmode: "Λειτουργία Ήχου",
                file: "Αρχείο",
                folder: "Τυχαίο",
                soundfile: "Αρχείο Ήχου",
                sounddir: "Φάκελος Ήχου",
                volume: "Ένταση"
            }
        },
        style: {
            title: "Στυλ",
            content: {
                bgstyle: "Στυλ Φόντου",
                solid: "Συμπαγές",
                gradient: "Διακύμανση",
                img: "Εικόνα",
                gameart: "Καλλιτεχνική Επιτυχία",
                gradientangle: "Γωνία Διακύμανσης",
                bgimg: "Εικόνα Φόντου",
                bgimgbrightness: "Φωτεινότητα",
                brightness: "Φωτεινότητα",
                roundness: "Γύρω Περιοχή",
                fontsize: "Μέγεθος Γραμματοσειράς",
                opacity: "Διαφάνεια",
                bgonly: "Μόνο Φόντο"
            }
        },
        colors: {
            title: "Χρώματα",
            content: {
                primarycolor: "Κύριο Χρώμα",
                secondarycolor: "Δευτερεύον Χρώμα",
                tertiarycolor: "Τριτεύον Χρώμα",
                fontcolor: "Χρώμα Γραμματοσειράς",
                fontoutline: "Περίγραμμα Γραμματοσειράς",
                fontoutlinecolor: "Χρώμα Περιγράμματος Γραμματοσειράς",
                fontshadow: "Σκιά Γραμματοσειράς",
                fontshadowcolor: "Χρώμα Σκιάς Γραμματοσειράς"
            }
        },
        icons: {
            title: "Εικονίδια",
            content: {
                iconroundness: "Γύρω Περιοχή Εικονιδίου",
                plat: "Λογότυπο 100%",
                usegameicon: "Χρήση Εικονιδίου Παιχνιδιού",
                logo: "Λογότυπο",
                decoration: "Διακόσμηση",
                showdecoration: "Εμφάνιση Διακόσμησης",
                rarity: "Σπανιότητα",
                showhiddenicon: "Εμφάνιση Κρυφού Εικονιδίου",
                hiddenicon: "Κρυφό Εικονίδιο",
            }
        },
        position: {
            title: "Θέση",
            content: {
                pos: "Θέση Οθόνης",
                usecustompos: "Χρήση Προσαρμοσμένης Θέσης",
                setcustompos: "Ορισμός",
                resetcustompos: "Επαναφορά"
            }
        },
        theme: {
            title: "Θέμα",
            content: {
                savetheme: "Αποθήκευση Θέματος",
                sub: [
                    `Τα αποθηκευμένα <span class="hl">Θέματα Χρήστη</span> μπορούν να επιλεγούν από το μενού <span class="hl">Επιλογή Θέματος</span> στην Αρχική οθόνη.`,
                    `Βεβαιωθείτε ότι το <span class="hl">Όνομα του Θέματος</span> είναι <u>μοναδικό</u> - ένα όνομα που ταιριάζει με ένα υπάρχον θέμα <u>θα αντικαταστήσει το προηγούμενο</u>!`
                ],
                placeholder: "Όνομα Θέματος",
                theme: "Θέμα"
            }
        }
    },
    logwin: {
        content: {
            tagline: "Εδώ είναι τι έχει συμβεί από την εκκίνηση της εφαρμογής στις",
            copylog: "Αντιγραφή Περιεχομένου Καταγραφής"
        }
    },
    reset: {
        content: {
            sub: `
                <div class="wrapper" id="resetsub">
                    <span>Είστε σίγουρος;</span>
                    <span>Όλα τα προηγουμένως ρυθμισμένα δεδομένα, <u>συμπεριλαμβανομένων των Προσαρμογών</u>, θα επαναφερθούν στις προεπιλεγμένες ρυθμίσεις.</span>
                    <span>🛑 Αυτό δεν μπορεί να αναιρεθεί!</span>
                </div>
            `,
            reset: "Επαναφορά"
        }
    },
    error: {
        content: {
            subtitle: "Το Steam Achievement Notifier αντιμετώπισε ένα πρόβλημα και πρέπει να κλείσει.",
            details: "Εδώ είναι οι λεπτομέρειες του σφάλματος:",
            sub: "Κάντε κλικ στα παρακάτω κουμπιά για να αναφέρετε αυτό το πρόβλημα μέσω της προτιμώμενης πλατφόρμας σας.",
            report: "Αναφορά",
            log: "Καταγραφή Εφαρμογής",
            exit: "Έξοδος"
        }
    },    
    tooltips: {
        game: "Το παιχνίδι για το οποίο παρακολουθούνται επιτεύγματα αυτή τη στιγμή",
        usertheme: "Επιλέξτε ένα προηγουμένως αποθηκευμένο θέμα",
        customise: "Προσαρμογή ειδοποιήσεων επιτευγμάτων",
        test: "Εμφάνιση δοκιμαστικής ειδοποίησης, συμπεριλαμβανομένων τυχόν προσαρμογών",
        kofi: "Δωρεά στο Ko-Fi!",
        discord: "Εγγραφή στο Discord!",
        github: "Αναφορά προβλήματος",
        lang: "Επιλέξτε τη γλώσσα του περιβάλλοντος χρήσης που χρησιμοποιείται στην εφαρμογή",
        desktop: "Εναλλαγή συντόμευσης στην επιφάνεια εργασίας για να εκτελείται η εφαρμογή",
        startwin: "Εκκίνηση του Steam Achievement Notifier αυτόματα μετά την είσοδο",
        startmin: "Αφού ξεκινήσει, απόκρυψη του παραθύρου του περιβάλλοντος χρήσης της εφαρμογής μέχρι να ανοιχτεί από τη γραμμή κατάστασης του συστήματος",
        nohwa: `Απενεργοποίηση της υλικής επιτάχυνσης, η οποία μπορεί να βελτιώσει την απόδοση σε συστήματα με περιορισμένους πόρους ή συστήματα χωρίς αφιερωμένη GPU<br><br><span class="ttdesc">Η εφαρμογή θα επανεκκινήσει μετά την ενεργοποίηση/απενεργοποίηση αυτής της επιλογής</span>`,
        litemode: "Απενεργοποίηση όλων των διαδραστικών στοιχείων του περιβάλλοντος χρήσης, παρέχοντας μόνο περιορισμένη λειτουργικότητα της εφαρμογής μέσω του εικονιδίου της γραμμής κατάστασης του συστήματος. Μπορεί να βελτιώσει τους πόρους που καταναλώνονται από την εφαρμογή",
        rarity: "Το ποσοστό στο οποίο θα ενεργοποιούνται οι ειδοποιήσεις για σπάνια επιτεύγματα. Κάθε επίτευγμα με ποσοστό ξεκλειδώματος πάνω από αυτή την τιμή θα εμφανίζεται ως κύρια ειδοποίηση",
        showpercent: "Εμφάνιση του ποσοστού ξεκλειδώματος του επιτεύγματος στην ειδοποίηση για τους επιλεγμένους τύπους",
        soundonly: "Απενεργοποίηση των ειδοποιήσεων, αναπαραγωγή μόνο των ήχων που έχουν οριστεί μέσω του προσαρμογέα",
        extwin: "Δημιουργία ενός κρυφού παραθύρου φόντου που αναπαράγει οποιεσδήποτε ειδοποιήσεις εμφανίζονται αυτή τη στιγμή στην οθόνη. Αυτό το παράθυρο μπορεί στη συνέχεια να προστεθεί ως πηγή καταγραφής παραθύρου για χρήση σε λογισμικό ροής, όπως το OBS",
        audiosrc: "Επιλέξτε την πηγή ήχου (ή απενεργοποιήστε) που δημιουργείται από την εφαρμογή",
        nowtracking: "Εμφάνιση ειδοποίησης που ενημερώνει τον χρήστη ότι παρακολουθούνται επιτεύγματα για ένα τρέχον παιχνίδι",
        nowtrackingscale: `Ορίστε το μέγεθος της ειδοποίησης παρακολούθησης`,
        shortcuts: "Ενεργοποίηση δοκιμαστικής ειδοποίησης μέσω συντόμευσης πληκτρολογίου. Οι συντομεύσεις μπορούν να προσαρμοστούν για κάθε τύπο ειδοποίησης",
        steamss: "Λήψη στιγμιότυπου Steam όταν ξεκλειδώνεται ένα επίτευγμα",
        screenshots: "Επιλέξτε τον τύπο Πρόσθετων Πολυμέσων που θα δημιουργηθεί όταν εμφανίζεται μια ειδοποίηση",
        monitors: "Ο οθονη που θα καταγραφεί κατά τη λήψη του στιγμιότυπου",
        ovpos: "Η θέση της επικάλυψης της ειδοποίησης μέσα στο στιγμιότυπο",
        ovmatch: "Αντιστοίχιση της θέσης οθόνης που έχει οριστεί στον προσαρμογέα για αυτόν τον τύπο ειδοποίησης",
        ovpath: "Η τοποθεσία όπου θα αποθηκεύονται τα στιγμιότυπα που δημιουργούνται από αυτήν την επιλογή",
        ssdelay: "Προσθήκη καθυστέρησης από τη στιγμή που εμφανίζεται η ειδοποίηση μέχρι τη λήψη του στιγμιότυπου",
        sspreview: "Εμφάνιση προεπισκόπησης του πώς θα εμφανιστεί το στιγμιότυπο όταν αποθηκευτεί",
        noanim: "Απενεργοποίηση όλων των κινήσεων παραθύρου και εφέ μετάβασης της εφαρμογής",
        nvda: "Ενεργοποίηση αντιγραφής πληροφοριών επιτεύγματος στο πρόχειρο όταν ξεκλειδώνεται ένα επίτευγμα, για να μπορεί να διαβαστεί από λογισμικό ανάγνωσης οθόνης, όπως το NVDA",
        tooltips: "Εμφάνιση εργαλειοθηκών όταν τοποθετείτε το ποντίκι πάνω από ορισμένα στοιχεία του περιβάλλοντος χρήσης",
        pollrate: `Ορίστε το διάστημα ενημέρωσης για τα δεδομένα επίτευξης κατά τη διάρκεια του παιχνιδιού<br><br><span class="ttdesc">Η απόδοση μπορεί να αυξηθεί/μειωθεί ανάλογα με την τιμή ή το υλικό του συστήματος. Οι υψηλότερες τιμές συνήθως οδηγούν σε χαμηλότερο φόρτο συστήματος, αλλά μπορεί να προκαλέσουν καθυστερήσεις στις ειδοποιήσεις</span>`,
        releasedelay: `Ορίζει πόσο καιρό περιμένει η διεργασία φόντου να επανεκκινήσει μετά την κυκλοφορία του τρέχοντος παιχνιδιού. Επηρεάζει τόσο την αυτόματη παρακολούθηση της διαδικασίας όσο και τα παιχνίδια που έχουν συνδεθεί χειροκίνητα.<br><br><span class="ttdesc">Επιτρέπει έναν μεγαλύτερο χρονικό πλαίσιο για την πλήρη απελευθέρωση του Steamworks από την εφαρμογή. Η αύξηση αυτής της τιμής μπορεί να αποτρέψει την ανώμαλη συμπεριφορά, όπως η παρακολούθηση ενός προηγουμένως κλειστού παιχνιδιού</span>`,
        maxretries: `Ορίζει το μέγιστο αριθμό προσπαθειών για να συνδέσετε μια τρέχουσα διαδικασία με ένα εντοπισμένο AppID. Επηρεάζει τόσο την αυτόματη παρακολούθηση της διαδικασίας όσο και τα παιχνίδια που έχουν συνδεθεί χειροκίνητα.<br><br><span class="ttdesc">Οι προσπάθειες σύνδεσης πραγματοποιούνται μία φορά κάθε δευτερόλεπτο. Εάν μια τρέχουσα διαδικασία δεν συνδέεται με το τρέχον AppID μετά από αυτόν τον αριθμό προσπαθειών, θα επιστραφεί μια μη έγκυρη διαδικασία. Σε τέτοιες περιπτώσεις, το παιχνίδι θα πρέπει να ελευθερωθεί χειροκίνητα μέσω της Περιοχής Ειδοποιήσεων του Συστήματος > Επιλογές > Απελευθέρωση Παιχνιδιού</span>`,
        notifydebug: "Δημιουργία παραθύρου DevTools για όλες τις ειδοποιήσεις. Χρήσιμο για αποσφαλμάτωση/επίλυση προβλημάτων ειδοποιήσεων",
        usecustomfiles: "Ενεργοποίηση φόρτωσης προσαρμοσμένων αρχείων ειδοποιήσεων από τον χρήστη. Συνιστάται προσοχή για τους κανονικούς χρήστες",
        showcustomfiles: "Άνοιγμα της τοποθεσίας των προσαρμοσμένων αρχείων",
        log: "Άνοιγμα του παραθύρου καταγραφής εφαρμογής, το οποίο εμφανίζει πληροφορίες σχετικά με τη δραστηριότητα της διεργασίας, προειδοποιήσεις και σφάλματα",
        reset: "Αφαιρεί όλα τα δεδομένα ρύθμισης και επανεκκινεί την εφαρμογή",
        playback: "Παύση/συνέχιση της αναπαραγωγής της προεπισκόπησης της ειδοποίησης",
        replay: "Επανεκκίνηση της αναπαραγωγής της προεπισκόπησης της ειδοποίησης",
        preset: "Επιλογή του προκαθορισμένου προσαρμογέα ειδοποίησης",
        iconanim: "Εναλλαγή του περιγράμματος και της κινούμενης εικόνας του σπάνιου εικονιδίου",
        alldetails: "Εμφάνιση όλων των κειμένων στοιχείων μέσα στην ειδοποίηση, συμπεριλαμβανομένων αυτών που είναι κρυμμένα από προεπιλογή για αυτόν τον προσαρμογέα",
        usepercent: "Εμφάνιση του ποσοστού ξεκλειδώματος της επίτευξης, αντί της τιμής XP/S",
        displaytime: "Ορισμός του αριθμού των δευτερολέπτων που θα εμφανίζεται η ειδοποίηση",
        scale: "Αύξηση ή μείωση του μεγέθους της ειδοποίησης",
        customtext: "Ορισμός ενός προσαρμοσμένου μηνύματος που θα εμφανίζεται μέσα στην ειδοποίηση",
        usegametitle: "Εμφάνιση του τίτλου του τρέχοντος παιχνιδιού μέσα στην ειδοποίηση",
        customfont: "Φόρτωση ενός προσαρμοσμένου γραμματοσειράς που θα χρησιμοποιείται μέσα στην ειδοποίηση",
        soundmode: "Επιλογή είτε ενός μόνο ηχητικού αρχείου, είτε ενός τυχαία επιλεγμένου ηχητικού αρχείου από έναν φάκελο που περιέχει πολλά ηχητικά αρχεία, όταν συμβαίνει μια ειδοποίηση",
        soundfile: "Επιλογή ενός ηχητικού αρχείου που θα αναπαραχθεί όταν συμβεί μια ειδοποίηση",
        sounddir: "Επιλογή ενός φακέλου από τον οποίο θα επιλεγεί τυχαία ένα ηχητικό αρχείο όταν συμβαίνει μια ειδοποίηση",
        volume: "Ορισμός της έντασης αναπαραγωγής του ηχητικού αρχείου",
        preview: "Προεπισκόπηση του επιλεγμένου ηχητικού αρχείου ή ενός ηχητικού αρχείου που επιλέγεται τυχαία από τον φάκελο",
        bgstyle: "Επιλογή του στυλ για το φόντο της ειδοποίησης",
        gradientangle: "Ορισμός της γωνίας του γραδιού",
        bgimg: "Φόρτωση ενός εικονιδίου αρχείου που θα χρησιμοποιηθεί ως φόντο της ειδοποίησης",
        bgimgbrightness: "Ορίστε τη φωτεινότητα της εικόνας που χρησιμοποιείται ως φόντο για την ειδοποίηση",
        brightness: "Ορισμός της φωτεινότητας της εικόνας του παιχνιδιού που χρησιμοποιείται ως φόντο της ειδοποίησης",
        roundness: "Ορισμός της στρογγυλότητας των άκρων της ειδοποίησης",
        fontsize: "Ορισμός του μεγέθους της γραμματοσειράς που χρησιμοποιείται στην ειδοποίηση",
        opacity: "Ορισμός της συνολικής διαφάνειας της ειδοποίησης",
        bgonly: "Ορισμός μόνο της διαφάνειας για το φόντο της ειδοποίησης, κρατώντας τα άλλα στοιχεία στην πλήρη διαφάνεια",
        primarycolor: "Ορισμός του πρωτεύοντος χρώματος της ειδοποίησης",
        secondarycolor: "Ορισμός του δευτερεύοντος χρώματος της ειδοποίησης",
        tertiarycolor: "Ορισμός του τριτοβάθμιου χρώματος της ειδοποίησης",
        fontcolor: "Ορισμός του χρώματος όλων των κειμένων που εμφανίζονται μέσα στην ειδοποίηση",
        fontoutline: "Προσθήκη περίγραμματος σε όλα τα κείμενα που εμφανίζονται μέσα στην ειδοποίηση",
        fontoutlinecolor: "Ορισμός του χρώματος του περιγράμματος του κειμένου",
        fontshadow: "Προσθήκη σκιάς σε όλα τα κείμενα που εμφανίζονται μέσα στην ειδοποίηση",
        fontshadowcolor: "Ορισμός του χρώματος της σκιάς του κειμένου",
        iconroundness: "Ορισμός της στρογγυλότητας του εικονιδίου επιτεύγματος/παιχνιδιού που εμφανίζεται μέσα στην ειδοποίηση",
        plat: "Φόρτωση εικονιδίου αρχείου που θα χρησιμοποιηθεί ως εικονίδιο 100%",
        usegameicon: "Αντικατάσταση του προεπιλεγμένου εικονιδίου ειδοποίησης με το εικονίδιο του τρέχοντος παιχνιδιού",
        showhiddenicon: "Εμφάνιση μιας εικόνας που υποδηλώνει ότι η επίτευξη είναι κρυφή στην ειδοποίηση",
        hiddenicon: "Φόρτωση ενός αρχείου εικόνας για να αντικαταστήσετε το κρυφό εικονίδιο επίτευξης",
        logo: "Φόρτωση εικονιδίου αρχείου για αντικατάσταση του εικονιδίου του λογότυπου",
        decoration: "Φόρτωση εικονιδίου αρχείου για αντικατάσταση του εικονιδίου της διακόσμησης",
        showdecoration: "Εναλλαγή της ορατότητας του εικονιδίου της διακόσμησης",
        pos: "Ορισμός της θέσης της ειδοποίησης στην οθόνη",
        usecustompos: "Ενεργοποίηση προσαρμοσμένης θέσης για την ειδοποίηση",
        setcustompos: "Ορισμός της προσαρμοσμένης θέσης για την ειδοποίηση",
        resetcustompos: "Επαναφορά της θέσης της ειδοποίησης στην προεπιλεγμένη προσαρμοσμένη θέση",
        savetheme: "Αποθήκευση όλων των προσαρμοσμένων επιλογών προσαρμογής ως νέο θέμα",
        visibilitybtn: "Εναλλαγή της ορατότητας του στοιχείου σε προεπισκοπήσεις προσαρμογέα και δοκιμαστικές ειδοποιήσεις",
        delbtn: "Επαναφορά του στοιχείου στην προεπιλογή",
        link: `Ανοίξτε <span class="hl">Μενού Διαχείρισης Συνδεδεμένων Παιχνιδιών</span>`,
        imgpath: "Η τοποθεσία όπου θα αποθηκευτούν οι εικόνες ειδοποιήσεων που δημιουργήθηκαν από αυτήν την επιλογή"
    },
    update: {
        updateavailable: "Διαθέσιμη ενημέρωση",
        sub: [
            `<span id="newversion"></span>`,
            "Υπάρχει διαθέσιμη μια νέα ενημέρωση για το Steam Achievement Notifier!",
            `Ολόκληρες Σημειώσεις Έκδοσης διαθέσιμες στο <span id="discordreleasenotes"></span> και <span id="githubreleasenotes"></span>`
        ],
        update: "Ενημέρωση"
    },
    "linkgame": {
        "content": {
            "exepath": "Διαδρομή εκτελέσιμου αρχείου",
            "nodata": "Δεν υπάρχουν δεδομένα",
            "manage": "Διαχείριση συνδεδεμένων παιχνιδιών",
            "managesub": [
                `Συνδέστε χειροκίνητα το <span class="hl">εκτελέσιμο αρχείο</span> ενός παιχνιδιού σε ένα συγκεκριμένο <span class="hl">AppID</span>, ή <span class="hl">αποσυνδέστε</span> ένα υπάρχον`,
                `Το Steam Achievement Notifier δεν θα χρησιμοποιεί πλέον <span class="hl">αυτόματη παρακολούθηση διεργασιών</span> για κανένα από τα <span class="hl">συνδεδεμένα παιχνίδια</span> - αντ' αυτού, το καθορισμένο <span class="hl">εκτελέσιμο αρχείο</span> θα παρακολουθείται κάθε φορά που ανιχνεύεται το σχετικό <span class="hl">AppID</span>`,
                `<span class="hl" id="appidhelp"><u>Πώς μπορώ να βρω το AppID ενός παιχνιδιού στο Steam;</u></span>`
            ],
            "new": "Νέο...",
            "linknew": "Νέο συνδεδεμένο παιχνίδι",
            "linknewsub": [
                `Δημιουργήστε μια νέα σύνδεση μεταξύ ενός <span class="hl">εκτελέσιμου αρχείου παιχνιδιού</span> και του σχετικού <span class="hl">AppID</span>`,
                `Μόλις δημιουργηθούν, οι συνδέσεις μπορούν να <span class="hl">αποσυνδεθούν</span> μέσω του προηγούμενου διαλόγου <span class="hl">Διαχείριση συνδεδεμένων παιχνιδιών</span>`
            ],
            "link": "Σύνδεση",
            "findappid": "Εύρεση AppID",
            "findappidsub": [
                `Κάθε παιχνίδι του Steam έχει ένα μοναδικό αριθμό - ονομάζεται <span class="hl">AppID</span>. Μπορείτε να βρείτε το σχετικό AppID οποιουδήποτε παιχνιδιού του Steam ελέγχοντας μία από τις ακόλουθες μεθόδους:`,
                `Στον <span class="hl">πελάτη Steam</span>, κάντε δεξί κλικ σε ένα παιχνίδι στην <span class="hl">Βιβλιοθήκη</span> σας και επιλέξτε <i>Ιδιότητες</i> > <i>Ενημερώσεις</i> - το AppID θα εμφανιστεί εδώ`,
                `Η <span class="hl">URL</span> της σελίδας του <span class="hl">Καταστήματος</span> του παιχνιδιού - θα είναι το νούμερο που ακολουθεί μετά το <span class="hl">app/</span>: <code class="appidhelpcode">https://store.steampowered.com/app/<span class="hl">4000</span></code>`,
                `Ιστότοποι όπως ο <span class="hl">SteamDB</span> - η ενότητα <span class="hl">Πληροφορίες App</span> θα καταχωρίσει το AppID για κάθε παιχνίδι`
            ]
        }
    }
}