export const translations = {
    global: {
        main: "Κύριο",
        rare: "Σπάνιο",
        plat: "100%",
        test: "Ειδοποιήσεις δοκιμής",
        topleft: "Πάνω αριστερά",
        topcenter: "Πάνω κέντρο",
        topright: "Πάνω δεξιά",
        bottomleft: "Κάτω αριστερά",
        bottomcenter: "Κάτω κέντρο",
        bottomright: "Κάτω δεξιά",
        ok: "Εντάξει",
        preview: "Προεπισκόπηση",
        save: "Αποθήκευση",
        back: "Πίσω",
        settings: "Ρυθμίσεις",
        appversion: "Έκδοση εφαρμογής",
        image: "Εικόνα",
        audio: "Ήχος",
        folder: "Φάκελος",
        font: "Γραμματοσειρά",
        select: "Επιλογή",
        gametitle: "Τίτλος παιχνιδιού",
        congrats: "Συγχαρητήρια!",
        achievementunlocked: "Κατάκτηση ξεκλείδωτη",
        gamecomplete: "Ολοκλήρωση 100%",
        achievementdesc: "Κάνατε κλικ στο κουμπί Εμφάνιση δοκιμαστικής ειδοποίησης",
        gamecompletedesc: "Ξεκλειδώσατε όλες τις επιτεύξεις!",
        defaultcustomfont: "Προεπιλογή (Δεν έχει επιλεγεί γραμματοσειρά)",
        defaultsoundfile: "Προεπιλογή (Δεν έχει επιλεγεί αρχείο ήχου)",
        defaultsounddir: "Προεπιλογή (Δεν έχει επιλεγεί φάκελος)",
        nowtracking: "Παρακολούθηση επιτευγμάτων για:",
        nopreview: "Η προεπισκόπηση δεν είναι διαθέσιμη για το φυσικό λειτουργικό σύστημα",
        options: "Επιλογές",
        resetwindow: "Επαναφορά παραθύρου",
        show: "Εμφάνιση",
        exit: "Έξοδος",
        releasegame: "Απελευθέρωση Παιχνιδιού",
        releasegamesub: [
            `Επανεκκινήστε τη διαδικασία Worker στο παρασκήνιο και απελευθερώστε το τρέχον παιχνίδι από την παρακολούθηση`,
            `Δοκιμάστε αυτήν την επιλογή αν έχετε κλείσει πρόσφατα ένα παιχνίδι αλλά το Steam συνεχίζει να το εμφανίζει ως ενεργό, ή αν το Steam Achievement Notifier συνεχίζει να εμφανίζει ως παρακολούθηση ενός παιχνιδιού που έχει ήδη κλείσει`
        ],
        noupdateavailable: "Δεν υπάρχει διαθέσιμη ενημέρωση",
        latestversion: "Εγκατεστημένη η τελευταία έκδοση",
        missingdeps: "Λείπουσα εξάρτηση",
        restartapp: "Επανεκκίνηση Εφαρμογής",
        restartappsub: [
            `Αν τα πράγματα δεν λειτουργούν σωστά, χρησιμοποιήστε αυτήν την επιλογή για να κλείσετε και να ξανανοίξετε την εφαρμογή`,
            `Αν το πρόβλημα εξακολουθεί να υπάρχει αφότου επανεκκινήσετε την εφαρμογή, παρακαλούμε να σκεφτείτε να το αναφέρετε χρησιμοποιώντας τους ενσωματωμένους συνδέσμους στην αρχική οθόνη`
        ],
        suspend: "Αναστολή",
        resume: "Συνέχιση",
        new: "Νέο...",
        nodata: "Δεν υπάρχουν δεδομένα",
        findappid: "Εύρεση AppID",
        findappidsub: [
            `Κάθε παιχνίδι του Steam έχει ένα μοναδικό αριθμό - ονομάζεται <span class="hl">AppID</span>. Μπορείτε να βρείτε το σχετικό AppID οποιουδήποτε παιχνιδιού του Steam ελέγχοντας μία από τις ακόλουθες μεθόδους:`,
            `Στον <span class="hl">πελάτη Steam</span>, κάντε δεξί κλικ σε ένα παιχνίδι στην <span class="hl">Βιβλιοθήκη</span> σας και επιλέξτε <i>Ιδιότητες</i> > <i>Ενημερώσεις</i> - το AppID θα εμφανιστεί εδώ`,
            `Η <span class="hl">URL</span> της σελίδας του <span class="hl">Καταστήματος</span> του παιχνιδιού - θα είναι το νούμερο που ακολουθεί μετά το <span class="hl">app/</span>: <code class="appidhelpcode">https://store.steampowered.com/app/<span class="hl">4000</span></code>`,
            `Ιστότοποι όπως ο <span class="hl">SteamDB</span> - η ενότητα <span class="hl">Πληροφορίες App</span> θα καταχωρίσει το AppID για κάθε παιχνίδι`
        ],
        noexe: "Δεν βρέθηκε το EXE του παιχνιδιού!",
        noexesub: "Κάντε κλικ εδώ για περισσότερες πληροφορίες",
        noexedialogsub: [
            `Το Steam Achievement Notifier δεν μπόρεσε να βρει αυτόματα το εκτελέσιμο αρχείο αυτού του παιχνιδιού. Η τοποθεσία του εκτελέσιμου αρχείου απαιτείται για να "απελευθερώσετε" το παιχνίδι`,
            `Για να απελευθερώσετε το παιχνίδι χειροκίνητα, <i>κάντε δεξί κλικ</i> στο <span class="hl">εικονίδιο στη γραμμή συστήματος</span> > <span class="hl">Επιλογές</span> > <span class="hl">Απελευθέρωση παιχνιδιού</span>, ή χρησιμοποιήστε τη <span class="hl">Συντόμευση Απελευθέρωσης Παιχνιδιού</span>`,
            `Εναλλακτικά, κάντε κλικ στο κουμπί <span class="hl">Σύνδεση</span> παρακάτω για να προσθέσετε το εκτελέσιμο αρχείο του ενεργού παραθύρου στο μενού <span class="hl">Συνδεδεμένα Παιχνίδια</span>`,
            `<span class="hl help" id="linkgamehelp"><u>Τι συμβαίνει όταν κάνω κλικ στο κουμπί Σύνδεση;</u></span>`
        ],
        linkgamehelp: "Σύνδεση παιχνιδιού μέσω παραθύρου",
        linkgamehelpsub: [
            `Κάνοντας κλικ στο κουμπί <span class="hl">Σύνδεση</span>, θα προστεθεί αυτόματα μια νέα είσοδος στο μενού <span class="hl">Ρυθμίσεις</span> > <span class="hl">Συνδεδεμένα Παιχνίδια</span>, χρησιμοποιώντας τις πληροφορίες του ενεργού παραθύρου.`,
            `Μετά την κλικ στο κουμπί <span class="hl">Σύνδεση</span>, θα ξεκινήσει ένας χρονοδιακόπτης 5 δευτερολέπτων`,
            `Πριν λήξει ο χρονοδιακόπτης, εστιάστε στο παράθυρο του παιχνιδιού`,
            `Μόλις λήξει ο χρονοδιακόπτης, θα προστεθεί μια νέα είσοδος για το τρέχον <span class="hl">AppID</span> στο μενού <span class="hl">Ρυθμίσεις</span> > <span class="hl">Συνδεδεμένα Παιχνίδια</span>, χρησιμοποιώντας το εκτελέσιμο αρχείο του ενεργού παραθύρου`,
            `Αν χρειάζεται να προσπαθήσετε ξανά, αφαιρέστε την είσοδο από το <span class="hl">Ρυθμίσεις</span> > <span class="hl">Συνδεδεμένα Παιχνίδια</span> κάνοντας κλικ στο κουμπί <span id="linkhelpunlink"></span>`
        ],
        addlinkfailed: "Αποτυχία σύνδεσης παραθύρου",
        addlinkfailedsub: `Κάντε κλικ στο κουμπί <span class="hl">Σύνδεση</span> για να προσπαθήσετε ξανά`,
        webhookunlockmsg: "$user ξεκλείδωσε ένα επίτευγμα",
        webhookunlockmsgplat: "$user ξεκλείδωσε όλα τα επιτεύγματα",
        webhookingame: "στο $gamename",
        notconnected: "Δεν είναι συνδεδεμένο",
        raloghelp: "Το παιχνίδι μου δεν ανιχνεύεται",
        raenablelog: `Αρχεία καταγραφής εξομοιωτή`,
        raenablelogsub: [
            `Για να αποκτήσετε πρόσβαση σε εσωτερικά γεγονότα παιχνιδιού (όπως η τρέχουσα κατάσταση του παιχνιδιού, πληροφορίες για την απελευθέρωση επιτευγμάτων κ.λπ.), η καταγραφή σε εξωτερικό <span class="hl">αρχείο καταγραφής</span> <u>πρέπει να είναι ενεργοποιημένη</u> σε οποιουσδήποτε επιλεγμένους εξομοιωτές.<br><br>Οι επιλεγμένοι εξομοιωτές <u>πρέπει να χρησιμοποιούν αυτό το <span class="hl">αρχείο καταγραφής</span></u> ως την τιμή για το <span class="hl">Μονοπάτι Αρχείου Καταγραφής</span>.`,
            `<details>
                <summary id="retroarch">RetroArch</summary>
                <div>
                    <span class="hl">RetroArch > Ρυθμίσεις > Καταγραφή</span> πρέπει να έχει ρυθμιστεί με τις εξής ρυθμίσεις:
                    <br>
                    <ul>
                        <li><span class="hllb">Λεπτομέρεια Καταγραφής</span>: <span class="hlgreen">ΕΝΕΡΓΟ</span></li>
                        <li><span class="hllb">Επίπεδο Καταγραφής Στο Πρόσθιο Μέρος</span>: <span class="hlgreen">1 (Πληροφορίες)</span></li>
                        <li><span class="hllb">Καταγραφή σε Αρχείο</span>: <span class="hlgreen">ΕΝΕΡΓΟ</span></li>
                        <li><span class="hllb">Χρονοσήμανση Αρχείων Καταγραφής</span>: <span class="hlred">ΑΝΕΝΕΡΓΟ</span></li>
                    </ul>
                    <br>
                    Με τις προεπιλεγμένες ρυθμίσεις εγκατάστασης, το <span class="hl">"retroarch.log"</span> αποθηκεύεται στο εξής:
                    <br>
                    <ul>
                        <li><span class="hllb">C:\\RetroArch-x64\\Logs</span></li>
                    </ul>
                </div>
            </details>`,
            `<details>
                <summary id="dolphin">Dolphin</summary>
                <div>
                    <span class="hl">Dolphin > Προβολή > Εμφάνιση Ρυθμίσεων Καταγραφής</span> πρέπει να έχει ρυθμιστεί με τις εξής ρυθμίσεις:
                    <br>
                    <ul>
                        <li><span class="hllb">Λεπτομέρεια</span>: <span class="hlgreen">Πληροφορίες</span></li>
                        <li><span class="hllb">Έξοδοι Καταγραφής</span> > <span class="hlgreen">Γράψε σε Αρχείο</span></li>
                        <li><span class="hllb">Τύποι Καταγραφής</span> > <span class="hlgreen">Επιτεύγματα (RetroAchievements)</span></li>
                    </ul>
                    <br>
                    Με τις προεπιλεγμένες ρυθμίσεις εγκατάστασης, το <span class="hl">"dolphin.log"</span> αποθηκεύεται σε μία από τις εξής τοποθεσίες:
                    <br>
                    <ul>
                        <li><span class="hllb">%APPDATA%\\Dolphin Emulator\\Logs</span></li>
                        <li><span class="hllb">%USERPROFILE%\\Documents\\Dolphin Emulator\\Logs</span></li>
                        <li>🐧 <span class="hllb">$XDG_DATA_HOME/dolphin-emu/Logs</span></li>
                    </ul>
                </div>
            </details>`
        ]
    },
    app: {
        content: {
            game: "Δεν ανιχνεύθηκε παιχνίδι",
            customise: "Προσαρμογή",
            test: "Εμφάνιση δοκιμαστικής ειδοποίησης"
        }
    },
    settings: {
        language: {
            title: "Γλώσσα",
            content: {
                steamlang: "Μεταφράστε τα επιτεύγματα στη γλώσσα του Steam",
                maxsteamlangretries: "Μέγιστος αριθμός προσπαθειών μετάφρασης"
            }
        },
        os: {
            title: "Λειτουργικό σύστημα",
            content: {
                desktop: "Δημιουργία συντόμευσης επιφάνειας εργασίας",
                startwin: "Έναρξη κατά την σύνδεση",
                startmin: "Έναρξη με ελαχιστοποίηση",
                nohwa: "Απενεργοποίηση επιτάχυνσης υλικού",
                litemode: "Λειτουργία ελαφράς έκδοσης"
            }
        },
        notifications: {
            title: "Ειδοποιήσεις",
            content: {
                rarity: "Ποσοστό σπανιότητας",
                rareonly: "Μόνο σπάνια",
                all: "Όλα",
                off: "Απενεργοποίηση",
                showpercent: "Εμφάνιση ποσοστού",
                soundonly: "Μόνο ήχος",
                nowtracking: "Εμφάνιση Ειδοποίησης Παρακολούθησης",
                nowtrackingscale: "Κλίμακα Παρακολούθησης",
                nowtrackingpos: "Καταγραφή Θέσης",
                shortcuts: "Συντομεύσεις ειδοποιήσεων",
                noiconcache: "Απενεργοποίηση προσωρινής μνήμης εικονιδίων",
                webhooks: "Δημοσίευση στον διακομιστή Discord",
                webhooktypes: "Τύποι Webhook",
                webhookurl: `URL Webhook`,
                webhookcaution: `Ενεργοποιώντας αυτήν την επιλογή και παρέχοντας έναν έγκυρο σύνδεσμο Webhook Discord, συμφωνείτε ότι κατανοείτε ότι <u>όλες οι πληροφορίες επιτευγμάτων και παιχνιδιών για τον τρέχοντα χρήστη Steam</u> θα αναρτηθούν στον καθορισμένο διακομιστή Discord μέσω του παρεχόμενου συνδέσμου Webhook.<br><br>Εάν δεν επιθυμείτε να δημοσιεύσει το Steam Achievement Notifier αυτές τις πληροφορίες εκ μέρους σας, απενεργοποιήστε αυτήν την επιλογή.`,
                webhooklaststatus: "Τελευταία Κατάσταση",
                webhookspoilers: `Προσθήκη ετικέτας spoiler`
            }
        },
        games: {
            title: "Παιχνίδια",
            content: {
                linkedgames: "Συνδεδεμένα παιχνίδια",
                themeswitch: "Αυτόματος αλλαγή θεμάτων",
                exclusionlist: "Λίστα αποκλεισμού"
            }
        },
        media: {
            title: "Πολυμέσα",
            content: {
                steamss: "Λήψη στιγμιότυπου Steam",
                screenshots: "Πρόσθετα μέσα",
                off: "Απενεργοποίηση",
                overlay: "Στιγμιότυπο με επικάλυψη ειδοποιήσεων",
                monitors: "Πηγή στιγμιοτύπου",
                hdrmode: "Λειτουργία HDR",
                ovpos: "Θέση επικάλυψης",
                ovmatch: "Αντιστοίχιση θέσης προσαρμογής",
                ovx: "Οριζόντια μετατόπιση",
                ovy: "Κάθετη μετατόπιση",                
                ovpath: "Διαδρομή στιγμιότυπου",
                ssdelay: "Καθυστέρηση στιγμιοτύπου",
                notifyimg: "Εικόνα ειδοποίησης",
                imgpath: "Διαδρομή εικόνας",
                ssenabled: "Ενεργοποίηση",
            }
        },
        streaming: {
            title: "Ροή",
            content: {
                extwin: "Ειδοποιήσεις ροής",
                extwinframerate: "Ρυθμός καρέ",
                extwinshow: "Εμφάνιση παραθύρου",
                audiosrc: "Πηγή ήχου",
                notify: "Ειδοποίηση",
                app: "Εφαρμογή",
                off: "Σίγαση",
                statwin: "Παράθυρο Στατιστικών Επιτευγμάτων",
                statwinaot: "Πάντα στην κορυφή",
                noachievements: "Δεν υπάρχουν επιτεύγματα για προβολή",
                startgame: "Ξεκινήστε ένα παιχνίδι για να εμφανίσετε τα επιτεύγματα!",
                max: "Μέγιστο",
                custom: "Προσαρμοσμένο...",
                statwinshortcut: "Συντόμευση Επικάλυψης",
            }
        },
        accessibility: {
            title: "Προσβασιμότητα",
            content: {
                noanim: "Απενεργοποίηση κινήσεων παραθύρου εφαρμογής",
                noupdatedialog: "Απενεργοποίηση διαλόγου ενημέρωσης",
                nvda: "Ενεργοποίηση υποστήριξης NVDA",
                tooltips: "Εμφάνιση εργαλειοθηκών",
                showsystrayopts: "Εμφάνιση επιλογών συστήματος",
                releaseshortcut: "Συντόμευση Απελευθέρωσης Παιχνιδιού"
            }
        },
        advanced: {
            title: "Προχωρημένες ρυθμίσεις",
            content: {
                pollrate: "Ρυθμός δημοσκόπησης",
                initdelay: "Καθυστέρηση παρακολούθησης",
                releasedelay: "Καθυστέρηση Κυκλοφορίας",
                maxretries: "Μέγιστος αριθμός επαναλαμβανόμενων προσπαθειών",
                debug: "Πίνακας Αποσφαλμάτωσης",
                userust: "Εναλλακτική Λειτουργία Επεξεργασίας",
                notifydebug: "Εμφάνιση ειδοποιήσεων αποσφαλμάτωσης",
                exportachdata: "Εξαγωγή Δεδομένων Επιτευγμάτων",
                usecustomfiles: "Χρήση προσαρμοσμένων αρχείων εφαρμογής",
                showcustomfiles: "Εμφάνιση προσαρμοσμένων αρχείων εφαρμογής"
            }
        },
        ra: {
            title: "Retro Achievements",
            content: {
                raemus: "Εξομοιωτές",
                rauser: "Όνομα χρήστη",
                rakey: "API Κλειδί",
                retroarch: "RetroArch",
                dolphin: "Dolphin",
                installdir: "Διαδρομή αρχείου καταγραφής",
                rapercenttype: "Τύπος ποσοστού",
                hard: "Hardcore",
                soft: "Softcore",
                placeholder: "Εισάγετε τη διαδρομή του αρχείου καταγραφής",
                logfile: "Αρχείο Καταγραφής",
                status: "Κατάσταση",
                game: "Παιχνίδι",
                wait: "Αναμονή για τον εξομοιωτή",
                idle: "Αναμονή για το γεγονός του παιχνιδιού",
                start: "Ξεκινώντας το παιχνίδι",
                stop: "Σταματώντας το παιχνίδι",
                achievement: "Επίτευγμα ξεκλείδωσε"
            }
        },
        misc: {
            title: "Διάφορα",
            content: {
                colorprofile: "Προφίλ Χρώματος",
                checkforupdates: "Έλεγχος για ενημερώσεις",
                log: "Καταγραφή Εφαρμογής",
                reset: "Επαναφορά εφαρμογής"
            }
        }
    },
    customiser: {
        preset: {
            title: "Προεπιλογή",
            content: {
                preset: "Προεπιλεγμένη Ειδοποίηση",
                iconanim: "Σπάνια Κινούμενη Εικόνα",
                alldetails: "Εμφάνιση Όλων των Λεπτομερειών",
                usepercent: "Χρήση Ποσοστού",
                displaytime: "Χρόνος Εμφάνισης",
                scale: "Κλίμακα",
                customtext: "Προσαρμοσμένο Κείμενο",
                usegametitle: "Χρήση Τίτλου Παιχνιδιού",
                customfont: "Προσαρμοσμένη Γραμματοσειρά"
            }
        },
        sound: {
            title: "Ήχος",
            content: {
                soundmode: "Λειτουργία Ήχου",
                file: "Αρχείο",
                folder: "Τυχαίο",
                soundfile: "Αρχείο Ήχου",
                sounddir: "Φάκελος Ήχου",
                volume: "Ένταση"
            }
        },
        style: {
            title: "Στυλ",
            content: {
                bgstyle: "Στυλ Φόντου",
                solid: "Συμπαγές",
                gradient: "Διακύμανση",
                img: "Εικόνα",
                gameart: "Καλλιτεχνική Επιτυχία",
                gradientangle: "Γωνία Διακύμανσης",
                bgimg: "Εικόνα Φόντου",
                bgimgbrightness: "Φωτεινότητα",
                brightness: "Φωτεινότητα",
                blur: "Θάμβωση",
                roundness: "Γύρω Περιοχή",
                fontsize: "Μέγεθος Γραμματοσειράς",
                usecustomfontsizes: "Χρήση προσαρμοσμένων μεγεθών γραμματοσειράς",
                unlockmsgfontsize: "Μήνυμα Ξεκλειδώματος",
                titlefontsize: "Τίτλος",
                descfontsize: "Περιγραφή",
                opacity: "Διαφάνεια",
                bgonly: "Μόνο Φόντο",
                glow: "Λάμψη",
                glowcolor: "Χρώμα",
                glowsize: "Μέγεθος",
                glowx: "Οριζόντια Μετατόπιση",
                glowy: "Κατακόρυφη Μετατόπιση",
                glowopacity: "Αδιαφάνεια",
                glowanim: "Κινούμενα σχέδια",
                glowspeed: "Ταχύτητα",
                glowrarity: "Χρησιμοποίηση σπανιότητας",
                glowcolorbronze: "Σπανιότητα: > 50%",
                glowcolorsilver: "Σπανιότητα: < 50% & > $rarity",
                glowcolorgold: "Σπανιότητα: < $rarity",
                off: "Κανένα",
                pulse: "Παλμός",
                double: "Διπλό",
                focus: "Εστίαση",
                orbit: "Τροχιά",
                fluorescent: "Φωσφοριζέ",
                rainbow: "Ουράνιο τόξο",
                mask: "Μάσκα",
                maskimg: "Εικόνα μάσκας",
                outline: "Περίγραμμα",
                outlinecolor: "Χρώμα Περιγράμματος",
                outlinewidth: "Πλάτος Περιγράμματος",
                dashed: "Διακεκομμένο",
                dotted: "Τε dotted"
            }
        },
        colors: {
            title: "Χρώματα",
            content: {
                primarycolor: "Κύριο Χρώμα",
                secondarycolor: "Δευτερεύον Χρώμα",
                tertiarycolor: "Τριτεύον Χρώμα",
                iconshadowcolor: "Χρώμα σκιάς εικονιδίου σπάνιου",
                iconanimcolor: "Χρώμα animation εικονιδίου σπάνιου",
                fontcolor: "Χρώμα Γραμματοσειράς",
                usecustomfontcolors: "Χρήση Προσαρμοσμένων Χρωμάτων Γραμματοσειράς",
                unlockmsgfontcolor: "Χρώμα 1",
                titlefontcolor: "Χρώμα 2",
                descfontcolor: "Χρώμα 3",
                fontoutline: "Περίγραμμα Γραμματοσειράς",
                fontoutlinecolor: "Χρώμα Περιγράμματος Γραμματοσειράς",
                fontshadow: "Σκιά Γραμματοσειράς",
                fontshadowcolor: "Χρώμα Σκιάς Γραμματοσειράς"
            }
        },
        icons: {
            title: "Εικονίδια",
            content: {
                iconscale: "Κλίμακα εικονιδίου",
                iconroundness: "Γύρω Περιοχή Εικονιδίου",
                showiconborder: "Εμφάνιση Περιγράμματος Εικονιδίου",
                iconborderimg: "Περιγράμματα Εικονιδίου",
                iconborderpos: "Θέση Περιγράμματος",
                iconborderscale: "Κλίμακα Περιγράμματος",
                iconborderx: "Οριζόντια Απόκλιση",
                iconbordery: "Κατακόρυφη Απόκλιση",
                front: "Μπροστά",
                back: "Πίσω",
                plat: "Λογότυπο 100%",
                usegameicon: "Χρήση Εικονιδίου Παιχνιδιού",
                gameicontype: "Τύπος Εικονιδίου Παιχνιδιού",
                usecustomimgicon: "Χρήση Προσαρμοσμένου Εικονιδίου",
                customimgicon: "Προσαρμοσμένο Εικονίδιο",
                icon: "Εικονίδιο",
                logo: "Λογότυπο",
                logoscale: "Κλίμακα λογότυπου",
                decoration: "Διακόσμηση",
                decorationscale: "Κλίμακα διακόσμησης",
                showdecoration: "Εμφάνιση Διακόσμησης",
                rarity: "Σπανιότητα",
                showhiddenicon: "Εμφάνιση Κρυφού Εικονιδίου",
                hiddenicon: "Κρυφό Εικονίδιο",
                replacelogo: "Αντικατάσταση Λογότυπου"
            }
        },
        position: {
            title: "Θέση",
            content: {
                pos: "Θέση Οθόνης",
                usecustompos: "Χρήση Προσαρμοσμένης Θέσης",
                setcustompos: "Ορισμός",
                resetcustompos: "Επαναφορά"
            }
        },
        theme: {
            title: "Θέμα",
            content: {
                updatetheme: "Ενημέρωση Θέματος",
                savetheme: "Αποθήκευση Θέματος",
                sub: [
                    `Τα αποθηκευμένα <span class="hl">Θέματα Χρήστη</span> μπορούν να επιλεγούν από το μενού <span class="hl">Επιλογή Θέματος</span> στην Αρχική οθόνη.`,
                    `Βεβαιωθείτε ότι το <span class="hl">Όνομα του Θέματος</span> είναι <u>μοναδικό</u> - ένα όνομα που ταιριάζει με ένα υπάρχον θέμα <u>θα αντικαταστήσει το προηγούμενο</u>!`
                ],
                placeholder: "Όνομα Θέματος",
                theme: "Θέμα",
                importtheme: "Εισαγωγή θέματος",
                import: "Εισαγωγή",
                importsub: [
                    `Εισαγωγή <span class="hl">αρχείου θέματος</span> δημιουργημένου από τον χρήστη`,
                    `<span class="hl">Τα εισαγόμενα θέματα</span> θα φορτωθούν αυτόματα μόλις εισαχθούν με επιτυχία και μπορούν να επιλεγούν από το μενού <span class="hl">Επιλογή θέματος</span>`,
                ],
                importidle: `Επιλέξτε ένα <span class="hl">αρχείο θέματος</span> για εισαγωγή`,
                importcopied: `Το θέμα αντιγράφηκε με επιτυχία`,
                importrenamed: `Το θέμα μετονομάστηκε με επιτυχία`,
                importextracted: `Το θέμα εξήχθη με επιτυχία`,
                importrewriting: `Αναδιαμόρφωση διαδρομών αρχείων θέματος...`,
                importconverting: `Μετατροπή θέματος...`,
                importcreating: `Δημιουργία θέματος...`,
                importdone: `Το θέμα εισήχθη με επιτυχία`,
                importfailed: `Σφάλμα κατά την εισαγωγή του επιλεγμένου αρχείου θέματος!`,
                exporttheme: "Εξαγωγή θέματος",
                export: "Εξαγωγή",
                exporterrortitle: "Σφάλμα Εξαγωγής",
                exporterrorsub: [
                    "Παρουσιάστηκε σφάλμα κατά την προσπάθεια εξαγωγής του επιλεγμένου θέματος",
                    `Δοκιμάστε να αποθηκεύσετε το τρέχον θέμα (<i>μέσω <span class="hl">Αποθήκευση Θέματος</span></i>) και δοκιμάστε να εξάγετε ξανά`,
                    `Αν το πρόβλημα συνεχίζεται, παρακαλώ αντιγράψτε το σφάλμα παρακάτω και αναφέρετε μέσω των κουμπιών συνδέσμου στην <span class="hl">Αρχική Οθόνη</span>`
                ],
                synctheme: "Συγχρονισμός θέματος",
                syncedwith: "Συγχρονισμένο με",
                themeselect: "Επιλεγμένο θέμα"
            }
        }
    },
    logwin: {
        content: {
            tagline: "Εδώ είναι τι έχει συμβεί από την εκκίνηση της εφαρμογής στις",
            copylog: "Αντιγραφή Περιεχομένου Καταγραφής"
        }
    },
    reset: {
        content: {
            sub: `
                <div class="wrapper" id="resetsub">
                    <span>Είστε σίγουρος;</span>
                    <span>Όλα τα προηγουμένως ρυθμισμένα δεδομένα, <u>συμπεριλαμβανομένων των Προσαρμογών</u>, θα επαναφερθούν στις προεπιλεγμένες ρυθμίσεις.</span>
                    <span>🛑 Αυτό δεν μπορεί να αναιρεθεί!</span>
                </div>
            `,
            reset: "Επαναφορά"
        }
    },
    error: {
        content: {
            subtitle: "Το Steam Achievement Notifier αντιμετώπισε ένα πρόβλημα και πρέπει να κλείσει.",
            details: "Εδώ είναι οι λεπτομέρειες του σφάλματος:",
            sub: "Κάντε κλικ στα παρακάτω κουμπιά για να αναφέρετε αυτό το πρόβλημα μέσω της προτιμώμενης πλατφόρμας σας.",
            report: "Αναφορά",
            log: "Καταγραφή Εφαρμογής",
            exit: "Έξοδος"
        }
    },    
    tooltips: {
        game: "Το παιχνίδι για το οποίο παρακολουθούνται επιτεύγματα αυτή τη στιγμή",
        usertheme: "Επιλέξτε ένα προηγουμένως αποθηκευμένο θέμα",
        customise: "Προσαρμογή ειδοποιήσεων επιτευγμάτων",
        test: "Εμφάνιση δοκιμαστικής ειδοποίησης, συμπεριλαμβανομένων τυχόν προσαρμογών",
        kofi: "Δωρεά στο Ko-Fi!",
        discord: "Εγγραφή στο Discord!",
        github: "Αναφορά προβλήματος",
        lang: "Επιλέξτε τη γλώσσα του περιβάλλοντος χρήσης που χρησιμοποιείται στην εφαρμογή",
        steamlang: `Προσπαθήστε να φορτώσετε μεταφράσεις που βρίσκονται στα αρχεία εφαρμογής του Steam για να εμφανίσετε τις πληροφορίες επιτευγμάτων στη γλώσσα που έχει επιλέξει ο χρήστης στον πελάτη Steam<br><br><span class="ttdesc">Αυτή η επιλογή προσπαθεί να βρει μεταφράσεις σε ένα αρχείο JSON αποθηκευμένο στα δεδομένα εφαρμογής του Steam. Εάν δεν μπορεί να βρεθεί μετάφραση για το τρέχον επίτευγμα, θα εμφανιστούν αντί αυτού οι πληροφορίες επιτεύγματος που έχουν ανακτηθεί από το Steamworks.</span>`,
        maxsteamlangretries: `Ο αριθμός των προσπαθειών (κάθε 100 ms) για την εύρεση έγκυρων μεταφράσεων για το τρέχον επίτευγμα<br><br><span class="ttdesc">Το Steam αποθηκεύει αυτή τη στιγμή μόνο μια μικρή ποσότητα δεδομένων επιτευγμάτων στο αρχείο JSON που σχετίζεται με κάθε παιχνίδι. Οποιαδήποτε επιτεύγματα δεν βρίσκονται σε αυτό το αρχείο θα προστεθούν αφού το επίτευγμα ξεκλειδωθεί.<br><br>Δεδομένου ότι η προσθήκη νέων δεδομένων μπορεί να πάρει χρόνο, η αύξηση αυτής της τιμής θα αυξήσει την πιθανότητα να βρεθούν δεδομένα μετάφρασης για το τρέχον επίτευγμα, αλλά μπορεί επίσης να καθυστερήσει την εμφάνιση της ειδοποίησης στην οθόνη κατά τη διάρκεια που υπολογίζεται από αυτή τη ρύθμιση.<br><br>Εάν δεν μπορούν να βρεθούν έγκυρα δεδομένα μετάφρασης για το τρέχον επίτευγμα, η μετάφραση θα επιστρέψει στη γλώσσα που έχει οριστεί στο Steamworks.</span>`,
        desktop: "Εναλλαγή συντόμευσης στην επιφάνεια εργασίας για να εκτελείται η εφαρμογή",
        startwin: "Εκκίνηση του Steam Achievement Notifier αυτόματα μετά την είσοδο",
        startmin: "Αφού ξεκινήσει, απόκρυψη του παραθύρου του περιβάλλοντος χρήσης της εφαρμογής μέχρι να ανοιχτεί από τη γραμμή κατάστασης του συστήματος",
        nohwa: `Απενεργοποίηση της υλικής επιτάχυνσης, η οποία μπορεί να βελτιώσει την απόδοση σε συστήματα με περιορισμένους πόρους ή συστήματα χωρίς αφιερωμένη GPU<br><br><span class="ttdesc">Η εφαρμογή θα επανεκκινήσει μετά την ενεργοποίηση/απενεργοποίηση αυτής της επιλογής</span>`,
        litemode: "Απενεργοποίηση όλων των διαδραστικών στοιχείων του περιβάλλοντος χρήσης, παρέχοντας μόνο περιορισμένη λειτουργικότητα της εφαρμογής μέσω του εικονιδίου της γραμμής κατάστασης του συστήματος. Μπορεί να βελτιώσει τους πόρους που καταναλώνονται από την εφαρμογή",
        rarity: "Το ποσοστό στο οποίο θα ενεργοποιούνται οι ειδοποιήσεις για σπάνια επιτεύγματα. Κάθε επίτευγμα με ποσοστό ξεκλειδώματος πάνω από αυτή την τιμή θα εμφανίζεται ως κύρια ειδοποίηση",
        showpercent: "Εμφάνιση του ποσοστού ξεκλειδώματος του επιτεύγματος στην ειδοποίηση για τους επιλεγμένους τύπους",
        soundonly: "Απενεργοποίηση των ειδοποιήσεων, αναπαραγωγή μόνο των ήχων που έχουν οριστεί μέσω του προσαρμογέα",
        extwin: "Δημιουργήστε ένα παράθυρο που αναπαράγει τυχόν ειδοποιήσεις που εμφανίζονται επί του παρόντος στην οθόνη. Αυτό το παράθυρο μπορεί στη συνέχεια να προστεθεί ως πηγή λήψης παραθύρου για χρήση σε λογισμικό ροής, όπως το OBS",
        extwinframerate: "Ορισμός του στόχου ρυθμού καρέ για ειδοποιήσεις ροής",
        extwinshow: `Εναλλαγή ορατότητας του παραθύρου Ειδοποιήσεων Ροής<br><br><span class="ttdesc">Όταν είναι ενεργό στη γραμμή εργασιών, πατήστε παρατεταμένα το πλήκτρο <code class="ttcode">Ctrl</code> για να εμφανίσετε την τρέχουσα τοποθεσία του παραθύρου</span>`,
        audiosrc: "Επιλέξτε την πηγή ήχου (ή απενεργοποιήστε) που δημιουργείται από την εφαρμογή",
        nowtracking: "Εμφάνιση ειδοποίησης που ενημερώνει τον χρήστη ότι παρακολουθούνται επιτεύγματα για ένα τρέχον παιχνίδι",
        nowtrackingscale: `Ορίστε το μέγεθος της ειδοποίησης παρακολούθησης`,
        nowtrackingpos: `Ορίστε τη θέση της ειδοποίησης καταγραφής`,
        shortcuts: "Ενεργοποίηση δοκιμαστικής ειδοποίησης μέσω συντόμευσης πληκτρολογίου. Οι συντομεύσεις μπορούν να προσαρμοστούν για κάθε τύπο ειδοποίησης",
        noiconcache: `Απενεργοποιεί την προσωρινή μνήμη εικονιδίων επιτευγμάτων κατά την εκκίνηση των παιχνιδιών.<br><br><span class="ttdesc">Αυτό μπορεί να βελτιώσει σημαντικά την απόδοση της εφαρμογής κατά την εκκίνηση των παιχνιδιών και μπορεί επίσης να λύσει προβλήματα παρακολούθησης με παιχνίδια που έχουν μεγάλο αριθμό επιτευγμάτων. Ωστόσο, σε σπάνιες περιπτώσεις, η απενεργοποίηση της προσωρινής μνήμης εικονιδίων μπορεί να οδηγήσει σε ελλείψεις εικονιδίων επιτευγμάτων στις ειδοποιήσεις</span>`,
        steamss: "Λήψη στιγμιότυπου Steam όταν ξεκλειδώνεται ένα επίτευγμα",
        screenshots: "Επιλέξτε τον τύπο Πρόσθετων Πολυμέσων που θα δημιουργηθεί όταν εμφανίζεται μια ειδοποίηση",
        monitors: "Ο οθονη που θα καταγραφεί κατά τη λήψη του στιγμιότυπου",
        hdrmode: `Λήψη στιγμιοτύπων οθόνης χρησιμοποιώντας μέθοδο συμβατή με οθόνες που χρησιμοποιούν Υψηλή Δυναμική Περιοχή (HDR)`,
        ovpos: "Η θέση της επικάλυψης της ειδοποίησης μέσα στο στιγμιότυπο",
        ovmatch: "Αντιστοίχιση της θέσης οθόνης που έχει οριστεί στον προσαρμογέα για αυτόν τον τύπο ειδοποίησης",
        ovpath: "Η τοποθεσία όπου θα αποθηκεύονται τα στιγμιότυπα που δημιουργούνται από αυτήν την επιλογή",
        ssdelay: "Προσθήκη καθυστέρησης από τη στιγμή που εμφανίζεται η ειδοποίηση μέχρι τη λήψη του στιγμιότυπου",
        sspreview: "Εμφάνιση προεπισκόπησης του πώς θα εμφανιστεί το στιγμιότυπο όταν αποθηκευτεί",
        noanim: "Απενεργοποίηση όλων των κινήσεων παραθύρου και εφέ μετάβασης της εφαρμογής",
        noupdatedialog: `Αποτρέπει την αυτόματη εμφάνιση και εστίαση του διαλόγου <span class="hl">Διαθέσιμη Ενημέρωση</span><br><br><span class="ttdesc">Ο διάλογος μπορεί να ανοίξει ακόμα κάνοντας κλικ στο κουμπί ενημέρωσης, όταν είναι διαθέσιμος</span>`,
        nvda: "Ενεργοποίηση αντιγραφής πληροφοριών επιτεύγματος στο πρόχειρο όταν ξεκλειδώνεται ένα επίτευγμα, για να μπορεί να διαβαστεί από λογισμικό ανάγνωσης οθόνης, όπως το NVDA",
        tooltips: "Εμφάνιση εργαλειοθηκών όταν τοποθετείτε το ποντίκι πάνω από ορισμένα στοιχεία του περιβάλλοντος χρήσης",
        colorprofile: `Αναγκάζει όλα τα παράθυρα της εφαρμογής να χρησιμοποιούν το επιλεγμένο προφίλ χρώματος<br><br><span class="ttdesc">Απαιτεί επανεκκίνηση της εφαρμογής</span>`,
        pollrate: `Ορίστε το διάστημα ενημέρωσης για τα δεδομένα επίτευξης κατά τη διάρκεια του παιχνιδιού<br><br><span class="ttdesc">Η απόδοση μπορεί να αυξηθεί/μειωθεί ανάλογα με την τιμή ή το υλικό του συστήματος. Οι υψηλότερες τιμές συνήθως οδηγούν σε χαμηλότερο φόρτο συστήματος, αλλά μπορεί να προκαλέσουν καθυστερήσεις στις ειδοποιήσεις</span>`,
        initdelay: `Ορίστε την καθυστέρηση μεταξύ της ανίχνευσης του τρέχοντος <span class="hl">AppID</span> και της έναρξης της παρακολούθησης διεργασιών/κατορθωμάτων<br><br><span class="ttdesc">Η αύξηση αυτής της τιμής μπορεί να αποτρέψει σενάρια όπου το Steam δεν μπορεί να ξεκινήσει το τρέχον παιχνίδι (λόγω της εκκίνησης της εφαρμογής στο Steamworks πριν την έναρξη του παιχνιδιού)</span><br><br><span class="ttdesc">Εναλλακτικά, η αύξηση αυτής της τιμής μπορεί επίσης να χρησιμοποιηθεί για την παράκαμψη εσφαλμένης ανίχνευσης προεκκίνησης διεργασιών</span>`,
        releasedelay: `Ορίζει πόσο καιρό περιμένει η διεργασία φόντου να επανεκκινήσει μετά την κυκλοφορία του τρέχοντος παιχνιδιού. Επηρεάζει τόσο την αυτόματη παρακολούθηση της διαδικασίας όσο και τα παιχνίδια που έχουν συνδεθεί χειροκίνητα.<br><br><span class="ttdesc">Επιτρέπει έναν μεγαλύτερο χρονικό πλαίσιο για την πλήρη απελευθέρωση του Steamworks από την εφαρμογή. Η αύξηση αυτής της τιμής μπορεί να αποτρέψει την ανώμαλη συμπεριφορά, όπως η παρακολούθηση ενός προηγουμένως κλειστού παιχνιδιού</span>`,
        maxretries: `Ορίζει το μέγιστο αριθμό προσπαθειών για να συνδέσετε μια τρέχουσα διαδικασία με ένα εντοπισμένο AppID. Επηρεάζει τόσο την αυτόματη παρακολούθηση της διαδικασίας όσο και τα παιχνίδια που έχουν συνδεθεί χειροκίνητα.<br><br><span class="ttdesc">Οι προσπάθειες σύνδεσης πραγματοποιούνται μία φορά κάθε δευτερόλεπτο. Εάν μια τρέχουσα διαδικασία δεν συνδέεται με το τρέχον AppID μετά από αυτόν τον αριθμό προσπαθειών, θα επιστραφεί μια μη έγκυρη διαδικασία. Σε τέτοιες περιπτώσεις, το παιχνίδι θα πρέπει να ελευθερωθεί χειροκίνητα μέσω της Περιοχής Ειδοποιήσεων του Συστήματος > Επιλογές > Απελευθέρωση Παιχνιδιού</span>`,
        debug: "Ανοίξτε τον Πίνακα Αποσφαλμάτωσης, ο οποίος εμφανίζει λεπτομερείς πληροφορίες παρακολούθησης διεργασιών",
        userust: "Χρησιμοποιήστε μια εναλλακτική λειτουργία βασισμένη σε Rust για να ελέγξετε εάν τα παρακολουθούμενα παιχνιδιακά διεργασίες εκτελούνται αυτή τη στιγμή στο σύστημα. Όταν δεν είναι επιλεγμένο, θα χρησιμοποιηθεί αντ' αυτού ο προεπιλεγμένος έλεγχος διεργασιών βασισμένος σε NodeJS.",
        notifydebug: "Δημιουργία παραθύρου DevTools για όλες τις ειδοποιήσεις. Χρήσιμο για αποσφαλμάτωση/επίλυση προβλημάτων ειδοποιήσεων",
        usecustomfiles: "Ενεργοποίηση φόρτωσης προσαρμοσμένων αρχείων ειδοποιήσεων από τον χρήστη. Συνιστάται προσοχή για τους κανονικούς χρήστες",
        showcustomfiles: "Άνοιγμα της τοποθεσίας των προσαρμοσμένων αρχείων",
        log: "Άνοιγμα του παραθύρου καταγραφής εφαρμογής, το οποίο εμφανίζει πληροφορίες σχετικά με τη δραστηριότητα της διεργασίας, προειδοποιήσεις και σφάλματα",
        reset: "Αφαιρεί όλα τα δεδομένα ρύθμισης και επανεκκινεί την εφαρμογή",
        playback: "Παύση/συνέχιση της αναπαραγωγής της προεπισκόπησης της ειδοποίησης",
        replay: "Επανεκκίνηση της αναπαραγωγής της προεπισκόπησης της ειδοποίησης",
        preset: "Επιλογή του προκαθορισμένου προσαρμογέα ειδοποίησης",
        iconanim: "Εναλλαγή του περιγράμματος και της κινούμενης εικόνας του σπάνιου εικονιδίου",
        alldetails: "Εμφάνιση όλων των κειμένων στοιχείων μέσα στην ειδοποίηση, συμπεριλαμβανομένων αυτών που είναι κρυμμένα από προεπιλογή για αυτόν τον προσαρμογέα",
        usepercent: "Εμφάνιση του ποσοστού ξεκλειδώματος της επίτευξης, αντί της τιμής XP/S",
        displaytime: "Ορισμός του αριθμού των δευτερολέπτων που θα εμφανίζεται η ειδοποίηση",
        scale: "Αύξηση ή μείωση του μεγέθους της ειδοποίησης",
        customtext: "Ορισμός ενός προσαρμοσμένου μηνύματος που θα εμφανίζεται μέσα στην ειδοποίηση",
        usegametitle: "Εμφάνιση του τίτλου του τρέχοντος παιχνιδιού μέσα στην ειδοποίηση",
        customfont: "Φόρτωση ενός προσαρμοσμένου γραμματοσειράς που θα χρησιμοποιείται μέσα στην ειδοποίηση",
        soundmode: "Επιλογή είτε ενός μόνο ηχητικού αρχείου, είτε ενός τυχαία επιλεγμένου ηχητικού αρχείου από έναν φάκελο που περιέχει πολλά ηχητικά αρχεία, όταν συμβαίνει μια ειδοποίηση",
        soundfile: "Επιλογή ενός ηχητικού αρχείου που θα αναπαραχθεί όταν συμβεί μια ειδοποίηση",
        sounddir: "Επιλογή ενός φακέλου από τον οποίο θα επιλεγεί τυχαία ένα ηχητικό αρχείο όταν συμβαίνει μια ειδοποίηση",
        volume: "Ορισμός της έντασης αναπαραγωγής του ηχητικού αρχείου",
        preview: "Προεπισκόπηση του επιλεγμένου ηχητικού αρχείου ή ενός ηχητικού αρχείου που επιλέγεται τυχαία από τον φάκελο",
        bgstyle: "Επιλογή του στυλ για το φόντο της ειδοποίησης",
        gradientangle: "Ορισμός της γωνίας του γραδιού",
        bgimg: "Φόρτωση ενός εικονιδίου αρχείου που θα χρησιμοποιηθεί ως φόντο της ειδοποίησης",
        bgimgbrightness: "Ορίστε τη φωτεινότητα της εικόνας που χρησιμοποιείται ως φόντο για την ειδοποίηση",
        brightness: "Ορισμός της φωτεινότητας της εικόνας του παιχνιδιού που χρησιμοποιείται ως φόντο της ειδοποίησης",
        blur: "Ορίστε το επίπεδο θόλωσης που εφαρμόζεται στο φόντο της ειδοποίησης",
        roundness: "Ορισμός της στρογγυλότητας των άκρων της ειδοποίησης",
        fontsize: "Ορισμός του μεγέθους της γραμματοσειράς που χρησιμοποιείται στην ειδοποίηση",
        opacity: "Ορισμός της συνολικής διαφάνειας της ειδοποίησης",
        bgonly: "Ορισμός μόνο της διαφάνειας για το φόντο της ειδοποίησης, κρατώντας τα άλλα στοιχεία στην πλήρη διαφάνεια",
        glow: "Ενεργοποιήστε ένα εφέ λάμψης που περιβάλλει την ειδοποίηση",
        glowcolor: "Ορίστε το χρώμα του εφέ λάμψης",
        glowsize: "Ορίστε το μέγεθος του εφέ λάμψης",
        glowx: "Μετακινήστε οριζόντια τη θέση του εφέ φωτεινότητας",
        glowy: "Μετακινήστε κατακόρυφα τη θέση του εφέ φωτεινότητας",
        glowopacity: "Ορίστε την αδιαφάνεια του εφέ φωτεινότητας",
        glowanim: "Επιλέξτε μια προκαθορισμένη κινούμενη εικόνα που θα εφαρμοστεί στο εφέ λάμψης",
        glowspeed: "Ορίστε την ταχύτητα της κινούμενης εικόνας που εφαρμόζεται στο εφέ λάμψης",
        glowrarity: "Αλλάζει το χρώμα του εφέ λάμψης με βάση τη σπανιότητα της ξεκλείδωτης επίτευξης",
        glowcolorbronze: "Το χρώμα της λάμψης όταν το ποσοστό ξεκλειδώματος είναι > 50%",
        glowcolorsilver: "Το χρώμα της λάμψης όταν το ποσοστό ξεκλειδώματος είναι < 50% και > $rarity",
        glowcolorgold: "Το χρώμα της λάμψης όταν το ποσοστό ξεκλειδώματος είναι < $rarity",
        mask: "Ενεργοποιήστε τη μάσκαρα τμημάτων της ειδοποίησης με ένα προσαρμοσμένο εικονίδιο",
        maskimg: `Φορτώστε ένα αρχείο εικόνας που θα χρησιμοποιηθεί ως μάσκα<br><br><span class="ttdesc">Στο CSS, το <code class="ttcode">mask-mode: alpha</code> λειτουργεί με αντίθετο τρόπο από αυτό που αναμένεται συνήθως - οι περιοχές διαφάνειας στο αρχείο εικόνας θα είναι κρυμμένες, ενώ οι μαύρες/γκρι περιοχές θα επιτρέψουν στα στοιχεία κάτω από αυτές να είναι ορατά</span>`,
        outline: "Επιλέξτε τον τύπο περιγράμματος που θα εμφανίζεται γύρω από την ειδοποίηση",
        outlinecolor: "Ορίστε το χρώμα του περιγράμματος γύρω από την ειδοποίηση",
        outlinewidth: "Ορίστε το πλάτος του περιγράμματος γύρω από την ειδοποίηση",
        primarycolor: "Ορισμός του πρωτεύοντος χρώματος της ειδοποίησης",
        secondarycolor: "Ορισμός του δευτερεύοντος χρώματος της ειδοποίησης",
        tertiarycolor: "Ορισμός του τριτοβάθμιου χρώματος της ειδοποίησης",
        fontcolor: "Ορισμός του χρώματος όλων των κειμένων που εμφανίζονται μέσα στην ειδοποίηση",
        fontoutline: "Προσθήκη περίγραμματος σε όλα τα κείμενα που εμφανίζονται μέσα στην ειδοποίηση",
        fontoutlinecolor: "Ορισμός του χρώματος του περιγράμματος του κειμένου",
        fontshadow: "Προσθήκη σκιάς σε όλα τα κείμενα που εμφανίζονται μέσα στην ειδοποίηση",
        fontshadowcolor: "Ορισμός του χρώματος της σκιάς του κειμένου",
        iconroundness: "Ορισμός της στρογγυλότητας του εικονιδίου επιτεύγματος/παιχνιδιού που εμφανίζεται μέσα στην ειδοποίηση",
        plat: "Φόρτωση εικονιδίου αρχείου που θα χρησιμοποιηθεί ως εικονίδιο 100%",
        usegameicon: "Αντικατάσταση του εικονιδίου της ξεκλείδωτης επίτευξης με το εικονίδιο του τρέχοντος παιχνιδιού",
        gameicontype: `Επιλέξτε ποιον τύπο εικόνας να εμφανίζεται ως Εικονίδιο Παιχνιδιού`,
        usecustomimgicon: "Αντικατάσταση του εικονιδίου της ξεκλείδωτης επίτευξης με ένα προσαρμοσμένο αρχείο εικόνας",
        customimgicon: "Φόρτωση ενός αρχείου εικόνας για χρήση ως Προσαρμοσμένο Εικονίδιο",
        showhiddenicon: "Εμφάνιση μιας εικόνας που υποδηλώνει ότι η επίτευξη είναι κρυφή στην ειδοποίηση",
        hiddenicon: "Φόρτωση ενός αρχείου εικόνας για να αντικαταστήσετε το κρυφό εικονίδιο επίτευξης",
        logo: "Φόρτωση εικονιδίου αρχείου για αντικατάσταση του εικονιδίου του λογότυπου",
        decoration: "Φόρτωση εικονιδίου αρχείου για αντικατάσταση του εικονιδίου της διακόσμησης",
        showdecoration: "Εναλλαγή της ορατότητας του εικονιδίου της διακόσμησης",
        replacelogo: "Αντικαταστήστε το εικονίδιο του λογότυπου στην ειδοποίηση με την επιλεγμένη διακόσμηση",
        pos: "Ορισμός της θέσης της ειδοποίησης στην οθόνη",
        usecustompos: "Ενεργοποίηση προσαρμοσμένης θέσης για την ειδοποίηση",
        setcustompos: "Ορισμός της προσαρμοσμένης θέσης για την ειδοποίηση",
        resetcustompos: "Επαναφορά της θέσης της ειδοποίησης στην προεπιλεγμένη προσαρμοσμένη θέση",
        updatetheme: "Ενημέρωση του τρέχοντος θέματος με τις επιλεγμένες επιλογές προσαρμογής",
        savetheme: "Αποθήκευση όλων των προσαρμοσμένων επιλογών προσαρμογής ως νέο θέμα",
        visibilitybtn: "Εναλλαγή της ορατότητας του στοιχείου σε προεπισκοπήσεις προσαρμογέα και δοκιμαστικές ειδοποιήσεις",
        delbtn: "Επαναφορά του στοιχείου στην προεπιλογή",
        imgpath: "Η τοποθεσία όπου θα αποθηκευτούν οι εικόνες ειδοποιήσεων που δημιουργήθηκαν από αυτήν την επιλογή",
        ssenabled: "Ενεργοποίηση ή απενεργοποίηση της δημιουργίας μέσων για αυτόν τον τύπο",
        checkforupdates: `Ελέγξτε εάν έχει κυκλοφορήσει νέα έκδοση της εφαρμογής στο GitHub. Αν υπάρχει διαθέσιμη ενημέρωση, θα κατεβεί και θα εγκατασταθεί αυτόματα μόλις επιβεβαιωθεί μέσω του παραθύρου διαλόγου <span class="hl">Διαθέσιμη Ενημέρωση</span>`,
        linkedgames: `Παράκαμψη της <span class="hl">αυτόματης παρακολούθησης διεργασιών</span> για συγκεκριμένα παιχνίδια Steam<br><br><span class="ttdesc">Αυτή η επιλογή πρέπει να χρησιμοποιείται μόνο σε πολύ συγκεκριμένες περιπτώσεις. Οι χρήστες δεν θα πρέπει να χρειάζεται να χρησιμοποιούν αυτή την επιλογή υπό κανονικές συνθήκες!</span>`,
        exclusionlist: `Αποτροπή του παρακολούθησης επιτευγμάτων σε συγκεκριμένα παιχνίδια Steam από την εφαρμογή<br><br><span class="ttdesc">Αυτή η επιλογή πρέπει να χρησιμοποιείται μόνο σε πολύ συγκεκριμένες περιπτώσεις. Οι χρήστες δεν θα πρέπει να χρειάζεται να χρησιμοποιούν αυτή την επιλογή υπό κανονικές συνθήκες!</span>`,
        ovx: "Μετακινήστε την ειδοποίηση που εμφανίζεται στο στιγμιότυπο οθόνης οριζόντια",
        ovy: "Μετακινήστε την ειδοποίηση που εμφανίζεται στο στιγμιότυπο οθόνης κάθετα",
        importtheme: `Εισαγάγετε προσαρμογές μέσω ενός <span class="hl">αρχείου θέματος</span> δημιουργημένου από τον χρήστη`,
        exporttheme: `Εξαγάγετε το τρέχον επιλεγμένο <span class="hl">θέμα</span> για κοινή χρήση<br><br><span class="ttdesc">Πριν προσπαθήσετε να εξαγάγετε, παρακαλούμε βεβαιωθείτε ότι το επιθυμητό <span class="hl">θέμα</span> έχει επιλεγεί (μέσω του μενού <span class="hl">Επιλογή θέματος</span>). Επίσης, βεβαιωθείτε ότι οι προσαρμογές έχουν αποθηκευτεί στο επιλεγμένο <span class="hl">θέμα</span> (μέσω του μενού <span class="hl">Αποθήκευση θέματος</span>)<br><br><u>Οποιεσδήποτε προσαρμογές που δεν έχουν αποθηκευτεί στο τρέχον <span class="hl">θέμα</span> δεν θα εξαχθούν!</u></span>`,
        webhooks: "Χρησιμοποιήστε μια URL Webhook για να δημοσιεύσετε σε έναν διακομιστή Discord κάθε φορά που ξεκλειδώσετε ένα επίτευγμα",
        webhookmain: `Εναλλαγή για το αν οι πληροφορίες επιτευγμάτων πρέπει να αποστέλλονται σε διακομιστή Discord όταν ξεκλειδωθεί ένα κύριο επίτευγμα`,
        webhookrare: "Εναλλαγή για το αν οι πληροφορίες επιτευγμάτων πρέπει να αποστέλλονται σε διακομιστή Discord όταν ξεκλειδωθεί ένα σπάνιο επίτευγμα",
        webhookplat: "Εναλλαγή για το αν οι πληροφορίες επιτευγμάτων πρέπει να αποστέλλονται σε διακομιστή Discord όταν ξεκλειδωθεί ένα επίτευγμα 100%",
        webhooktest: "Εναλλαγή για το αν θα αποστέλλονται πληροφορίες δοκιμής σε διακομιστή Discord όταν ενεργοποιούνται ειδοποιήσεις δοκιμής οποιουδήποτε τύπου",
        webhookurl: `Ορίστε την <span class="hl">URL Webhook</span> για τον επιθυμητό διακομιστή Discord<br><br><span class="ttdesc">Μια <span class="hl">URL Webhook</span> χρησιμοποιείται για να δημοσιεύσει σε έναν διακομιστή/κανάλι Discord εκ μέρους ενός χρήστη ή εφαρμογής. Για να ρυθμίσετε ένα νέο Webhook για έναν διακομιστή Discord, ο χρήστης πρέπει να έχει έναν ρόλο στον επιθυμητό διακομιστή που επιτρέπει τη δημιουργία Webhooks<br><br><u>Μια URL Webhook απαιτείται όταν χρησιμοποιείτε αυτήν την επιλογή</u><br><br>Δείτε την επίσημη τεκμηρίωση του Discord για περισσότερες πληροφορίες</span>`,
        webhookspoilers: `Προσθήκη ετικέτας spoiler σε "Κρυφά" επιτεύγματα όταν αναρτώνται στο Discord`,
        unlockmsg: "Ορίστε τη θέση του μηνύματος ξεκλειδώματος/προσαρμοσμένου κειμένου μέσα στο $type",
        title: "Ορίστε τη θέση του τίτλου επιτεύγματος μέσα στο $type",
        desc: "Ορίστε τη θέση της περιγραφής επιτεύγματος μέσα στο $type",
        notification: "ειδοποίηση",
        screenshot: "σcreenshot",
        percentpos: "Ορίστε τη θέση του ποσοστού σπανιότητας μέσα στο $type",
        sspercentpos: "Ορίστε τη θέση του ποσοστού σπανιότητας μέσα στο $type",
        hiddeniconpos: "Ορίστε τη θέση του κρυφού/μυστικού εικονιδίου επιτεύγματος μέσα στο $type",
        sshiddeniconpos: "Ορίστε τη θέση του κρυφού/μυστικού εικονιδίου επιτεύγματος μέσα στο $type",
        decorationpos: "Ορίστε τη θέση του στοιχείου διακόσμησης μέσα στο $type",
        ssdecorationpos: "Ορίστε τη θέση του στοιχείου διακόσμησης μέσα στο $type",
        percentbadge: "Εμφάνιση του ποσοστού ξεκλειδώματος μέσα σε μια ετικέτα τοποθετημένη πάνω από το εικονίδιο της επίτευξης/παιχνιδιού",
        sspercentbadge: "Εμφάνιση του ποσοστού ξεκλειδώματος μέσα σε μια ετικέτα τοποθετημένη πάνω από το εικονίδιο της επίτευξης/παιχνιδιού",
        percentbadgepos: "Ρύθμιση της θέσης της ετικέτας",
        sspercentbadgepos: "Ρύθμιση της θέσης της ετικέτας",
        percentbadgefontcolor: "Ορίστε το χρώμα γραμματοσειράς του εμβλήματος",
        sspercentbadgefontcolor: "Ορίστε το χρώμα γραμματοσειράς του εμβλήματος",
        percentbadgecolor: "Ρύθμιση του χρώματος φόντου της ετικέτας",
        sspercentbadgecolor: "Ρύθμιση του χρώματος φόντου της ετικέτας",
        percentbadgefontsize: "Ρύθμιση του μεγέθους της ετικέτας",
        sspercentbadgefontsize: "Ρύθμιση του μεγέθους της ετικέτας",
        percentbadgeroundness: "Ρύθμιση της στρογγυλότητας της ετικέτας",
        sspercentbadgeroundness: "Ρύθμιση της στρογγυλότητας της ετικέτας",
        percentbadgex: "Μετατόπιση της θέσης του στοιχείου badge οριζόντια",
        sspercentbadgex: "Μετατόπιση της θέσης του στοιχείου badge οριζόντια",
        percentbadgey: "Μετατόπιση της θέσης του στοιχείου badge κάθετα",
        sspercentbadgey: "Μετατόπιση της θέσης του στοιχείου badge κάθετα",
        percentbadgeimg: "Εμφάνιση εικονιδίου βάσει σπανιότητας ως στοιχείο badge",
        sspercentbadgeimg: "Εμφάνιση εικονιδίου βάσει σπανιότητας ως στοιχείο badge",
        percentbadgeimgbronze: "Το εικονίδιο badge που θα εμφανιστεί όταν το ποσοστό ξεκλειδώματος είναι > 50%",
        sspercentbadgeimgbronze: "Το εικονίδιο badge που εμφανίζεται όταν το ποσοστό ξεκλειδώματος είναι > 50%",
        percentbadgeimgsilver: "Το εικονίδιο badge που εμφανίζεται όταν το ποσοστό ξεκλειδώματος είναι < 50% και > $rarity",
        sspercentbadgeimgsilver: "Το εικονίδιο badge που εμφανίζεται όταν το ποσοστό ξεκλειδώματος είναι < 50% και > $rarity",
        percentbadgeimggold: "Το εικονίδιο badge που εμφανίζεται όταν το ποσοστό ξεκλειδώματος είναι < $rarity",
        sspercentbadgeimggold: "Το εικονίδιο badge που εμφανίζεται όταν το ποσοστό ξεκλειδώματος είναι < $rarity",
        resetpbimgs: "Επαναφορά όλων των εικονιδίων badge στις προεπιλογές",
        elemsmatch: `Ταίριασμα με τις ρυθμίσεις στοιχείων ειδοποίησης που ορίζονται στον Customiser για αυτόν τον τύπο ειδοποίησης<br><br><span class="ttdesc">Ορισμένα προεπιλεγμένα προγράμματα ειδοποίησης δεν μπορούν να ταιριάξουν πλήρως τις ρυθμίσεις του Customiser, λόγω διαφορών μεταξύ των ρυθμίσεων ειδοποίησης που βασίζονται στην οθόνη και στη λήψη οθόνης</span>`,
        themeswitch: `Αυτόματη εναλλαγή σε οποιοδήποτε αποθηκευμένο <span class="hl">Θέμα</span> όταν ανιχνευτεί συγκεκριμένο παιχνίδι`,
        userthemesync: `Συγχρονισμός προσαρμογών στο επιλεγμένο <span class="hl">Θέμα</span> σε όλους τους άλλους τύπους ειδοποιήσεων`,
        showsystrayopts: `Εμφάνιση όλων των επιλογών που συνήθως βρίσκονται κάτω από <span class="hl">System Tray</span> > <span class="hl">Options</span> στις <span class="hl">Ρυθμίσεις</span> > <span class="hl">Διάφορα</span>`,
        releaseshortcut: "Απελευθερώστε το τρέχον παρακολουθούμενο παιχνίδι χρησιμοποιώντας την καθορισμένη συντόμευση πληκτρολογίου",
        themeselect: "Επιλέξτε ένα προεπιλεγμένο Θέμα",
        statwin: `Εμφάνιση παραμετροποιήσιμων στατιστικών επιτευγμάτων για το τρέχον παιχνίδι σε εξωτερικό παράθυρο<br><br><span class="ttdesc">Όταν χρησιμοποιείται σε συνδυασμό με την επιλογή <span class="hl">Μετατροπή Επιτευγμάτων στη Γλώσσα του Steam</span>, ορισμένες μεταφράσεις ενδέχεται να μην είναι διαθέσιμες μέχρι να ξεκλειδώσει το συγκεκριμένο επίτευγμα</span>`,
        statwinaot: `Ορίστε την Επικάλυψη Στατιστικών Επιτευγμάτων σε λειτουργία "Πάντα στην κορυφή", επιτρέποντας στο παράθυρο να εμφανίζεται πάνω από το παράθυρο του παιχνιδιού<br><br><span class="ttdesc">Όταν είναι ενεργοποιημένο, το παράθυρο των Στατιστικών Επιτευγμάτων δεν θα καταγράφει πλέον τις αλληλεπιδράσεις του χρήστη, όπως τα γεγονότα "κλικ". Για να επανενεργοποιήσετε την αλληλεπίδραση με το παράθυρο, αυτή η επιλογή πρέπει να απενεργοποιηθεί</span>`,
        statwinshortcut: "Εναλλαγή της Επικάλυψης Στατιστικών Επιτευγμάτων χρησιμοποιώντας την καθορισμένη συντόμευση πληκτρολογίου",
        ssdisplay: "Εμφάνιση προεπισκόπησης της αποθηκευμένης εικόνας στην ειδοποίηση",
        iconscale: "Μεγέθυνση ή σμίκρυνση του μεγέθους του εικονιδίου επίτευξης",
        showiconborder: "Εμφάνιση μιας εικόνας ως περίγραμμα γύρω από το εικονίδιο του επιτεύγματος",
        iconborderimg: "Φόρτωση αρχείου εικόνας για χρήση ως περίγραμμα γύρω από το εικονίδιο του επιτεύγματος",
        iconborderpos: "Ορίστε αν το περίγραμμα του εικονιδίου θα εμφανίζεται μπροστά ή πίσω από το εικονίδιο του επιτεύγματος",
        iconborderscale: "Αυξήστε ή μειώστε το μέγεθος του περιγράμματος του εικονιδίου στην ειδοποίηση",
        iconborderx: "Αυξήστε ή μειώστε την οριζόντια απόκλιση του περιγράμματος του εικονιδίου στην ειδοποίηση",
        iconbordery: "Αυξήστε ή μειώστε την κατακόρυφη απόκλιση του περιγράμματος του εικονιδίου στην ειδοποίηση",
        iconshadowcolor: "Ορισμός του χρώματος της σκιάς γύρω από το εικονίδιο της επίτευξης όταν ξεκλειδώνεται μια σπάνια επίτευξη",
        iconanimcolor: "Ορισμός του χρώματος του εφέ animation πίσω από το εικονίδιο της επίτευξης όταν ξεκλειδώνεται μια σπάνια επίτευξη",
        logoscale: "Μεγέθυνση ή σμίκρυνση του μεγέθους του στοιχείου λογότυπου στην ειδοποίηση",
        decorationscale: "Μεγέθυνση ή σμίκρυνση του μεγέθους του στοιχείου διακόσμησης στην ειδοποίηση",
        usecustomfontsizes: `Μεγέθυνση ή σμίκρυνση μεμονωμένων στοιχείων κειμένου στην ειδοποίηση<br><br><span class="ttdesc">Η διατήρηση της αρχικής διάταξης της ειδοποίησης δεν μπορεί να εγγυηθείται όταν αλλάζετε τις μεμονωμένες τιμές μεγέθους γραμματοσειράς</span>`,
        unlockmsgfontsize: "Μεγέθυνση ή σμίκρυνση του μεγέθους του κειμένου του μηνύματος ξεκλειδώματος",
        titlefontsize: "Μεγέθυνση ή σμίκρυνση του μεγέθους του κειμένου του τίτλου της επίτευξης",
        descfontsize: "Μεγέθυνση ή σμίκρυνση του μεγέθους του κειμένου της περιγραφής της επίτευξης",
        webhookembedcolormain: "Ορισμός του χρώματος που χρησιμοποιείται στην ενσωμάτωση webhook όταν ξεκλειδώνεται μια κύρια επίτευξη",
        webhookembedcolorrare: "Ορισμός του χρώματος που χρησιμοποιείται στην ενσωμάτωση webhook όταν ξεκλειδώνεται μια σπάνια επίτευξη",
        webhookembedcolorplat: "Ορισμός του χρώματος που χρησιμοποιείται στην ενσωμάτωση webhook όταν ξεκλειδώνεται μια 100% επίτευξη",
        raemus: "Εμφάνιση ειδοποιήσεων όταν εντοπίζονται παιχνίδια σε υποστηριζόμενους εξομοιωτές",
        rauser: "Ορίστε το όνομα χρήστη Retro Achievements για να παρακολουθείτε τις επιτυχίες",
        rakey: `Ορίστε το Web API Key που θα χρησιμοποιηθεί για την αυθεντικοποίηση στην API του Retro Achievements<br><br><span class="ttdesc">Ένα Web API Key μπορεί να αντιγραφεί ή να αναγεννηθεί συνδεόμενοι στον ιστότοπο του Retro Achievements και πηγαίνοντας στην ενότητα <span class="hl">Ρυθμίσεις > Κλειδιά > Web API Key</span><br><br>🔒 Το παρεχόμενο κλειδί θα κρυπτογραφηθεί πριν αποθηκευτεί τοπικά στο σύστημα</span>`,
        rapercenttype: "Ορίστε αν θέλετε να εμφανίζεται το ποσοστό επιτυχιών Hardcore ή Softcore στις ειδοποιήσεις",
        retroarch: `Εμφάνιση ειδοποιήσεων Retro Achievements για παιχνίδια που εξομοιώνονται μέσω του RetroArch<br><br><span class="ttdesc"><span class="hl">RetroArch > Ρυθμίσεις > Καταγραφή</span> πρέπει να έχει ρυθμιστεί με τις εξής ρυθμίσεις:<br><br><ul><li><span class="hllb">Λεπτομέρεια Καταγραφής</span>: <span class="hlgreen">ΕΝΕΡΓΟ</span></li><li><span class="hllb">Επίπεδο Καταγραφής Στο Πρόσθιο Μέρος</span>: <span class="hlgreen">1 (Πληροφορίες)</span></li><li><span class="hllb">Καταγραφή σε Αρχείο</span>: <span class="hlgreen">ΕΝΕΡΓΟ</span></li><li><span class="hllb">Χρονοσήμανση Αρχείων Καταγραφής</span>: <span class="hlred">ΑΝΕΝΕΡΓΟ</span></li></ul></span>`,
        dolphin: `Εμφάνιση ειδοποιήσεων Retro Achievements για παιχνίδια που εξομοιώνονται μέσω του Dolphin<br><br><span class="ttdesc"><span class="hl">Dolphin > Προβολή > Εμφάνιση Ρυθμίσεων Καταγραφής</span> πρέπει να έχει ρυθμιστεί με τις εξής ρυθμίσεις:<br><br><ul><li><span class="hllb">Λεπτομέρεια</span>: <span class="hlgreen">Πληροφορίες</span></li><li><span class="hllb">Έξοδοι Καταγραφής</span> > <span class="hlgreen">Γράψε σε Αρχείο</span></li><li><span class="hllb">Τύποι Καταγραφής</span> > <span class="hlgreen">Επιτεύγματα (RetroAchievements)</span></li></ul></span>`,
        retroarchpath: `Ορίστε τη διαδρομή για το <span class="hl">"retroarch.log"</span> αρχείο καταγραφής του RetroArch<br><br><span class="ttdesc">Με τις προεπιλεγμένες ρυθμίσεις εγκατάστασης, το <span class="hl">"retroarch.log"</span> αποθηκεύεται στο <span class="hllb">C:\\RetroArch-x64\\Logs</span></span>`,
        dolphinpath: `Ορίστε τη διαδρομή για το <span class="hl">"dolphin.log"</span> αρχείο καταγραφής του Dolphin<br><br><span class="ttdesc">Με τις προεπιλεγμένες ρυθμίσεις εγκατάστασης, το <span class="hl">"dolphin.log"</span> αποθηκεύεται σε μία από τις εξής τοποθεσίες:<br><br><ul><li><span class="hllb">%APPDATA%\\Dolphin Emulator\\Logs</span></li><li><span class="hllb">%USERPROFILE%\\Documents\\Dolphin Emulator\\Logs</span></li><li>🐧 <span class="hllb">$XDG_DATA_HOME/dolphin-emu/Logs</span></li></ul></span>`,
        usecustomfontcolors: "Ορίστε το χρώμα των στοιχείων κειμένου στην ειδοποίηση ξεχωριστά",
        unlockmsgfontcolor: "Ορίστε το χρώμα του πρώτου στοιχείου κειμένου",
        titlefontcolor: "Ορίστε το χρώμα του δεύτερου στοιχείου κειμένου",
        descfontcolor: "Ορίστε το χρώμα του τρίτου στοιχείου κειμένου",
        exportachdata: `Εξαγωγή δεδομένων επιτευγμάτων σε αρχείο JSON όταν ένα επίτευγμα ξεκλειδωθεί<br><br><span class="ttdesc">Όταν είναι ενεργοποιημένο, το <span class="ttcode">achdata.json</span> θα εξαχθεί στο εξής:<br><br><ul><li><span class="hllb">%localappdata\\Steam Achievement Notifier (V1.9)</span></li><li>🐧 <span class="hllb">~/.local/share/Steam Achievement Notifier (V1.9)</span></li></ul></span>`
    },
    update: {
        updateavailable: "Διαθέσιμη ενημέρωση",
        sub: [
            `<span id="newversion"></span>`,
            "Υπάρχει διαθέσιμη μια νέα ενημέρωση για το Steam Achievement Notifier!",
            `Ολόκληρες Σημειώσεις Έκδοσης διαθέσιμες στο <span id="discordreleasenotes"></span> και <span id="githubreleasenotes"></span>`
        ],
        update: "Ενημέρωση"
    },
    linkgame: {
        content: {
            exepath: "Διαδρομή εκτελέσιμου αρχείου",
            managesub: [
                `Συνδέστε χειροκίνητα το <span class="hl">εκτελέσιμο αρχείο</span> ενός παιχνιδιού σε ένα συγκεκριμένο <span class="hl">AppID</span>, ή <span class="hl">αποσυνδέστε</span> ένα υπάρχον`,
                `Το Steam Achievement Notifier δεν θα χρησιμοποιεί πλέον <span class="hl">αυτόματη παρακολούθηση διεργασιών</span> για κανένα από τα <span class="hl">συνδεδεμένα παιχνίδια</span> - αντ' αυτού, το καθορισμένο <span class="hl">εκτελέσιμο αρχείο</span> θα παρακολουθείται κάθε φορά που ανιχνεύεται το σχετικό <span class="hl">AppID</span>`,
                `<span class="hl" id="appidhelp"><u>Πώς μπορώ να βρω το AppID ενός παιχνιδιού στο Steam;</u></span>`
            ],
            linknew: "Νέο συνδεδεμένο παιχνίδι",
            linknewsub: [
                `Δημιουργήστε μια νέα σύνδεση μεταξύ ενός <span class="hl">εκτελέσιμου αρχείου παιχνιδιού</span> και του σχετικού <span class="hl">AppID</span>`,
                `Μόλις δημιουργηθούν, οι συνδέσεις μπορούν να <span class="hl">αποσυνδεθούν</span> μέσω του προηγούμενου διαλόγου <span class="hl">Διαχείριση συνδεδεμένων παιχνιδιών</span>`
            ],
            link: "Σύνδεση",
        }
    },
    exclusions: {
        content: {
            managesub: [
                `Προσθέστε την <span class="hl">AppID</span> οποιουδήποτε παιχνιδιού Steam στη <span class="hl">λίστα αποκλεισμού</span>`,
                `Το Steam Achievement Notifier δεν θα προσπαθήσει να παρακολουθήσει δεδομένα επιτευγμάτων για οποιοδήποτε παιχνίδι με το <span class="hl">AppID</span> προστέθηκε στη <span class="hl">λίστα αποκλεισμού</span>`,
                `<span class="hl" id="appidhelp"><u>Πώς μπορώ να βρω το AppID ενός παιχνιδιού Steam;</u></span>`
            ],
            exclusionnew: "Νέος αποκλεισμός",
            exclusionnewsub: [
                `Εισαγάγετε την <span class="hl">AppID</span> για προσθήκη στη <span class="hl">λίστα αποκλεισμού</span>`
            ]
        }
    },
    notificationelems: {
        title: "Στοιχεία ειδοποιήσεων",
        content: {
            unlockmsg: "Μήνυμα Ξεκλειδώματος",
            title: "Τίτλος Επίτευξης",
            desc: "Περιγραφή Επίτευξης",
            hiddeniconpos: "Κρυφό Εικονίδιο",
            sshiddeniconpos: "Κρυφό Εικονίδιο",
            decorationpos: "Διακόσμηση",
            ssdecorationpos: "Διακόσμηση",
            percentpos: "Ποσοστό Σπανιότητας",
            sspercentpos: "Ποσοστό Σπανιότητας",
            percentbadge: "Ετικέτα Ποσοστού",
            sspercentbadge: "Ετικέτα Ποσοστού",
            percentbadgepos: "Θέση Ετικέτας",
            sspercentbadgepos: "Θέση Ετικέτας",
            percentbadgecolor: "Χρώμα Ετικέτας",
            sspercentbadgecolor: "Χρώμα Ετικέτας",
            percentbadgefontcolor: "Χρώμα Γραμματοσειράς Εμβλήματος",
            sspercentbadgefontcolor: "Χρώμα Γραμματοσειράς Εμβλήματος",
            percentbadgefontsize: "Μέγεθος Ετικέτας",
            sspercentbadgefontsize: "Μέγεθος Ετικέτας",
            percentbadgeroundness: "Στρογγυλότητα Ετικέτας",
            sspercentbadgeroundness: "Στρογγυλότητα Ετικέτας",
            percentbadgex: "Οριζόντια Μετατόπιση",
            sspercentbadgex: "Οριζόντια Μετατόπιση",
            percentbadgey: "Κάθετη Μετατόπιση",
            sspercentbadgey: "Κάθετη Μετατόπιση",
            percentbadgeimg: "Χρήση Εικονιδίου",
            sspercentbadgeimg: "Χρήση Εικονιδίου",
            percentbadgeimgbronze: "Σπανιότητα: > 50%",
            sspercentbadgeimgbronze: "Σπανιότητα: > 50%",
            percentbadgeimgsilver: "Σπανιότητα: < 50% & > $rarity%",
            sspercentbadgeimgsilver: "Σπανιότητα: < 50% & > $rarity%",
            percentbadgeimggold: "Σπανιότητα: < $rarity%",
            sspercentbadgeimggold: "Σπανιότητα: < $rarity%",
            resetpbimgs: "Επαναφορά Εικονιδίων Badge",
            elemsmatch: "Ταίριασμα με τις Ρυθμίσεις του Customiser",
            ssdisplay: "Προεπισκόπηση Στιγμιότυπου"    
        }
    },
    themeswitch: {
        content: {
            managesub: [
                `Προσθέστε την <span class="hl">AppID</span> οποιουδήποτε παιχνιδιού για να αλλάξετε αυτόματα <span class="hl">Θέματα</span> όταν ανιχνευτεί`,
                `Οποιοδήποτε αποθηκευμένο <span class="hl">Θέμα</span> μπορεί να επιλεγεί για κάθε τύπο ειδοποίησης, μαζί με τον επιθυμητό υπολογιστή για να χρησιμοποιηθεί ως <span class="hl">Πηγή Στιγμιότυπου</span>`,
                `<span class="hl" id="appidhelp"><u>Πώς μπορώ να βρω την AppID ενός παιχνιδιού στο Steam;</u></span>`
            ],
            themeswitchnew: "Νέος Αυτόματος Αλλαγής",
            themeswitchnewsub: [
                `Εισαγάγετε την <span class="hl">AppID</span> του παιχνιδιού, μαζί με τον επιθυμητό υπολογιστή για να χρησιμοποιηθεί ως <span class="hl">Πηγή Στιγμιότυπου</span>`,
                `Επιλέξτε ποιο <span class="hl">Θέμα</span> να αλλάξει για κάθε τύπο ειδοποίησης όταν ανιχνευτεί η <span class="hl">AppID</span> αυτού του παιχνιδιού`
            ],
            themes: "Θέματα",
            src: "Πηγή Στιγμιότυπου",
            themedeleted: "Το θέμα διαγράφηκε"
        }
    }
}

export const missingdepssub = (opt: string, dep: string) => [
    `Φαίνεται ότι προσπαθείτε να ενεργοποιήσετε την επιλογή <span class="hl">${opt}</span>. Ωστόσο, στα συστήματα Linux, δεν μπορούν να ενεργοποιηθούν στιγμιότυπα οθόνης χωρίς να εγκαταστήσετε πρώτα το πακέτο <code class="dialogcode">${dep}</code>`,
    `Παρακαλούμε εκτελέστε την εντολή <code class="dialogcode" style="user-select: text;">sudo apt-get install ${dep}</code> για να εγκαταστήσετε αυτήν την εξάρτηση. Αυτό θα διασφαλίσει ότι οι στιγμιότυπα οθόνης μπορούν να ληφθούν σε αυτήν τη συσκευή`
]