export const translations = {
    global: {
        main: "หลัก",
        rare: "หายาก",
        plat: "100%",
        topleft: "มุมบนซ้าย",
        topcenter: "กลางบน",
        topright: "มุมบนขวา",
        bottomleft: "มุมล่างซ้าย",
        bottomcenter: "กลางล่าง",
        bottomright: "มุมล่างขวา",
        ok: "ตกลง",
        preview: "ตัวอย่าง",
        save: "บันทึก",
        back: "กลับ",
        settings: "การตั้งค่า",
        appversion: "เวอร์ชันแอปพลิเคชัน",
        image: "ภาพ",
        audio: "เสียง",
        folder: "โฟลเดอร์",
        font: "ฟอนต์",
        select: "เลือก",
        gametitle: "ชื่อเกม",
        congrats: "ขอแสดงความยินดี!",
        achievementunlocked: "ประสบความสำเร็จ",
        gamecomplete: "เกมสมบูรณ์ 100%",
        achievementdesc: "คลิกที่ปุ่มเพื่อแสดงการแจ้งเตือนทดสอบ",
        gamecompletedesc: "คุณปลดล็อคผลงานทั้งหมดแล้ว!",
        defaultcustomfont: "ค่าเริ่มต้น (ไม่ได้เลือกฟอนต์)",
        defaultsoundfile: "ค่าเริ่มต้น (ไม่ได้เลือกไฟล์)",
        defaultsounddir: "ค่าเริ่มต้น (ไม่ได้เลือกโฟลเดอร์)",
        nowtracking: "กำลังติดตามความสำเร็จสำหรับ:",
        nopreview: "ไม่สามารถดูตัวอย่างสำหรับระบบปฏิบัติการธรรมดาได้",
        options: "ตัวเลือก",
        resetwindow: "รีเซ็ตหน้าต่าง",
        show: "แสดง",
        exit: "ออก",
        releasegame: "ปล่อยเกม",
        releasegamesub: [
            `รีสตาร์ทกระบวนการ Worker ที่ทำงานในพื้นหลังและปล่อยเกมปัจจุบันจากการถูกติดตาม`,
            `ลองใช้ตัวเลือกนี้ถ้าคุณเพิ่งปิดเกมแต่ Steam ยังแสดงว่ามันกำลังทำงาน, หรือถ้า Steam Achievement Notifier ยังแสดงว่ากำลังติดตามเกมที่ถูกปิดไปแล้ว`
        ],
        noupdateavailable: "ไม่มีการอัปเดตที่ใช้ได้",
        latestversion: "ติดตั้งเวอร์ชันล่าสุดแล้ว",
        missingdeps: "ความขาดแคลนของขึ้นอยู่กับ",
        restartapp: "เริ่มใหม่แอปพลิเคชัน",
        restartappsub: [
            `หากสิ่งต่าง ๆ ไม่ทำงานอย่างถูกต้อง ให้ใช้ตัวเลือกนี้เพื่อปิดและเปิดแอปพลิเคชันอีกครั้ง`,
            `หากปัญหายังคงอยู่หลังจากเริ่มใหม่แอปพลิเคชัน โปรดพิจารณาที่จะรายงานโดยใช้ลิงก์ภายในบนหน้าจอหลัก`
        ],
        suspend: "พัก",
        resume: "ดำเนินการต่อ",
        new: "ใหม่...",
        nodata: "ไม่มีข้อมูล",
        findappid: "ค้นหา AppID",
        findappidsub: [
            `ทุกเกมของ Steam มีหมายเลขที่ไม่ซ้ำกันที่เกี่ยวข้อง - เรียกว่า <span class="hl">AppID</span> คุณสามารถค้นหา AppID ที่เกี่ยวข้องกับเกม Steam ใด ๆ ได้โดยตรวจสอบหนึ่งในวิธีต่อไปนี้:`,
            `ใน <span class="hl">ไคลเอนต์ Steam</span> คลิกขวาที่เกมใน <span class="hl">คลัง</span> ของคุณและเลือก <i>คุณสมบัติ</i> > <i>อัพเดท</i> - AppID จะถูกแสดงที่นี่`,
            `ที่ <span class="hl">URL</span> ของ <span class="hl">หน้าร้านของเกม</span> - จะเป็นตัวเลขที่ระบุหลังจาก <span class="hl">app/</span>: <code class="appidhelpcode">https://store.steampowered.com/app/<span class="hl">4000</span></code>`,
            `เว็บไซต์เช่น <span class="hl">SteamDB</span> - ส่วนข้อมูลเกี่ยวกับ <span class="hl">App</span> จะระบุ AppID สำหรับแต่ละเกม`
        ],
        noexe: "ไม่พบไฟล์ EXE ของเกม!",
        noexesub: "คลิกที่นี่เพื่อข้อมูลเพิ่มเติม",
        noexedialogsub: [
            `Steam Achievement Notifier ไม่สามารถหาตำแหน่งไฟล์ที่สามารถทำงานของเกมนี้ได้โดยอัตโนมัติ ตำแหน่งของไฟล์ที่สามารถทำงานของเกมจำเป็นต้องใช้เพื่อ "ปล่อย" เกม`,
            `ในการปล่อยเกมด้วยตนเอง, <i>คลิกขวา</i> บน <span class="hl">ไอคอนถาดระบบ</span> > <span class="hl">ตัวเลือก</span> > <span class="hl">ปล่อยเกม</span> หรือใช้ <span class="hl">ทางลัดปล่อยเกม</span>`,
            `นอกจากนี้, คลิกที่ปุ่ม <span class="hl">Link</span> ด้านล่างเพื่อเพิ่มไฟล์ที่สามารถทำงานที่เกี่ยวข้องของหน้าต่างที่โฟกัสลงในเมนู <span class="hl">เกมที่เชื่อมโยง</span>`,
            `<span class="hl help" id="linkgamehelp"><u>เกิดอะไรขึ้นเมื่อฉันคลิกปุ่ม Link?</u></span>`
        ],
        linkgamehelp: "เชื่อมโยงเกมผ่านหน้าต่าง",
        linkgamehelpsub: [
            `การคลิกปุ่ม <span class="hl">Link</span> จะเพิ่มรายการใหม่โดยอัตโนมัติในเมนู <span class="hl">การตั้งค่า</span> > <span class="hl">เกมที่เชื่อมโยง</span> โดยใช้ข้อมูลจากหน้าต่างที่โฟกัสอยู่`,
            `หลังจากคลิกปุ่ม <span class="hl">Link</span>, จะเริ่มตัวจับเวลา 5 วินาที`,
            `ก่อนที่ตัวจับเวลาจะหมด, กรุณาให้ความสำคัญกับหน้าต่างเกม`,
            `เมื่อเวลาหมด, จะเพิ่มรายการใหม่สำหรับ <span class="hl">AppID</span> ปัจจุบันในเมนู <span class="hl">การตั้งค่า</span> > <span class="hl">เกมที่เชื่อมโยง</span> โดยใช้ไฟล์ที่สามารถทำงานของหน้าต่างที่โฟกัส`,
            `หากต้องการลองใหม่, ลบรายการผ่าน <span class="hl">การตั้งค่า</span> > <span class="hl">เกมที่เชื่อมโยง</span> โดยการคลิกที่ปุ่ม <span id="linkhelpunlink"></span>`
        ],
        addlinkfailed: "ไม่สามารถเชื่อมโยงหน้าต่างได้",
        addlinkfailedsub: `คลิกที่ปุ่ม <span class="hl">Link</span> เพื่อลองใหม่`,
        webhookunlockmsg: "$user ได้ปลดล็อกความสำเร็จ",
        webhookingame: "ใน $gamename",
        notconnected: "ไม่เชื่อมต่อ"
    },
    app: {
        content: {
            game: "ไม่พบเกม",
            customise: "ปรับแต่ง",
            test: "แสดงการแจ้งเตือนทดสอบ"
        }
    },
    settings: {
        language: {
            title: "ภาษา",
            content: {
                steamlang: "แปลความสำเร็จเป็นภาษา Steam",
                maxsteamlangretries: "จำนวนครั้งสูงสุดในการพยายามแปล"
            }
        },
        os: {
            title: "ระบบปฏิบัติการ",
            content: {
                desktop: "สร้างทางลัดบนเดสก์ท็อป",
                startwin: "เริ่มต้นเมื่อเข้าสู่ระบบ",
                startmin: "เริ่มต้นในโหมดย่อ",
                nohwa: "ปิดใช้งานการเร่งฮาร์ดแวร์",
                litemode: "โหมดไลท์"
            }
        },
        notifications: {
            title: "การแจ้งเตือน",
            content: {
                rarity: "เปอร์เซ็นต์ความหายาก",
                rareonly: "เฉพาะหายาก",
                all: "ทั้งหมด",
                off: "ปิด",
                showpercent: "แสดงเปอร์เซ็นต์",
                soundonly: "เสียงเท่านั้น",
                extwin: "การแจ้งเตือนการสตรีม",
                extwinframerate: "อัตราเฟรม",
                extwinshow: "แสดงหน้าต่าง",
                audiosrc: "แหล่งเสียง",
                notify: "แจ้ง",
                app: "แอปพลิเคชัน",
                nowtracking: "แสดงการแจ้งเตือนการติดตาม",
                nowtrackingscale: "มาตราส่วนการติดตาม",
                nowtrackingpos: "ตำแหน่งการติดตาม",
                shortcuts: "ทางลัดการแจ้งเตือน",
                noiconcache: "ปิดใช้งานแคชไอคอน",
                webhooks: "โพสต์ไปยังเซิร์ฟเวอร์ Discord",
                webhooktypes: "ประเภท Webhook",
                webhookurl: `Webhook URL`,
                webhookcaution: `เมื่อเปิดใช้งานตัวเลือกนี้และให้ลิงก์ Webhook Discord ที่ถูกต้อง คุณยอมรับว่าคุณเข้าใจว่า <u>ข้อมูลความสำเร็จและเกมทั้งหมดสำหรับผู้ใช้ Steam ปัจจุบัน</u> จะถูกโพสต์ไปยังเซิร์ฟเวอร์ Discord ที่ระบุผ่านลิงก์ Webhook ที่ให้ไว้<br><br>หากคุณไม่ต้องการให้ Steam Achievement Notifier โพสต์ข้อมูลนี้ในนามของคุณ โปรดปิดใช้งานตัวเลือกนี้.`,
                webhooklaststatus: "สถานะล่าสุด"
            }
        },
        media: {
            title: "สื่อ",
            content: {
                steamss: "ถ่ายภาพหน้าจอ Steam",
                screenshots: "สื่อเพิ่มเติม",
                off: "ปิด",
                overlay: "การถ่ายภาพหน้าจอพร้อมภาพนิ่ง",
                monitors: "แหล่งข้อมูลภาพหน้าจอ",
                hdrmode: "โหมด HDR",
                ovpos: "ตำแหน่งการฝังภาพ",
                ovmatch: "ตรงกับตำแหน่งที่กำหนดเอง",
                ovx: "การเคลื่อนที่แนวนอน",
                ovy: "การเคลื่อนที่แนวตั้ง",                
                ovpath: "เส้นทางการถ่ายภาพหน้าจอ",
                ssdelay: "ความล่าช้าในการถ่ายภาพหน้าจอ",
                notifyimg: "รูปภาพการแจ้งเตือน",
                imgpath: "เส้นทางรูปภาพ"
            }
        },
        games: {
            title: "เกม",
            content: {
                linkedgames: "เกมที่เชื่อมโยง",
                themeswitch: "เปลี่ยนธีมอัตโนมัติ",
                exclusionlist: "รายการยกเว้น"
            }
        },
        accessibility: {
            title: "การเข้าถึง",
            content: {
                noanim: "ปิดใช้งานการเคลื่อนไหวของหน้าต่างแอปพลิเคชัน",
                noupdatedialog: "ปิดการใช้งานกล่องโต้ตอบการอัปเดต",
                nvda: "เปิดใช้งานการสนับสนุน NVDA",
                tooltips: "แสดงเคล็ดลับเครื่องมือ",
                showsystrayopts: "แสดงตัวเลือกในถาดระบบ",
                releaseshortcut: "ทางลัดปล่อยเกม"
            }
        },
        advanced: {
            title: "ขั้นสูง",
            content: {
                pollrate: "อัตราการสำรวจ",
                initdelay: "ความล่าช้าในการติดตาม",
                releasedelay: "การเลื่อนการเผยแพร่",
                maxretries: "จำนวนการลองทำใหม่สูงสุด",
                debug: "แผงดีบัก",
                userust: "โหมดการประมวลผลทางเลือก",
                notifydebug: "แสดงการแจ้งเตือนในการดีบัก",
                usecustomfiles: "ใช้ไฟล์แอปพลิเคชันที่กำหนดเอง",
                showcustomfiles: "แสดงไฟล์แอปพลิเคชันที่กำหนดเอง"
            }
        },        
        misc: {
            title: "เบ็ดเตล็ด",
            content: {
                checkforupdates: "ตรวจสอบการอัปเดต",
                log: "บันทึกแอปพลิเคชัน",
                reset: "รีเซ็ตแอปพลิเคชัน"
            }
        }
    },
    customiser: {
        preset: {
            title: "การตั้งค่าพรีเซ็ต",
            content: {
                preset: "พรีเซ็ตการแจ้งเตือน",
                iconanim: "การเคลื่อนไหวไอคอนหายาก",
                alldetails: "แสดงรายละเอียดทั้งหมด",
                usepercent: "ใช้เปอร์เซ็นต์",
                displaytime: "เวลาที่แสดง",
                scale: "ขนาด",
                customtext: "ข้อความที่กำหนดเอง",
                usegametitle: "ใช้ชื่อเกม",
                customfont: "แบบอักษรที่กำหนดเอง"
            }
        },
        sound: {
            title: "เสียง",
            content: {
                soundmode: "โหมดเสียง",
                file: "ไฟล์",
                folder: "สุ่ม",
                soundfile: "ไฟล์เสียง",
                sounddir: "โฟลเดอร์เสียง",
                volume: "ระดับเสียง"
            }
        },
        style: {
            title: "สไตล์",
            content: {
                bgstyle: "สไตล์พื้นหลัง",
                solid: "สีเดียว",
                gradient: "ไล่สี",
                img: "รูปภาพ",
                gameart: "ศิลปะเกม",
                gradientangle: "มุมไล่สี",
                bgimg: "รูปภาพพื้นหลัง",
                bgimgbrightness: "ความสว่าง",
                brightness: "ความสว่าง",
                blur: "เบลอ",
                roundness: "โค้ง",
                fontsize: "ขนาดตัวอักษร",
                opacity: "ความโปร่งใส",
                bgonly: "เฉพาะพื้นหลัง",
                glow: "เรืองแสง",
                glowcolor: "สี",
                glowsize: "ขนาด",
                glowx: "การเคลื่อนที่แนวนอน",
                glowy: "การเคลื่อนที่แนวตั้ง",
                glowopacity: "ความทึบ",
                glowanim: "อนิเมชัน",
                glowspeed: "ความเร็ว",
                off: "ปิด",
                pulse: "ชีพจร",
                rainbow: "รุ้ง",
                mask: "หน้ากาก",
                maskimg: "ภาพหน้ากาก",
                outline: "ขอบ",
                outlinecolor: "สีขอบ",
                outlinewidth: "ความกว้างของขอบ",
                dashed: "เส้นประ",
                dotted: "เส้นจุด"
            }
        },
        colors: {
            title: "สี",
            content: {
                primarycolor: "สีหลัก",
                secondarycolor: "สีรอง",
                tertiarycolor: "สีระดับที่สาม",
                fontcolor: "สีตัวอักษร",
                fontoutline: "เส้นขอบตัวอักษร",
                fontoutlinecolor: "สีขอบตัวอักษร",
                fontshadow: "เงาตัวอักษร",
                fontshadowcolor: "สีเงาตัวอักษร"
            }
        },
        icons: {
            title: "ไอคอน",
            content: {
                iconroundness: "ความโค้งของไอคอน",
                plat: "โลโก้ 100%",
                usegameicon: "ใช้ไอคอนเกม",
                logo: "โลโก้",
                decoration: "ตกแต่ง",
                showdecoration: "แสดงการตกแต่ง",
                rarity: "ความหายาก",
                showhiddenicon: "แสดงไอคอนที่ซ่อนอยู่",
                hiddenicon: "ไอคอนที่ซ่อนอยู่",
                replacelogo: "แทนที่โลโก้"
            }
        },
        position: {
            title: "ตำแหน่ง",
            content: {
                pos: "ตำแหน่งบนหน้าจอ",
                usecustompos: "ใช้ตำแหน่งที่กำหนดเอง",
                setcustompos: "ตั้งค่า",
                resetcustompos: "รีเซ็ต"
            }
        },
        theme: {
            title: "ธีม",
            content: {
                updatetheme: "อัปเดตธีม",
                savetheme: "บันทึกธีม",
                sub: [
                    `สามารถเลือก <span class="hl">ธีมของผู้ใช้</span> ที่บันทึกไว้จากเมนู <span class="hl">เลือกธีม</span> บนหน้าจอหลักได้`,
                    `โปรดตรวจสอบว่า <span class="hl">ชื่อธีม</span> เป็น <u>ไม่ซ้ำกัน</u> - ชื่อที่ตรงกับธีมที่มีอยู่ <u>จะเขียนทับข้อมูลเดิม</u>!`
                ],
                placeholder: "ชื่อธีม",
                theme: "ธีม",
                importtheme: "นำเข้าธีม",
                import: "นำเข้า",
                importsub: [
                    `นำเข้า <span class="hl">ไฟล์ธีมที่สร้างโดยผู้ใช้</span>`,
                    `ธีมที่<span class="hl">นำเข้า</span>จะถูกโหลดโดยอัตโนมัติหลังจากนำเข้าเรียบร้อยแล้ว และสามารถเลือกได้จากเมนู <span class="hl">เลือกธีม</span>`,
                ],
                importidle: `เลือก <span class="hl">ไฟล์ธีม</span> เพื่อนำเข้า`,
                importcopied: `คัดลอกธีมสำเร็จ`,
                importrenamed: `เปลี่ยนชื่อธีมสำเร็จ`,
                importextracted: `แยกธีมสำเร็จ`,
                importrewriting: `เขียนทับเส้นทางของไฟล์ธีม...`,
                importconverting: `แปลงธีม...`,
                importcreating: `สร้างธีม...`,
                importdone: `นำเข้าธีมสำเร็จ`,
                importfailed: `เกิดข้อผิดพลาดในการนำเข้าไฟล์ธีมที่เลือก!`,
                exporttheme: "ส่งออกธีม",
                export: "ส่งออก",
                exporterrortitle: "ข้อผิดพลาดในการส่งออก",
                exporterrorsub: [
                    "เกิดข้อผิดพลาดระหว่างการพยายามส่งออกธีมที่เลือก",
                    `โปรดลองบันทึกธีมปัจจุบัน (<i>ผ่าน <span class="hl">บันทึกธีม</span></i>) และลองส่งออกอีกครั้ง`,
                    `หากปัญหายังคงอยู่ โปรดคัดลอกข้อผิดพลาดด้านล่างและรายงานผ่านปุ่มลิงก์ที่อยู่ใน <span class="hl">หน้าหลัก</span>`
                ],
                synctheme: "ซิงค์ธีม",
                syncedwith: "ซิงค์กับ",
                themeselect: "ธีมที่เลือก"
            }
        }
    },
    logwin: {
        content: {
            tagline: "นี่คือสิ่งที่เกิดขึ้นตั้งแต่แอปเริ่มต้น",
            copylog: "คัดลอกเนื้อหาบันทึก"
        }
    },
    reset: {
        content: {
            sub: `
                <div class="wrapper" id="resetsub">
                    <span>แน่ใจหรือไม่?</span>
                    <span>ข้อมูลที่กำหนดไว้ก่อนหน้านี้ <u>รวมถึงการปรับแต่งทั้งหมด</u> จะถูกตั้งค่าเป็นค่าเริ่มต้น</span>
                    <span>🛑 ไม่สามารถย้อนกลับได้!</span>
                </div>
            `,
            reset: "รีเซ็ต"
        }
    },
    error: {
        content: {
            subtitle: "Steam Achievement Notifier พบปัญหาและต้องปิด",
            details: "นี่คือรายละเอียดข้อผิดพลาด:",
            sub: "คลิกที่ปุ่มด้านล่างเพื่อรายงานปัญหานี้ผ่านแพลตฟอร์มที่คุณชอบ",
            report: "รายงาน",
            log: "บันทึกแอป",
            exit: "ออก"
        }
    },    
    tooltips: {
        game: "เกมที่กำลังติดตามความสำเร็จอยู่ในขณะนี้",
        usertheme: "เลือกธีมที่บันทึกไว้ก่อนหน้านี้",
        customise: "ปรับแต่งการแจ้งเตือนความสำเร็จ",
        test: "แสดงการแจ้งเตือนทดสอบ รวมถึงการปรับแต่งที่กำหนดเอง",
        kofi: "บริจาคบน Ko-Fi!",
        discord: "เข้าร่วม Discord!",
        github: "รายงานปัญหา",
        lang: "เลือกภาษาของ UI ที่ใช้ในแอป",
        steamlang: `พยายามโหลดการแปลที่อยู่ในไฟล์แอปพลิเคชันของ Steam เพื่อแสดงข้อมูลความสำเร็จในภาษาที่ผู้ใช้เลือกในไคลเอนต์ Steam<br><br><span class="ttdesc">ตัวเลือกนี้พยายามค้นหาการแปลในไฟล์ JSON ที่เก็บอยู่ในข้อมูลแอปพลิเคชันของ Steam หากไม่สามารถค้นหาการแปลสำหรับความสำเร็จปัจจุบันได้ ข้อมูลความสำเร็จที่ดึงมาจาก Steamworks จะแสดงแทน</span>`,
        maxsteamlangretries: `จำนวนครั้ง (ทุก 100 มิลลิวินาที) ที่พยายามค้นหาการแปลที่ถูกต้องสำหรับความสำเร็จปัจจุบัน<br><br><span class="ttdesc">Steam ขณะนี้เก็บข้อมูลความสำเร็จเพียงเล็กน้อยในไฟล์ JSON ที่เชื่อมโยงกับแต่ละเกม ความสำเร็จที่ไม่อยู่ในไฟล์นี้จะถูกเพิ่มหลังจากความสำเร็จได้รับการปลดล็อก<br><br>เนื่องจากการเพิ่มข้อมูลใหม่อาจใช้เวลา การเพิ่มค่านี้จะเพิ่มโอกาสในการค้นหาข้อมูลการแปลสำหรับความสำเร็จปัจจุบัน แต่ยังอาจทำให้การแจ้งเตือนบนหน้าจอช้าลงตามระยะเวลาที่คำนวณโดยการตั้งค่านี้<br><br>หากไม่สามารถค้นหาข้อมูลการแปลที่ถูกต้องสำหรับความสำเร็จปัจจุบันได้ การแปลจะตกกลับไปยังภาษาที่ระบุใน Steamworks</span>`,
        desktop: "สลับการเปิด-ปิดทางลัดบนเดสก์ท็อปเพื่อเรียกใช้แอป",
        startwin: "เริ่ม Steam Achievement Notifier โดยอัตโนมัติหลังจากเข้าสู่ระบบ",
        startmin: "หลังจากเปิดแอป ซ่อนหน้าต่าง UI จนกว่าจะเปิดจาก System Tray",
        nohwa: `ปิดการใช้งานการเร่งฮาร์ดแวร์ซึ่งอาจเพิ่มประสิทธิภาพในระบบที่มีทรัพยากรจำกัดหรือระบบที่ไม่มี GPU ที่ได้รับการจัดสรร<br><br><span class="ttdesc">แอปพลิเคชันจะรีบูตหลังจากเปิดใช้งาน/ปิดใช้งานตัวเลือกนี้</span>`,
        litemode: "ปิดใช้งานองค์ประกอบ UI ทั้งหมด และให้ความสามารถของแอปเฉพาะผ่านไอคอน System Tray เท่านั้น อาจเพิ่มทรัพยากรที่ใช้โดยแอป",
        rarity: "เปอร์เซ็นต์ที่จะเกิดการแจ้งเตือนความสำเร็จที่หายาก ความสำเร็จใด ๆ ที่มีเปอร์เซ็นต์การปลดล็อคเกินค่านี้จะแสดงเป็นการแจ้งเตือนหลัก",
        showpercent: "แสดงเปอร์เซ็นต์การปลดล็อคของความสำเร็จในการแจ้งเตือนสำหรับประเภทที่เลือก",
        soundonly: "ปิดการแจ้งเตือน และเล่นเสียงที่ตั้งค่าไว้ผ่าน Customiser เท่านั้น",
        extwin: "สร้างหน้าต่างพื้นหลังที่ซ่อนอยู่ที่ทำซ้ำกับการแจ้งเตือนที่กำลังแสดงบนหน้าจอ หน้าต่างนี้จะสามารถเพิ่มเป็นแหล่งที่มาของ Window Capture สำหรับใช้ในซอฟต์แวร์สตรีมมิ่ง เช่น OBS",
        extwinframerate: "ตั้งค่าอัตราเฟรมเป้าหมายสำหรับการแจ้งเตือนสตรีม",
        extwinshow: "สลับการมองเห็นของหน้าต่างการแจ้งเตือนสตรีม",
        audiosrc: "เลือกแหล่งที่มาของเสียง (หรือปิดใช้งาน) ที่สร้างขึ้นโดยแอป",
        nowtracking: "แสดงการแจ้งเตือนแจ้งให้ผู้ใช้ทราบว่ากำลังติดตามความสำเร็จสำหรับเกมที่กำลังเล่นอยู่",
        nowtrackingscale: `ตั้งค่าขนาดการแจ้งเตือนการติดตาม`,
        nowtrackingpos: `ตั้งค่าตำแหน่งการแจ้งเตือนการติดตาม`,
        shortcuts: "เรียกใช้การแจ้งเตือนทดสอบผ่านทางแป้นพิมพ์ลัด สามารถปรับแต่งที่แต่ละประเภทของการแจ้งเตือน",
        noiconcache: `ปิดใช้งานการเก็บแคชไอคอนของความสำเร็จขณะเริ่มเกม<br><br><span class="ttdesc">สามารถปรับปรุงประสิทธิภาพแอปเมื่อเริ่มเกมและแก้ไขปัญหาการติดตามเกมที่มีจำนวนความสำเร็จมาก อย่างไรก็ตามการปิดใช้งานแคชไอคอนอาจทำให้ขาดไอคอนความสำเร็จในการแจ้งเตือนได้ในกรณีที่หายาก</span>`,
        steamss: "ถ่ายรูปหน้าจอ Steam เมื่อปลดล็อคความสำเร็จ",
        screenshots: "เลือกประเภทของสื่อเพิ่มเติมที่จะสร้างเมื่อแสดงการแจ้งเตือน",
        monitors: "จอที่จะถูกบันทึกเมื่อถ่ายภาพหน้าจอ",
        hdrmode: `ถ่ายภาพหน้าจอโดยใช้วิธีที่เข้ากันได้กับหน้าจอที่ใช้เทคโนโลยี High Dynamic Range (HDR)`,
        ovpos: "ตำแหน่งของการแสดงผลบนภาพหน้าจอ",
        ovmatch: "จับคู่ตำแหน่งหน้าจอที่ตั้งค่าใน Customiser สำหรับประเภทการแจ้งเตือนนี้",
        ovpath: "ตำแหน่งที่จะบันทึกภาพหน้าจอที่สร้างขึ้นโดยตัวเลือกนี้",
        ssdelay: "เพิ่มความล่าช้าจากเวลาที่เกิดการแจ้งเตือนไปจนถึงเวลาที่ถ่ายภาพหน้าจอ",
        sspreview: "แสดงตัวอย่างว่าภาพหน้าจอจะปรากฏอย่างไรเมื่อบันทึก",
        noanim: "ปิดใช้งานเอฟเฟกต์การเคลื่อนไหวและการเปลี่ยนแปลงหน้าต่างภายในแอปทั้งหมด",
        noupdatedialog: `ป้องกันกล่องโต้ตอบ <span class="hl">มีการอัปเดตใหม่</span> จากการแสดงผลโดยอัตโนมัติและเน้นไปที่<br><br><span class="ttdesc">ยังสามารถเปิดกล่องโต้ตอบได้โดยการคลิกที่ปุ่มอัปเดตเมื่อมีอยู่</span>`,
        nvda: "เปิดใช้งานการคัดลอกข้อมูลความสำเร็จไปยังคลิปบอร์ดเมื่อปลดล็อคความสำเร็จ เพื่อให้สามารถอ่านได้โดยซอฟต์แวร์อ่านหน้าจอ เช่น NVDA",
        tooltips: "แสดงคำแนะนำเมื่อเลื่อนเมาส์ไปที่องค์ประกอบ UI บางอย่าง",
        pollrate: `ตั้งค่าช่วงเวลาการอัปเดตสำหรับข้อมูลความสำเร็จขณะเล่นเกม<br><br><span class="ttdesc">ประสิทธิภาพอาจเพิ่มขึ้น/ลดลงขึ้นอยู่กับค่าหรือฮาร์ดแวร์ของระบบ ค่าที่สูงขึ้นมักจะทำให้มีการโหลดระบบต่ำลง แต่อาจทำให้การแจ้งเตือนช้าลง</span>`,
        initdelay: `ตั้งค่าความล่าช้าระหว่างการตรวจจับ <span class="hl">AppID</span> ปัจจุบันและเริ่มต้นการติดตามกระบวนการ/ความสำเร็จ<br><br><span class="ttdesc">การเพิ่มค่านี้สามารถป้องกันสถานการณ์ที่ Steam ไม่สามารถเริ่มเกมปัจจุบันได้ (เนื่องจากการเริ่มต้นแอปพลิเคชันใน Steamworks ก่อนที่จะเริ่มเกม)</span><br><br><span class="ttdesc">อีกทางเลือกคือ เพิ่มค่านี้ยังสามารถใช้ในการหลีกเลี่ยงการตรวจจับกระบวนการเริ่มต้นก่อนเกมที่ไม่ถูกต้อง</span>`,
        releasedelay: `ตั้งเวลาที่กระบวนการพื้นหลังจะรอเพื่อเริ่มต้นอีกครั้งหลังจากเกมปัจจุบันได้รับการเผยแพร่ มีผลต่อการติดตามกระบวนการอัตโนมัติและเกมที่เชื่อมโยงด้วยตนเอง<br><br><span class="ttdesc">ให้ช่วงเวลาที่ยาวขึ้นสำหรับการปลดล็อก Steamworks จากแอป การเพิ่มค่านี้สามารถป้องกันพฤติกรรมที่ผิดปกติได้ เช่นการติดตามเกมที่ถูกปิดไปก่อนหน้า</span>`,
        maxretries: `ตั้งค่าจำนวนครั้งสูงสุดที่ลองเชื่อมโยงกระบวนการที่กำลังทำงานกับ AppID ที่ตรวจพบ มีผลต่อการติดตามกระบวนการอัตโนมัติและเกมที่เชื่อมโยงด้วยตนเอง<br><br><span class="ttdesc">การพยายามเชื่อมต่อจะทำซ้ำทุกวินาที หากกระบวนการที่กำลังทำงานไม่ได้เชื่อมต่อกับ AppID ปัจจุบันหลังจากจำนวนครั้งนี้ กระบวนการที่ไม่ถูกต้องจะถูกส่งคืน ในกรณีเช่นนี้จะต้องปลดล็อกเกมด้วยตนเองผ่านถาดระบบ > ตัวเลือก > ปลดล็อกเกม</span>`,
        debug: "เปิดแผงดีบักซึ่งแสดงข้อมูลการติดตามกระบวนการอย่างละเอียด",
        userust: "ใช้ฟังก์ชันทางเลือกที่ใช้ Rust เพื่อตรวจสอบว่ากระบวนการเกมที่ติดตามกำลังทำงานอยู่ในระบบหรือไม่ กรณีที่ไม่ได้ทำเครื่องหมายเป็นถูก จะใช้การตรวจสอบกระบวนการที่เป็นค่าเริ่มต้นที่ใช้ NodeJS แทนกัน",
        notifydebug: "สร้างหน้าต่าง DevTools สำหรับการแจ้งเตือนทั้งหมด มีประโยชน์ในการแก้ไขปัญหา/การตรวจหาข้อบกพร่องของการแจ้งเตือน",
        usecustomfiles: "เปิดใช้งานการโหลดไฟล์ที่กำหนดเองสำหรับการแจ้งเตือน แต่ควรใช้ความระมัดระวังสำหรับผู้ใช้ทั่วไป",
        showcustomfiles: "เปิดตำแหน่งของไฟล์ที่กำหนดเอง",
        log: "เปิดหน้าต่างบันทึกแอปฯ ซึ่งแสดงข้อมูลเกี่ยวกับกิจกรรมของกระบวนการ คำเตือน และข้อผิดพลาด",
        reset: "ลบข้อมูลการกำหนดค่าทั้งหมดและเริ่มแอปใหม่",
        playback: "หยุด/เริ่มเล่นอนิเมชันของการแจ้งเตือนตัวอย่าง",
        replay: "เริ่มเล่นอนิเมชันของการแจ้งเตือนตัวอย่างใหม่",
        preset: "เลือกการตั้งค่าการแจ้งเตือนที่จะปรับแต่ง",
        iconanim: "สลับเส้นขอบและอนิเมชันของไอคอน Rare",
        alldetails: "แสดงองค์ประกอบข้อความทั้งหมดภายในการแจ้งเตือน รวมถึงองค์ประกอบที่ซ่อนอยู่โดยค่าเริ่มต้นสำหรับการตั้งค่านี้",
        usepercent: "แสดงเปอร์เซ็นต์การปลดล็อกของความสำเร็จแทนค่า XP/S",
        displaytime: "ตั้งค่าจำนวนวินาทีที่การแจ้งเตือนจะแสดง",
        scale: "เพิ่มหรือลดขนาดของการแจ้งเตือน",
        customtext: "ตั้งค่าข้อความที่กำหนดเองที่จะแสดงในการแจ้งเตือน",
        usegametitle: "แสดงชื่อเกมปัจจุบันในการแจ้งเตือน",
        customfont: "โหลดฟอนต์ที่กำหนดเองที่จะใช้ในการแจ้งเตือน",
        soundmode: "เลือกไฟล์เสียงเดียวหรือเลือกไฟล์เสียงแบบสุ่มจากโฟลเดอร์ที่มีไฟล์เสียงหลายไฟล์เมื่อเกิดการแจ้งเตือน",
        soundfile: "เลือกไฟล์เสียงที่จะเล่นเมื่อเกิดการแจ้งเตือน",
        sounddir: "เลือกโฟลเดอร์ที่จะเลือกไฟล์เสียงแบบสุ่มเมื่อเกิดการแจ้งเตือน",
        volume: "ตั้งค่าระดับเสียงของไฟล์เสียง",
        preview: "แสดงตัวอย่างไฟล์เสียงที่เลือก หรือไฟล์เสียงที่เลือกแบบสุ่มจากโฟลเดอร์",
        bgstyle: "เลือกสไตล์สีพื้นหลังของการแจ้งเตือน",
        gradientangle: "ตั้งค่ามุมของการไล่ระดับสี",
        bgimg: "โหลดไฟล์รูปภาพที่จะใช้เป็นพื้นหลังของการแจ้งเตือน",
        bgimgbrightness: "ตั้งค่าความสว่างของรูปภาพที่ใช้เป็นพื้นหลังการแจ้งเตือน",
        brightness: "ตั้งค่าความสว่างของภาพเกมที่ใช้เป็นพื้นหลังของการแจ้งเตือน",
        blur: "ตั้งระดับของความเบลอที่ใช้กับพื้นหลังของการแจ้งเตือน",
        roundness: "ตั้งค่าความโค้งของขอบของการแจ้งเตือน",
        fontsize: "ตั้งค่าขนาดของตัวอักษรที่ใช้ในการแจ้งเตือน",
        opacity: "ตั้งค่าความทึบทั่วไปของการแจ้งเตือน",
        bgonly: "ตั้งค่าความทึบสำหรับพื้นหลังของการแจ้งเตือนเท่านั้น ให้คงค่าความทึบขององค์ประกอบอื่นเป็นค่าเต็ม",
        glow: "เปิดใช้งานเอฟเฟกต์การเรืองแสงที่ล้อมรอบการแจ้งเตือน",
        glowcolor: "ตั้งค่าสีของเอฟเฟกต์การเรืองแสง",
        glowsize: "ตั้งค่าขนาดของเอฟเฟกต์การเรืองแสง",
        glowx: "ปรับตำแหน่งเอฟเฟกต์การสะท้อนแสงแนวนอน",
        glowy: "ปรับตำแหน่งเอฟเฟกต์การสะท้อนแสงแนวตั้ง",
        glowopacity: "ตั้งค่าความทึบของเอฟเฟกต์การสะท้อนแสง",
        glowanim: "เลือกการ์ตูนที่กำหนดไว้เพื่อใช้กับเอฟเฟกต์การเรืองแสง",
        glowspeed: "ตั้งค่าความเร็วของการ์ตูนที่ใช้กับเอฟเฟกต์การเรืองแสง",
        mask: "เปิดใช้งานการปกปิดบางส่วนของการแจ้งเตือนด้วยภาพที่กำหนดเอง",
        maskimg: `อัปโหลดไฟล์ภาพที่จะใช้เป็นหน้ากาก<br><br><span class="ttdesc">ใน CSS <code class="ttcode">mask-mode: alpha</code> ทำงานในทิศทางตรงกันข้ามกับที่คาดหวัง - พื้นที่โปร่งในไฟล์ภาพจะถูกซ่อนเอาไว้และพื้นที่สีดำ/เทาจะทำให้ส่วนองค์ประกอบด้านล่างเห็นได้</span>`,
        outline: "เลือกประเภทขอบที่จะแสดงรอบๆ การแจ้งเตือน",
        outlinecolor: "ตั้งค่าสีของขอบรอบๆ การแจ้งเตือน",
        outlinewidth: "ตั้งค่าความกว้างของขอบรอบๆ การแจ้งเตือน",
        primarycolor: "ตั้งค่าสีหลักของการแจ้งเตือน",
        secondarycolor: "ตั้งค่าสีรองของการแจ้งเตือน",
        tertiarycolor: "ตั้งค่าสีรองสุดของการแจ้งเตือน",
        fontcolor: "ตั้งค่าสีของข้อความทั้งหมดที่แสดงในการแจ้งเตือน",
        fontoutline: "เพิ่มเส้นขอบให้กับข้อความทั้งหมดที่แสดงในการแจ้งเตือน",
        fontoutlinecolor: "ตั้งค่าสีของเส้นขอบของข้อความ",
        fontshadow: "เพิ่มเงาให้กับข้อความทั้งหมดที่แสดงในการแจ้งเตือน",
        fontshadowcolor: "ตั้งค่าสีของเงาของข้อความ",
        iconroundness: "ตั้งค่าความโค้งของไอคอนความสำเร็จ/เกมที่แสดงในการแจ้งเตือน",
        plat: "โหลดไฟล์รูปภาพที่จะใช้เป็นไอคอน 100%",
        usegameicon: "แทนที่ไอคอนการแจ้งเตือนเริ่มต้นด้วยไอคอนของเกมปัจจุบัน",
        showhiddenicon: "แสดงภาพที่บ่งชี้ว่าความสำเร็จถูกซ่อนในการแจ้งเตือน",
        hiddenicon: "โหลดไฟล์รูปภาพเพื่อแทนที่ไอคอนความสำเร็จที่ซ่อนอยู่",
        logo: "โหลดไฟล์รูปภาพเพื่อแทนที่ไอคอนโลโก้",
        decoration: "โหลดไฟล์รูปภาพเพื่อแทนที่ไอคอนตกแต่ง",
        showdecoration: "สลับการมองเห็นของไอคอนตกแต่ง",
        replacelogo: "แทนที่ไอคอนโลโก้ในการแจ้งเตือนด้วยการตกแต่งที่เลือก",
        pos: "ตั้งค่าตำแหน่งบนหน้าจอของการแจ้งเตือน",
        usecustompos: "เปิดใช้งานตำแหน่งที่กำหนดเองสำหรับการแจ้งเตือน",
        setcustompos: "ตั้งค่าตำแหน่งที่กำหนดเองสำหรับการแจ้งเตือน",
        resetcustompos: "รีเซ็ตตำแหน่งของการแจ้งเตือนเป็นตำแหน่งที่กำหนดเองเริ่มต้น",
        updatetheme: "อัปเดตธีมปัจจุบันด้วยตัวเลือกการปรับแต่งที่เลือกไว้",
        savetheme: "บันทึกตัวเลือกการปรับแต่งทั้งหมดเป็นธีมใหม่",
        visibilitybtn: "สลับความเป็นปกติขององค์ประกอบในการแสดงตัวอย่างและการแจ้งเตือนทดสอบ",
        delbtn: "รีเซ็ตองค์ประกอบเป็นค่าเริ่มต้น",
        imgpath: "สถานที่ที่รูปภาพการแจ้งเตือนที่สร้างขึ้นโดยตัวเลือกนี้จะถูกบันทึก",
        checkforupdates: `ตรวจสอบว่าได้มีการปล่อยเวอร์ชันใหม่ของแอปบน GitHub หรือไม่ หากมีการอัปเดตให้ดาวน์โหลดและติดตั้งโดยอัตโนมัติเมื่อได้รับการยืนยันผ่านกล่องโต้ตอบ <span class="hl">อัปเดตที่มีอยู่</span>`,
        linkedgames: `หลีกเลี่ยง <span class="hl">การติดตามกระบวนการอัตโนมัติ</span> สำหรับเกม Steam ที่เฉพาะเจาะจง<br><br><span class="ttdesc">ตัวเลือกนี้ควรใช้เฉพาะในสถานการณ์ที่เฉพาะเจาะจงมากๆ เราไม่ควรจะต้องใช้ตัวเลือกนี้ในสถานการณ์ปกติ!</span>`,
        exclusionlist: `ป้องกันไม่ให้แอปติดตามความสำเร็จในเกม Steam ที่ระบุไว้<br><br><span class="ttdesc">ตัวเลือกนี้ควรใช้เฉพาะในสถานการณ์ที่เฉพาะเจาะจงมากๆ เราไม่ควรจะต้องใช้ตัวเลือกนี้ในสถานการณ์ปกติ!</span>`,
        ovx: "เลื่อนการแจ้งเตือนที่แสดงในภาพหน้าจอตามแนวนอน",
        ovy: "เลื่อนการแจ้งเตือนที่แสดงในภาพหน้าจอตามแนวตั้ง",
        importtheme: `นำเข้าการปรับแต่งผ่าน <span class="hl">ไฟล์ธีมที่สร้างโดยผู้ใช้</span>`,
        exporttheme: `ส่งออก <span class="hl">ธีม</span> ที่เลือกอยู่ในปัจจุบันเพื่อแชร์<br><br><span class="ttdesc">ก่อนพยายามที่จะส่งออก โปรดตรวจสอบให้แน่ใจว่า <span class="hl">ธีม</span> ที่ต้องการได้รับการเลือกแล้ว (ผ่านทางเมนู <span class="hl">เลือกธีม</span>) และยังตรวจสอบให้แน่ใจว่าการปรับแต่งได้รับการบันทึกไว้ใน <span class="hl">ธีม</span> ที่เลือก (ผ่านทางเมนู <span class="hl">บันทึกธีม</span>)<br><br><u>การปรับแต่งใด ๆ ที่ยังไม่ได้รับการบันทึกใน <span class="hl">ธีม</span> ปัจจุบันจะไม่ถูกส่งออก!</u></span>`,
        webhooks: "ใช้ Webhook URL เพื่อโพสต์ในเซิร์ฟเวอร์ Discord ทุกครั้งที่ปลดล็อกความสำเร็จ",
        webhookurl: `ตั้งค่า <span class="hl">Webhook URL</span> สำหรับเซิร์ฟเวอร์ Discord ที่ต้องการ<br><br><span class="ttdesc">URL ของ Webhook ใช้สำหรับโพสต์ในเซิร์ฟเวอร์/ช่อง Discord ในนามของผู้ใช้หรือแอปพลิเคชัน เพื่อตั้งค่า Webhook ใหม่สำหรับเซิร์ฟเวอร์ Discord ผู้ใช้จะต้องมีบทบาทในเซิร์ฟเวอร์ที่ต้องการซึ่งอนุญาตให้สร้าง Webhooks<br><br><u>ต้องใช้ Webhook URL เมื่อใช้ตัวเลือกนี้</u><br><br>ดูเอกสารอย่างเป็นทางการของ Discord สำหรับข้อมูลเพิ่มเติม</span>`,
        webhooktypesmain: `สลับว่าจะแสดงข้อมูลการปลดล็อกความสำเร็จหลักใน Discord เซิร์ฟเวอร์หรือไม่`,
        webhooktypesrare: "สลับว่าจะแสดงข้อมูลการปลดล็อกความสำเร็จหายากใน Discord เซิร์ฟเวอร์หรือไม่",
        webhooktypesplat: "สลับว่าจะแสดงข้อมูลการปลดล็อกความสำเร็จ 100% ใน Discord เซิร์ฟเวอร์หรือไม่",
        unlockmsg: "ตั้งค่าตำแหน่งของข้อความปลดล็อก/ข้อความที่กำหนดเองภายใน $type",
        title: "ตั้งค่าตำแหน่งของชื่อความสำเร็จภายใน $type",
        desc: "ตั้งค่าตำแหน่งของคำอธิบายความสำเร็จภายใน $type",
        notification: "การแจ้งเตือน",
        screenshot: "ภาพหน้าจอ",
        percentpos: "ตั้งค่าตำแหน่งของเปอร์เซ็นต์ความหายากภายใน $type",
        sspercentpos: "ตั้งค่าตำแหน่งของเปอร์เซ็นต์ความหายากภายใน $type",
        hiddeniconpos: "ตั้งค่าตำแหน่งของไอคอนความสำเร็จที่ซ่อน/ลับภายใน $type",
        sshiddeniconpos: "ตั้งค่าตำแหน่งของไอคอนความสำเร็จที่ซ่อน/ลับภายใน $type",
        decorationpos: "ตั้งค่าตำแหน่งขององค์ประกอบการตกแต่งภายใน $type",
        ssdecorationpos: "ตั้งค่าตำแหน่งขององค์ประกอบการตกแต่งภายใน $type",
        percentbadge: "แสดงเปอร์เซ็นต์การปลดล็อคภายในตราสัญลักษณ์ที่ตั้งอยู่เหนือไอคอนความสำเร็จ/เกม",
        sspercentbadge: "แสดงเปอร์เซ็นต์การปลดล็อคภายในตราสัญลักษณ์ที่ตั้งอยู่เหนือไอคอนความสำเร็จ/เกม",
        percentbadgepos: "ตั้งค่าตำแหน่งตราสัญลักษณ์",
        sspercentbadgepos: "ตั้งค่าตำแหน่งตราสัญลักษณ์",
        percentbadgecolor: "ตั้งค่าสีพื้นหลังของตราสัญลักษณ์",
        sspercentbadgecolor: "ตั้งค่าสีพื้นหลังของตราสัญลักษณ์",
        percentbadgefontcolor: "ตั้งค่าสีตัวอักษรของป้าย",
        sspercentbadgefontcolor: "ตั้งค่าสีตัวอักษรของป้าย",
        percentbadgefontsize: "ตั้งค่าขนาดตราสัญลักษณ์",
        sspercentbadgefontsize: "ตั้งค่าขนาดตราสัญลักษณ์",
        percentbadgeroundness: "ตั้งค่าความโค้งของตราสัญลักษณ์",
        sspercentbadgeroundness: "ตั้งค่าความโค้งของตราสัญลักษณ์",
        percentbadgex: "เลื่อนตำแหน่งขององค์ประกอบเหรียญในแนวนอน",
        sspercentbadgex: "เลื่อนตำแหน่งขององค์ประกอบเหรียญในแนวนอน",
        percentbadgey: "เลื่อนตำแหน่งขององค์ประกอบเหรียญในแนวตั้ง",
        sspercentbadgey: "เลื่อนตำแหน่งขององค์ประกอบเหรียญในแนวตั้ง",
        percentbadgeimg: "แสดงไอคอนตามความหายากเป็นองค์ประกอบเหรียญ",
        sspercentbadgeimg: "แสดงไอคอนตามความหายากเป็นองค์ประกอบเหรียญ",
        percentbadgeimgbronze: "ไอคอนเหรียญที่จะแสดงเมื่อเปอร์เซ็นต์การปลดล็อก > 50%",
        sspercentbadgeimgbronze: "ไอคอนเหรียญที่แสดงเมื่อเปอร์เซ็นต์การปลดล็อก > 50%",
        percentbadgeimgsilver: "ไอคอนเหรียญที่แสดงเมื่อเปอร์เซ็นต์การปลดล็อก < 50% และ > $rarity",
        sspercentbadgeimgsilver: "ไอคอนเหรียญที่แสดงเมื่อเปอร์เซ็นต์การปลดล็อก < 50% และ > $rarity",
        percentbadgeimggold: "ไอคอนเหรียญที่แสดงเมื่อเปอร์เซ็นต์การปลดล็อก < $rarity",
        sspercentbadgeimggold: "ไอคอนเหรียญที่แสดงเมื่อเปอร์เซ็นต์การปลดล็อก < $rarity",
        resetpbimgs: "รีเซ็ตไอคอนเหรียญทั้งหมดเป็นค่าเริ่มต้น",
        elemsmatch: `ตรงตามการตั้งค่าองค์ประกอบการแจ้งเตือนที่ตั้งไว้ในตัวปรับแต่งสำหรับประเภทการแจ้งเตือนนี้<br><br><span class="ttdesc">บางพรีเซ็ตการแจ้งเตือนอาจไม่สามารถตรงตามการตั้งค่าตัวปรับแต่งได้อย่างสมบูรณ์ เนื่องจากความแตกต่างระหว่างการแจ้งเตือนบนหน้าจอกับเลย์เอาต์การแจ้งเตือนที่เป็นภาพหน้าจอ</span>`,
        themeswitch: `เปลี่ยนไปยัง <span class="hl">ธีม</span> ที่บันทึกไว้เมื่อมีการตรวจพบเกมเฉพาะ`,
        userthemesync: `ซิงค์การปรับแต่งใน <span class="hl">ธีม</span> ที่เลือกไปยังประเภทการแจ้งเตือนอื่นทั้งหมด`,
        showsystrayopts: `แสดงตัวเลือกทั้งหมดที่มักอยู่ภายใต้ <span class="hl">ถาดระบบ</span> > <span class="hl">ตัวเลือก</span> ใน <span class="hl">การตั้งค่า</span> > <span class="hl">อื่นๆ</span>`,
        releaseshortcut: "ปล่อยเกมที่ติดตามอยู่ด้วยทางลัดคีย์บอร์ดที่กำหนด"
    },
    update: {
        updateavailable: "มีการอัปเดตใหม่",
        sub: [
            `<span id="newversion"></span>`,
            "มีการอัปเดตใหม่สำหรับ Steam Achievement Notifier!",
            `อ่านรายละเอียดการอัปเดตเพิ่มเติมได้ที่ <span id="discordreleasenotes"></span> และ <span id="githubreleasenotes"></span>`
        ],
        update: "อัปเดต"
    },
    linkgame: {
        content: {
            exepath: "เส้นทางของไฟล์เรียกใช้",
            managesub: [
                `เชื่อมโยง <span class="hl">ไฟล์เรียกใช้</span> ของเกมด้วย <span class="hl">AppID</span> ที่ระบุเอง หรือ <span class="hl">ยกเลิกเชื่อมโยง</span> ที่มีอยู่`,
                `Steam Achievement Notifier จะไม่ใช้ <span class="hl">การติดตามกระบวนการโดยอัตโนมัติ</span> สำหรับ <span class="hl">เกมที่เชื่อมโยง</span> ใด ๆ อีกต่อไป - แทนที่จะใช้ <span class="hl">ไฟล์เรียกใช้</span> ที่ระบุเมื่อตรวจพบ <span class="hl">AppID</span> ที่เกี่ยวข้อง`,
                `<span class="hl" id="appidhelp"><u>ฉันจะหา AppID ของเกม Steam ได้อย่างไร?</u></span>`
            ],
            linknew: "เกมที่เชื่อมโยงใหม่",
            linknewsub: [
                `สร้างการเชื่อมโยงใหม่ระหว่าง <span class="hl">ไฟล์เรียกใช้ของเกม</span> และ <span class="hl">AppID</span> ที่เกี่ยวข้อง`,
                `หลังจากสร้างแล้ว สามารถ <span class="hl">ยกเลิกการเชื่อมโยง</span> ผ่านกล่องโต้ตอบ <span class="hl">จัดการเกมที่เชื่อมโยง</span> ก่อนหน้านี้`
            ],
            link: "เชื่อมโยง",
        }
    },
    exclusions: {
        content: {
            managesub: [
                `เพิ่ม <span class="hl">AppID</span> ของเกม Steam ใดๆ เข้าไปใน <span class="hl">รายการยกเว้น</span>`,
                `Steam Achievement Notifier จะไม่พยายามติดตามข้อมูลความสำเร็จสำหรับเกมใดที่มี <span class="hl">AppID</span> ถูกเพิ่มเข้าไปใน <span class="hl">รายการยกเว้น</span>`,
                `<span class="hl" id="appidhelp"><u>ฉันจะหา AppID ของเกม Steam ได้อย่างไร?</u></span>`
            ],
            exclusionnew: "การยกเว้นใหม่",
            exclusionnewsub: [
                `ป้อน <span class="hl">AppID</span> เพื่อเพิ่มลงใน <span class="hl">รายการยกเว้น</span>`
            ]
        }
    },
    notificationelems: {
        title: "องค์ประกอบการแจ้งเตือน",
        content: {
            unlockmsg: "ข้อความปลดล็อก",
            title: "ชื่อความสำเร็จ",
            desc: "คำอธิบายความสำเร็จ",
            hiddeniconpos: "ไอคอนที่ซ่อนอยู่",
            sshiddeniconpos: "ไอคอนที่ซ่อนอยู่",
            decorationpos: "การตกแต่ง",
            ssdecorationpos: "การตกแต่ง",
            percentpos: "เปอร์เซ็นต์ความหายาก",
            sspercentpos: "เปอร์เซ็นต์ความหายาก",
            percentbadge: "ตราสัญลักษณ์เปอร์เซ็นต์",
            sspercentbadge: "ตราสัญลักษณ์เปอร์เซ็นต์",
            percentbadgepos: "ตำแหน่งตราสัญลักษณ์",
            sspercentbadgepos: "ตำแหน่งตราสัญลักษณ์",
            percentbadgecolor: "สีตราสัญลักษณ์",
            sspercentbadgecolor: "สีตราสัญลักษณ์",
            percentbadgefontcolor: "สีตัวอักษรของป้าย",
            sspercentbadgefontcolor: "สีตัวอักษรของป้าย",
            percentbadgefontsize: "ขนาดตราสัญลักษณ์",
            sspercentbadgefontsize: "ขนาดตราสัญลักษณ์",
            percentbadgeroundness: "ความโค้งของตราสัญลักษณ์",
            sspercentbadgeroundness: "ความโค้งของตราสัญลักษณ์",
            percentbadgex: "การเลื่อนในแนวนอน",
            sspercentbadgex: "การเลื่อนในแนวนอน",
            percentbadgey: "การเลื่อนในแนวตั้ง",
            sspercentbadgey: "การเลื่อนในแนวตั้ง",
            percentbadgeimg: "ใช้ไอคอน",
            sspercentbadgeimg: "ใช้ไอคอน",
            percentbadgeimgbronze: "ความหายาก: > 50%",
            sspercentbadgeimgbronze: "ความหายาก: > 50%",
            percentbadgeimgsilver: "ความหายาก: < 50% & > $rarity%",
            sspercentbadgeimgsilver: "ความหายาก: < 50% & > $rarity%",
            percentbadgeimggold: "ความหายาก: < $rarity%",
            sspercentbadgeimggold: "ความหายาก: < $rarity%",
            resetpbimgs: "รีเซ็ตไอคอนเหรียญ",
            elemsmatch: "ตรงตามการตั้งค่าตัวปรับแต่ง"
        }
    },
    themeswitch: {
        content: {
            managesub: [
                `เพิ่ม <span class="hl">AppID</span> ของเกมใด ๆ เพื่อเปลี่ยน <span class="hl">ธีม</span> โดยอัตโนมัติเมื่อถูกตรวจพบ`,
                `สามารถเลือก <span class="hl">ธีม</span> ที่บันทึกไว้สำหรับแต่ละประเภทการแจ้งเตือน พร้อมกับจอแสดงผลที่ต้องการใช้เป็น <span class="hl">แหล่งภาพหน้าจอ</span>`,
                `<span class="hl" id="appidhelp"><u>ฉันจะหาข้อมูล AppID ของเกม Steam ได้อย่างไร?</u></span>`
            ],
            themeswitchnew: "การเปลี่ยนแปลงอัตโนมัติใหม่",
            themeswitchnewsub: [
                `ป้อน <span class="hl">AppID</span> ของเกม พร้อมกับจอแสดงผลที่ต้องการใช้เป็น <span class="hl">แหล่งภาพหน้าจอ</span>`,
                `เลือก <span class="hl">ธีม</span> ที่จะเปลี่ยนไปยังสำหรับแต่ละประเภทการแจ้งเตือนเมื่อตรวจพบ <span class="hl">AppID</span> ของเกมนี้`
            ],
            themes: "ธีม",
            src: "แหล่งภาพหน้าจอ",
            themedeleted: "ลบธีมแล้ว"
        }
    }
}

export const missingdepssub = (opt: string, dep: string) => [
    `ดูเหมือนว่าคุณกำลังพยายามเปิดใช้งานตัวเลือก <span class="hl">${opt}</span> แต่ในระบบ Linux ไม่สามารถเปิดใช้งานการจับภาพหน้าจอได้โดยไม่ติดตั้งแพ็กเกจ <code class="dialogcode">${dep}</code> ก่อน`,
    `กรุณาใช้คำสั่ง <code class="dialogcode" style="user-select: text;">sudo apt-get install ${dep}</code> เพื่อติดตั้งขึ้นก่อน นี้จะทำให้สามารถจับภาพหน้าจอได้บนอุปกรณ์นี้`
]