export const translations = {
    global: {
        main: "Головна",
        semi: "Напів",
        rare: "Рідкісний",
        plat: "100%",
        trophymain: "Бронза",
        trophysemi: "Срібло",
        trophyrare: "Золото",
        trophyplat: "Платина",
        test: "Тестові сповіщення",
        topleft: "Зверху ліворуч",
        topcenter: "Зверху по центру",
        topright: "Зверху праворуч",
        bottomleft: "Знизу ліворуч",
        bottomcenter: "Знизу по центру",
        bottomright: "Знизу праворуч",
        ok: "OK",
        preview: "Попередній перегляд",
        save: "Зберегти",
        back: "Назад",
        edit: "Редагувати",
        lockedby: "Заблоковано $lock",
        settings: "Налаштування",
        appversion: "Версія додатка",
        image: "Зображення",
        audio: "Аудіо",
        folder: "Папка",
        font: "Шрифт",
        select: "Вибрати",
        gametitle: "Назва гри",
        congrats: "Вітаємо!",
        achievementunlocked: "Досягнення розблоковано",
        gamecomplete: "100% завершено",
        achievementdesc: "Клацнули кнопку показу тестового сповіщення",
        gamecompletedesc: "Ви розблокували всі досягнення!",
        defaultcustomfont: "За замовчуванням (Шрифт не вибрано)",
        defaultsoundfile: "За замовчуванням (Файл не вибрано)",
        defaultsounddir: "За замовчуванням (Папка не вибрано)",
        nowtracking: "Зараз відстежується досягнення для:",
        nopreview: "Попередній перегляд недоступний для місцевої операційної системи",
        options: "Опції",
        resetwindow: "Скинути вікно",
        show: "Показати",
        exit: "Вийти",
        donotshowagain: "Більше не показувати це діалогове вікно",
        releasegame: "Звільнити гру",
        releasegamesub: [
            `Перезапустіть фоновий процес Worker і звільніть поточну гру від відстеження`,
            `Спробуйте цю опцію, якщо ви нещодавно закрили гру, але Steam все ще показує її як запущену, або якщо Steam Achievement Notifier все ще показує, що він відстежує гру, яка вже була закрита`
        ],
        noupdateavailable: "Немає доступних оновлень",
        latestversion: "Встановлено останню версію",
        missingdeps: "Відсутня залежність",
        restartapp: "Перезапустити додаток",
        restartappsub: [
            `Якщо речі не працюють правильно, скористайтеся цією опцією, щоб закрити та знову відкрити додаток`,
            `Якщо проблема залишається після перезапуску додатка, будь ласка, подумайте про повідомлення про неї, використовуючи вбудовані посилання на домашньому екрані`
        ],
        suspend: "Призупинити",
        resume: "Продовжити",
        new: "Новий...",
        nodata: "Немає даних",
        findappid: "Знайти AppID",
        findappidsub: [
            `Кожна гра Steam має унікальний номер, пов'язаний з нею - називається <span class="hl">AppID</span>. Ви можете знайти AppID, пов'язаний з будь-якою грою Steam, перевіривши один із наступних способів:`,
            `У <span class="hl">клієнті Steam</span>, клацніть правою кнопкою миші на гру у своїй <span class="hl">бібліотеці</span> та виберіть <i>Властивості</i> > <i>Оновлення</i> - тут буде перелічено AppID`,
            `URL сторінки <span class="hl">магазину</span> гри - це буде номер, вказаний після <span class="hl">app/</span>: <code class="appidhelpcode">https://store.steampowered.com/app/<span class="hl">4000</span></code>`,
            `Веб-сайти, такі як <span class="hl">SteamDB</span> - розділ <span class="hl">Інформація про Додаток</span> буде перелічувати AppID для кожної гри`
        ],
        noexe: "Файл EXE гри не знайдено!",
        noexesub: "Натисніть тут для отримання додаткової інформації",
        noexedialogsub: [
            `Steam Achievement Notifier не зміг автоматично знайти виконуваний файл для цієї гри. Розташування виконуваного файлу гри необхідне для того, щоб мати можливість "звільнити" гру після її закриття`,
            `Щоб вручну звільнити гру після її закриття, <i>клацніть правою кнопкою миші</i> по <span class="hl">значку в Системному треї</span> > <span class="hl">Параметри</span> > <span class="hl">Звільнити Гру</span>, або скористайтеся <span class="hl">Комбінацією клавіш для Звільнення Гри</span>`,
            `Або ж натисніть кнопку <span class="hl">Додати</span> нижче, щоб додати виконуваний файл, пов’язаний з будь-яким вікном у фокусі, до <span class="hl">Налаштування</span> > <span class="hl">Ігри</span> > <span class="hl">Ігри з Автоматичним Звільненням</span>`,
        ],
        autorelease: "Автоматичне Звільнення Гри",
        autoreleasesub: [
            `Якщо після закриття вікна гри Steam усе ще показує гру як <i>У процесі гри</i>, спробуйте додати новий запис до <span class="hl">Ігри з Автоматичним Звільненням</span>`,
            `Щоб зробити це для поточної гри, натисніть кнопку <span class="hl">Додати</span> нижче, щоб додати виконуваний файл, пов’язаний з будь-яким вікном у фокусі, до <span class="hl">Налаштування</span> > <span class="hl">Ігри</span> > <span class="hl">Ігри з Автоматичним Звільненням</span>`,
        ],
        linkgamehelplink: `<span class="hl help" id="linkgamehelp"><u>Що відбувається, коли я натискаю кнопку Додати?</u></span>`,
        linkgamehelp: "Додати Запис через Фокус",
        linkgamehelpsub: [
            `Натискання кнопки <span class="hl">Додати</span> автоматично додасть новий запис до <span class="hl">Налаштування</span> > <span class="hl">Ігри</span> > <span class="hl">Ігри з Автоматичним Звільненням</span>, використовуючи інформацію з поточного вікна у фокусі.`,
            `Після натискання кнопки <span class="hl">Додати</span> розпочнеться 5-секундний таймер`,
            `До завершення таймера наведіть фокус на вікно гри`,
            `Після завершення таймера буде додано новий запис для поточного <span class="hl">AppID</span> до <span class="hl">Налаштування</span> > <span class="hl">Ігри</span> > <span class="hl">Ігри з Автоматичним Звільненням</span>, використовуючи виконуваний файл, пов’язаний з вікном у фокусі`,
            `Нові спроби перезапишуть наявні записи, або ж запис можна видалити через <span class="hl">Налаштування</span> > <span class="hl">Ігри</span> > <span class="hl">Ігри з Автоматичним Звільненням</span>, натиснувши кнопку <span id="linkhelpunlink"></span>`
        ],
        addlinkfailed: "Не вдалося додати вікно",
        addlinkfailedsub: `Натисніть кнопку <span class="hl">Додати</span>, щоб спробувати ще раз`,
        webhookunlockmsg: "$user розблокував досягнення",
        webhookunlockmsgplat: "$user розблокував усі досягнення",
        webhookingame: "в $gamename",
        notconnected: "Не підключено",
        raloghelp: "Мою гру не виявлено",
        raenablelog: `Файли журналів емулятора`,
        raenablelogsub: [
            `Для доступу до внутрішніх подій гри (таких як поточний статус гри, інформація про досягнення тощо), необхідно увімкнути логування в зовнішній <span class="hl">log файл</span> <u>вибраних емулаторів</u>.<br><br>Усі вибрані емулатори <u>повинні використовувати цей <span class="hl">log файл</span></u> як значення <span class="hl">Шлях до Log файлу</span>.`,
            `<details>
                <summary id="retroarch">RetroArch</summary>
                <div>
                    <span class="hl">RetroArch > Налаштування > Логування</span> повинно бути налаштоване за такими параметрами:
                    <br>
                    <ul>
                        <li><span class="hllb">Рівень детальності логування</span>: <span class="hlgreen">УВІМК.</span></li>
                        <li><span class="hllb">Рівень логування фронтенду</span>: <span class="hlgreen">1 (Інформація)</span></li>
                        <li><span class="hllb">Логування в файл</span>: <span class="hlgreen">УВІМК.</span></li>
                        <li><span class="hllb">Часова мітка для лог-файлів</span>: <span class="hlred">ВИМК.</span></li>
                    </ul>
                    <br>
                    За умовчанням, лог файл <span class="hl">"retroarch.log"</span> зберігається в:
                    <br>
                    <ul>
                        <li><span class="hllb">%SYSTEMDRIVE%\\RetroArch-Win64\\Logs</span></li>
                    </ul>
                </div>
            </details>`,
            `<details>
                <summary id="dolphin">Dolphin</summary>
                <div>
                    <span class="hl">Dolphin > Перегляд > Показати налаштування журналу</span> повинно бути налаштоване за такими параметрами:
                    <br>
                    <ul>
                        <li><span class="hllb">Рівень детальності</span>: <span class="hlgreen">Інформація</span></li>
                        <li><span class="hllb">Виведення журналу</span> > <span class="hlgreen">Запис в файл</span></li>
                        <li><span class="hllb">Типи журналів</span> > <span class="hlgreen">Досягнення (RetroAchievements)</span></li>
                    </ul>
                    <br>
                    За умовчанням, лог файл <span class="hl">"dolphin.log"</span> зберігається в одному з наступних місць:
                    <br>
                    <ul>
                        <li><span class="hllb">%APPDATA%\\Dolphin Emulator\\Logs</span></li>
                        <li><span class="hllb">%USERPROFILE%\\Documents\\Dolphin Emulator\\Logs</span></li>
                        <li>🐧 <span class="hllb">$XDG_DATA_HOME/dolphin-emu/Logs</span></li>
                    </ul>
                </div>
            </details>`,
            `<details>
                <summary id="pcsx2">PCSX2</summary>
                <div>
                    <span class="hl">PCSX2 > Інструменти > Увімкнути запис у файл</span> повинно бути увімкнено
                    <br>
                    <br>
                    За умовчанням, <span class="hl">"emulog.txt"</span> зберігається за адресою:
                    <br>
                    <ul>
                        <li><span class="hllb">%USERPROFILE%\\Documents\\PCSX2\\Logs</span></li>
                    </ul>
                </div>
            </details>`,
            `<details>
                <summary id="duckstation">Duckstation</summary>
                <div>
                    <ul style="background-color: var(--primary); outline: 0.1rem solid red;">
                        <li>❗ <span class="dialogcode" style="background-color: var(--mediumgrey);">RA_Integration-x64.dll</span> має бути <span class="hl help" url="https://retroachievements.org/bin/RA_Integration-x64.dll"><u>завантажено</u></span> і переміщено до <span class="hl">каталогу встановлення Duckstation</span></li>
                    </ul>
                    <br>
                    <span class="hl">Duckstation > Налаштування > Досягнення > RAIntegration (тільки для розробників)</span> має бути увімкнено
                    <br>
                    <br>
                    За умовчанням, <span class="hl">"RALog.txt"</span> зберігається в:
                    <br>
                    <ul>
                        <li><span class="hllb">%USERPROFILE%\\Downloads\\duckstation-windows-x64-release\\RACache</span></li>
                    </ul>
                </div>
            </details>`,
            `<details>
                <summary id="dolphin">PPSSPP</summary>
                <div>
                    <span class="hl">PPSSPP > Settings > Developer Tools > General > Log to File</span> має бути ввімкнено та налаштовано з такими параметрами:
                    <br>
                    <ul>
                        <li><span class="hllb">Achievements</span>: <span class="hlgreen">Info</span></li>
                    </ul>
                    <br>
                    За стандартних параметрів встановлення <span class="hl">"log.txt"</span> зберігається в:
                    <br>
                    <ul>
                        <li><span class="hllb">%PROGRAMFILES%\\PPSSPP\\PSP\\memstick\\PSP\\SYSTEM\\DUMP</span></li>
                    </ul>
                </div>
            </details>`
        ],
        betaunsupported: "Не підтримується Beta-версія",
        betaunsupportedsub: [
            "Вийшла нова версія Steam Achievement Notifier!",
            `<u>Ця Beta-версія більше не підтримується</u>. Будь ласка, завантажте та встановіть останню офіційну версію через Github, використовуючи кнопку <span class="hl">Releases</span> нижче.`,
            "Дякуємо за тестування! 💜"
        ],
        betaghreleases: "Випуски",
        checkapplog: "Будь ласка, перевірте журнал додатку для деталей."
    },
    app: {
        content: {
            game: "Гру не виявлено",
            customise: "Налаштувати",
            test: "Показати тестове сповіщення"
        }
    },
    settings: {
        language: {
            title: "Мова",
            content: {
                steamlang: "Перекласти досягнення на мову Steam",
                maxsteamlangretries: "Максимальна кількість спроб перекладу"
            }
        },
        os: {
            title: "Операційна система",
            content: {
                desktop: "Створити ярлик на робочому столі",
                startwin: "Стартувати при вході",
                startmin: "Мінімізувати запуск",
                nohwa: "Вимкнути апаратне прискорення",
                litemode: "Легкий режим"
            }
        },
        notifications: {
            title: "Сповіщення",
            content: {
                rarity: "Відсоток рідкості",
                semirarity: "Відсоток срібла",
                rareonly: "Тільки рідкі",
                all: "Всі",
                off: "Вимк.",
                showpercent: "Показати відсоток",
                soundonly: "Тільки звук",
                nowtracking: "Показати сповіщення про відстеження",
                nowtrackingscale: "Шкала відстеження",
                nowtrackingpos: "Позиція відстеження",
                shortcuts: "Сповіщення ярлики",
                noiconcache: "Вимкнути кеш іконок",
                webhooks: "Опублікувати на сервері Discord",
                webhooktypes: "Типи Webhook",
                webhookurl: `URL Webhook`,
                webhookcaution: `Активуючи цю опцію і надаючи дійсне посилання Webhook Discord, ви підтверджуєте, що розумієте, що <u>вся інформація про досягнення та ігри для поточного користувача Steam</u> буде опублікована на зазначеному сервері Discord через надане посилання Webhook.<br><br>Якщо ви не хочете, щоб Steam Achievement Notifier публікував цю інформацію від вашого імені, будь ласка, вимкніть цю опцію.`,
                webhooklaststatus: "Останній статус",
                webhookspoilers: `Додати тег спойлер`,
                webhookappid: `Показати AppID`,
                replaynotify: "Повторне сповіщення",
                replaynotifyshortcut: "Швидкий доступ для повторення",
                customtrigger: "Користувацький Тригер",
                customtriggershortcut: "Швидка Клавіша Тригера",
                customtriggerdelay: "Затримка Тригера",
                customtriggerusedisplaytime: "Використовувати Час Відображення",
                trophymode: "Режим трофеїв",
                notifymax: "Максимальна кількість сповіщень", 
                notifyspace: "Відстань між сповіщеннями",
                notify1line: "Обмежити текст до 1 рядка"
            }
        },
        games: {
            title: "Ігри",
            content: {
                linkedgames: "Ігри з Автоматичним Звільненням",
                themeswitch: "Автоматично перемикати теми",
                exclusionlist: "Список виключень",
                inclusionlist: "Список включень",
                listmode: "Режим списку",
                exclusion: "Виключення",
                inclusion: "Включення"
            }
        },
        media: {
            title: "Медіа",
            content: {
                steamss: "Зробити знімок екрану Steam",
                screenshots: "Додаткове медіа",
                off: "Вимкн.",
                ssonly: "Тільки знімок екрана",
                overlay: "Снимок екрана з наложенням сповіщення",
                monitors: "Джерело знімка екрана",
                hdrmode: "Режим HDR",
                ovpos: "Позиція накладання",
                ovmatch: "Співпадіння з користувачем встановленої позиції",
                ovx: "Горизонтальне зміщення",
                ovy: "Вертикальне зміщення",                
                ovpath: "Шлях знімка екрана",
                ssdelay: "Затримка знімка екрана",
                notifyimg: "Зображення повідомлення",
                imgpath: "Шлях до зображення",
                ssenabled: "Увімкнути",
                ssmode: "Режим знімка екрану",
                screen: "Екран",
                window: "Вікно",
                rauseemudir: "Зберігати в підпапку емулятора",
                ssext: "Формат знімка екрана",
                png: "PNG",
                jpg: "JPG",
                ssaddtosteam: "Додати до Steam"
            }
        },
        streaming: {
            title: "Трансляція",
            content: {
                extwin: "Сповіщення про потік",
                extwinframerate: "Частота кадрів",
                extwinshow: "Показати вікно",
                audiosrc: "Джерело аудіо",
                notify: "Повідомити",
                app: "Додаток",
                off: "Вимкнено",
                statwin: "Вікно статистики досягнень",
                statwinaot: "Завжди зверху",
                noachievements: "Немає досягнень для відображення",
                startgame: "Запустіть гру, щоб показати досягнення!",
                max: "Макс.",
                custom: "Індивідуальне...",
                statwinshortcut: "Гарячі клавіші накладення",
                gametimerwin: "Таймер завершення гри",
                gametimerwinshortcut: "Комбінація клавіш для таймера",
                gametimerwinaot: "Завжди поверх",
                resetgametimer: "Скинути таймер",
                resetgametimersub: `
                    <div class="wrapper resetsub">
                        <span>Ви впевнені?</span>
                        <span>Це скине Таймер завершення гри для поточної гри назад до 00:00:00.000.</span>
                        <span class="noundo">🛑 Це неможливо скасувати!</span>
                    </div>
                `,
                resetgametimerfailed: "Не вдалося скинути таймер.",
                resetgametimercomplete: "AppID $appid вже було завершено.",
                extwinnotify: "Показувати сповіщення на екрані"
            }
        },
        accessibility: {
            title: "Доступність",
            content: {
                noanim: "Вимкнути анімацію вікна додатка",
                noupdatedialog: "Вимкнути діалогове вікно оновлення",
                nvda: "Увімкнути підтримку NVDA",
                tooltips: "Показати підказки",
                showsystrayopts: "Показати параметри системного лотка",
                releaseshortcut: "Швидкий запуск гри",
                noshortcuts: "Вимкнути комбінації клавіш"
            }
        },
        advanced: {
            title: "Розширені",
            content: {
                pollrate: "Частота опитування",
                initdelay: "Затримка відстеження",
                releasedelay: "Затримка випуску",
                maxretries: "Максимальна кількість спроб обробки",
                debug: "Панель відлагодження",
                userust: "Альтернативний режим обробки",
                notifydebug: "Показувати сповіщення про налагодження",
                exportachdata: "Експортувати дані досягнень",
                lognum: "Попередні файли журналів", 
                audiocooldown: "Затримка звуку",
                usecustomfiles: "Використовувати користувацькі файли додатка",
                showcustomfiles: "Показувати користувацькі файли додатка",
                appdatadir: "Показати папку AppData",
                backup: "Резервне копіювання",
                backuppath: "Шлях резервного копіювання",
                backupsub: [
                    "Створіть резервну копію вмісту папки AppData додатку у вибраному місці",
                    "Ця резервна копія слугуватиме точкою відновлення для поточного стану додатку",
                    `Відновіть будь-яку попередню резервну копію через <span class="hl">Налаштування</span> > <span class="hl">Розширені</span> > <span class="hl">Відновити</span>`
                ],
                backupfailed: "Не вдалося створити резервну копію.",
                restore: "Відновити",
                restoresub: [
                    "Відновіть вміст папки AppData додатку з попередньої резервної копії",
                    `Виберіть файл резервної копії <span class="hl">.sanbak</span> для відновлення. Цей файл буде збережений після завершення відновлення`,
                    "❗ Після підтвердження додаток перезавантажиться, щоб відновити обраний файл резервної копії"
                ],
                restorefailed: "Не вдалося відновити резервну копію.",
                usesanwatcher: "SANWatcher",
                releasewaittime: "Час очікування перед вивільненням"
            }
        },
        ra: {
            title: "Retro Achievements",
            content: {
                raemus: "Емулатори",
                rauser: "Ім'я користувача",
                rakey: "API ключ",
                retroarch: "RetroArch",
                dolphin: "Dolphin",
                pcsx2: "PCSX2",
                duckstation: "Duckstation",
                ppsspp: "PPSSPP",
                installdir: "Шлях до файлу журналу",
                rapercenttype: "Тип відсотка",
                hard: "Hardcore",
                soft: "Softcore",
                placeholder: "Введіть шлях до файлу журналу",
                logfile: "Log файл",
                status: "Статус",
                game: "Гра",
                lastachievement: "ID останнього досягнення",
                wait: "Очікування емулятора",
                idle: "Очікування події в грі",
                start: "Запуск гри",
                stop: "Зупинка гри",
                achievement: "Досягнення розблоковано"
            }
        },
        misc: {
            title: "Різне",
            content: {
                colorprofile: "Колірний профіль",
                checkforupdates: "Перевірити оновлення",
                log: "Журнал додатка",
                reset: "Скинути додаток"
            }
        }
    },    
    customiser: {
        preset: {
            title: "Попереднє налаштування",
            content: {
                preset: "Попереднє сповіщення",
                iconanim: "Рідкісна анімація значка",
                alldetails: "Показати всі деталі",
                usepercent: "Використовувати відсоток",
                displaytime: "Час відображення",
                scale: "Масштаб",
                customtext: "Власний текст",
                usegametitle: "Використовувати назву гри",
                customfont: "Власний шрифт"
            }
        },
        sound: {
            title: "Звук",
            content: {
                soundmode: "Режим звуку",
                file: "Файл",
                folder: "Випадковий",
                soundfile: "Звуковий файл",
                sounddir: "Каталог звуків",
                volume: "Гучність"
            }
        },
        style: {
            title: "Стиль",
            content: {
                bgstyle: "Стиль фону",
                solid: "Однотонний",
                gradient: "Градієнт",
                img: "Зображення",
                gameart: "Мистецтво гри",
                gradientangle: "Кут градієнта",
                bgimg: "Зображення фону",
                bgachicon: "Використовувати іконку досягнення",
                bgimgbrightness: "Яскравість",
                brightness: "Яскравість",
                blur: "Розмиття",
                roundness: "Круглість",
                fontsize: "Розмір шрифту",
                usecustomfontsizes: "Використовувати власні розміри шрифтів",
                unlockmsgfontsize: "Повідомлення про розблокування",
                titlefontsize: "Заголовок",
                descfontsize: "Опис",
                textvspace: "Проміжок між текстами",
                opacity: "Непрозорість",
                bgonly: "Тільки фон",
                glow: "Світіння",
                glowcolor: "Колір",
                glowsize: "Розмір",
                glowx: "Горизонтальне зміщення",
                glowy: "Вертикальне зміщення",
                glowopacity: "Непрозорість",
                glowanim: "Анімація",
                glowspeed: "Швидкість",
                glowrarity: "Використовувати рідкість",
                glowcolorbronze: "Рідкість: > $semirarity",
                glowcolorsilver: "Рідкість: < $semirarity & > $rarity",
                glowcolorgold: "Рідкість: < $rarity",
                off: "Вимкнено",
                pulse: "Пульсація",
                double: "Подвійний",
                focus: "Фокус",
                orbit: "Орбіта",
                fluorescent: "Флуоресцентний",
                rainbow: "Веселка",
                mask: "Маска",
                maskimg: "Зображення маски",
                useoutline: "Контур",
                outline: "Тип контуру",
                outlinecolor: "Колір контуру",
                outlinewidth: "Ширина контуру",
                dashed: "Штриховий",
                dotted: "Пунктирний"
            }
        },
        colors: {
            title: "Кольори",
            content: {
                primarycolor: "Основний колір",
                secondarycolor: "Другорядний колір",
                tertiarycolor: "Третинний колір",
                iconshadowcolor: "Колір тіні рідкісної іконки",
                iconanimcolor: "Колір анімації рідкісної іконки",
                fontcolor: "Колір шрифту",
                usecustomfontcolors: "Використовувати власні кольори шрифту",
                unlockmsgfontcolor: "Колір 1",
                titlefontcolor: "Колір 2",
                descfontcolor: "Колір 3",
                fontoutline: "Контур шрифту",
                fontoutlinecolor: "Колір контуру шрифту",
                fontoutlinescale: "Масштаб контуру шрифта",
                fontshadow: "Тінь шрифту",
                fontshadowcolor: "Колір тіні шрифту",
                fontshadowscale: "Масштаб тіні шрифта",
                fontshadowx: "Горизонтальне зміщення",
                fontshadowy: "Вертикальне зміщення"
            }
        },
        icons: {
            title: "Іконки",
            content: {
                iconscale: "Масштаб іконки",
                iconroundness: "Круглість іконки",
                showiconborder: "Показати рамку значка",
                iconborderimg: "Рамка значка",
                iconborderpos: "Розташування рамки",
                iconborderscale: "Масштаб рамки",
                iconborderx: "Горизонтальне зміщення",
                iconbordery: "Вертикальне зміщення",
                iconborderrarity: "Використовувати рідкість",
                iconborderimgbronze: "Рідкість: > $semirarity",
                iconborderimgsilver: "Рідкість: < $semirarity & > $rarity",
                front: "Спереду",
                back: "Позаду",
                plat: "Логотип 100%",
                usegameicon: "Використовувати іконку гри",
                gameicontype: "Тип іконки гри",
                usecustomimgicon: "Використовувати користувацьку іконку",
                customimgicon: "Користувацька іконка",
                icon: "Іконка",
                logo: "Логотип",
                logoscale: "Масштаб логотипу",
                decoration: "Декорація",
                decorationscale: "Масштаб декорацій",
                showdecoration: "Показати декорацію",
                rarity: "Рідкість",
                showhiddenicon: "Показати приховану іконку",
                hiddenicon: "Прихована іконка",
                replacelogo: "Замінити Логотип"
            }
        },
        position: {
            title: "Позиція",
            content: {
                pos: "Позиція на екрані",
                usecustompos: "Використовувати власну позицію",
                setcustompos: "Встановити",
                copycustompos: "Застосувати до всіх",
                resetcustompos: "Скинути"
            }
        },
        theme: {
            title: "Тема",
            content: {
                updatetheme: "Оновити Тему",
                savetheme: "Зберегти тему",
                sub: [
                    `Збережені <span class="hl">Теми користувача</span> можна вибрати з меню <span class="hl">Вибрати тему</span> на головному екрані.`,
                    `Переконайтеся, що <span class="hl">Назва теми</span> є <u>унікальною</u> - назва, яка відповідає існуючій темі, <u>перезапише попередню</u>!`
                ],
                placeholder: "Назва теми",
                theme: "Тема",
                importtheme: "Імпортуйте тему",
                import: "Імпортувати",
                importsub: [
                    `Імпортуйте створений користувачем <span class="hl">файл теми</span>`,
                    `Імпортовані <span class="hl">теми</span> будуть автоматично завантажені після успішного імпортування і можуть бути вибрані з меню <span class="hl">Вибрати тему</span>`,
                ],
                importidle: `Виберіть <span class="hl">файл теми</span> для імпорту`,
                importcopied: `Тему успішно скопійовано`,
                importrenamed: `Тему успішно перейменовано`,
                importextracted: `Тему успішно вилучено`,
                importrewriting: `Переписування шляхів файлів теми...`,
                importconverting: `Конвертування теми...`,
                importcreating: `Створення теми...`,
                importdone: `Тему успішно імпортовано`,
                importfailed: `Помилка імпортування вибраного файлу теми!`,
                exporttheme: "Експортуйте тему",
                export: "Експортувати",
                exporterrortitle: "Помилка експорту",
                exporterrorsub: [
                    "Виникла помилка під час спроби експорту вибраної теми",
                    `Спробуйте зберегти поточну тему (<i>через <span class="hl">Зберегти тему</span></i>) і спробуйте експортувати знову`,
                    `Якщо проблема не зникне, будь ласка, скопіюйте помилку нижче та повідомте про неї через кнопки посилання на <span class="hl">Головному екрані</span>`
                ],
                synctheme: "Синхронізація теми",
                syncedwith: "Синхронізовано з",
                themeselect: "Вибрана тема",
                copytheme: "Копіювати тему",
                copythemesub: "Виберіть тип(и) сповіщень, до яких потрібно скопіювати вибрану тему"
            }
        }
    },
    logwin: {
        content: {
            tagline: "Ось що відбулося з моменту запуску додатка:",
            copylog: "Копіювати вміст журналу"
        }
    },
    reset: {
        content: {
            sub: `
                <div class="wrapper" id="resetsub">
                    <span>Ви впевнені?</span>
                    <span>Всі раніше налаштовані дані, <u>включаючи Користувацькі налаштування</u>, будуть скинуті до значень за замовчуванням.</span>
                    <span>🛑 Цю дію неможливо скасувати!</span>
                </div>
            `,
            reset: "Скинути"
        }
    },
    error: {
        content: {
            subtitle: "Додаток Steam Achievement Notifier стикнувся з проблемою і потребує закриття.",
            details: "Ось деталі помилки:",
            sub: "Натисніть кнопки нижче, щоб повідомити про цю проблему через обрану вами платформу.",
            report: "Повідомити",
            log: "Журнал додатка",
            exit: "Вихід"
        }
    },
    tooltips: {
        game: "Гра, для якої відстежуються досягнення",
        usertheme: "Виберіть раніше збережену тему",
        customise: "Налаштування сповіщень про досягнення",
        test: "Показати тестове сповіщення з усіма налаштуваннями",
        kofi: "Пожертвувати на Ko-Fi!",
        discord: "Приєднуйтесь до Discord!",
        github: "Повідомити про проблему",
        lang: "Виберіть мову користувальницького інтерфейсу, яка використовується в додатку",
        steamlang: `Спробуйте завантажити переклади, що знаходяться у файлах програми Steam, щоб відобразити інформацію про досягнення на мові, обраній користувачем у клієнті Steam<br><br><span class="ttdesc">Цей параметр намагається знайти переклади у JSON-файлі, збереженому у даних програми Steam. Якщо переклад для поточного досягнення не знайдено, буде відображена інформація про досягнення, отримана з Steamworks.</span>`,
        maxsteamlangretries: `Кількість спроб (кожні 100 мс) для пошуку дійсних перекладів для поточного досягнення<br><br><span class="ttdesc">Steam наразі зберігає лише невелику кількість даних про досягнення у JSON-файлі, пов'язаному з кожною грою. Будь-які досягнення, яких немає у цьому файлі, будуть додані після розблокування досягнення.<br><br>Оскільки додавання нових даних може зайняти час, збільшення цього значення підвищить ймовірність знаходження даних перекладу для поточного досягнення, але також може затримати відображення сповіщення на екрані на час, розрахований за цією налаштуванням.<br><br>Якщо не вдається знайти дійсні дані перекладу для поточного досягнення, переклад повернеться до мови, зазначеної в Steamworks.</span>`,
        desktop: "Перемикнути ярлик на робочому столі для запуску додатку",
        startwin: "Автоматичний запуск Steam Achievement Notifier після входу в систему",
        startmin: "При запуску приховувати вікно інтерфейсу додатку, поки воно не буде відкрите зі Системного трею",
        nohwa: `Вимкніть апаратне прискорення, що може покращити продуктивність на системах з обмеженими ресурсами або системах без відведеного GPU<br><br><span class="ttdesc">Додаток перезапуститься після включення/виключення цієї опції</span>`,
        litemode: "Вимкнути всі інтерактивні елементи інтерфейсу, забезпечуючи обмежену функціональність додатку через іконку Системного трею. Це може покращити використання ресурсів додатком",
        rarity: `Відсоток, при якому спрацьовують сповіщення про рідкі досягнення.<br><br>Будь-яке досягнення з відсотком розблокування вище цього значення відображатиметься як основне сповіщення<br><br><span class="ttdesc">Якщо увімкнено <span class="hl">Режим трофеїв</span>, будь-яке досягнення з відсотком розблокування вище цього значення відображатиметься як срібне сповіщення</span>`,
        semirarity: `Відсоток, при якому відображаються елементи сповіщень "Срібло" (наприклад, <span class="hl">значки рідкості</span>, <span class="hl">прикраси</span> тощо).<br><br>Будь-яке досягнення з відсотком розблокування нижче (або рівним) цьому значенню і вище за значення <span class="hl">відсотка рідкості</span> відображатиме елементи сповіщень, налаштовані для рідкості "Срібло".<br><br>Будь-яке досягнення з відсотком розблокування вище цього значення відображатиме елементи сповіщень, налаштовані для рідкості "Бронза"<br><br><span class="ttdesc">Якщо увімкнено <span class="hl">Режим трофеїв</span>, будь-яке досягнення з відсотком розблокування вище цього значення відображатиметься як бронзове сповіщення</span>`,
        showpercent: "Відображати відсоток розблокування досягнення в сповіщенні для вибраних типів",
        soundonly: "Вимкнути сповіщення, відтворюючи лише звуки, встановлені через Налаштування",
        extwin: "Створіть вікно, яке дублює всі сповіщення, що наразі відображаються на екрані. Це вікно можна додати як джерело захоплення вікна для використання в програмному забезпеченні для трансляцій, наприклад, OBS",
        extwinframerate: "Встановити цільову частоту кадрів для сповіщень потоку",
        extwinshow: `Перемикання видимості вікна сповіщень трансляції<br><br><span class="ttdesc">Коли воно фокусоване на панелі завдань, утримуйте клавішу <code class="ttcode">Ctrl</code>, щоб відобразити поточне розташування вікна</span>`,
        audiosrc: "Виберіть джерело (або вимкніть) звуку, створеного додатком",
        nowtracking: "Відображати сповіщення, що повідомляє користувача про відстеження досягнень для запущеної гри",
        nowtrackingscale: `Встановіть розмір сповіщення про відстеження`,
        nowtrackingpos: `Встановіть позицію повідомлення про відстеження`,
        shortcuts: "Запуск тестового сповіщення за допомогою гарячих клавіш. Гарячі клавіші можна налаштувати для кожного типу сповіщення",
        noiconcache: `Вимикає кешування іконок досягнень при запуску ігор.<br><br><span class="ttdesc">Це може значно покращити продуктивність додатка при запуску ігор і також вирішити проблеми з відстеженням в іграх, які мають велику кількість досягнень. Однак у рідких випадках вимкнення кешування іконок може призвести до відсутності іконок досягнень у сповіщеннях</span>`,
        steamss: "Зробити знімок екрана Steam при розблокуванні досягнення",
        screenshots: "Виберіть тип додаткових медіафайлів, які будуть створені при відображенні сповіщення",
        monitors: "Монітор, який буде захоплено при знімку екрана",
        hdrmode: `Зробити знімки екрану за допомогою методу, сумісного з моніторами, які підтримують технологію High Dynamic Range (HDR)`,
        ovpos: "Позиція накладання сповіщення на знімку екрана",
        ovmatch: "Відповідність позиції екрана, встановленої в Налаштуваннях, для цього типу сповіщення",
        ovpath: "Місце збереження знімків, створених цією опцією",
        ssdelay: "Затримка від моменту виникнення сповіщення до знімку екрана",
        sspreview: "Показати попередній перегляд того, як буде виглядати збережений знімок екрана",
        noanim: "Вимкнути всі анімації та ефекти переходу вікон додатку",
        noupdatedialog: `Запобігає автоматичному відображенню і фокусуванню діалогового вікна <span class="hl">Доступні оновлення</span><br><br><span class="ttdesc">Діалогове вікно все ще можна відкрити, натиснувши кнопку оновлення, коли вона доступна</span>`,
        nvda: "Увімкнути копіювання інформації про досягнення в буфер обміну при розблокуванні досягнення для подальшого читання програмним забезпеченням для читання екрана, таким як NVDA",
        tooltips: "Відображати підказки при наведенні на певні елементи інтерфейсу",
        colorprofile: `Примусово застосувати вибраний колірний профіль для всіх вікон додатка<br><br><span class="ttdesc">Потрібен перезапуск додатка</span>`,
        pollrate: `Встановіть інтервал оновлення для даних досягнень під час гри<br><br><span class="ttdesc">Продуктивність може збільшитися/зменшитися в залежності від значення або апаратного забезпечення системи. Вищі значення зазвичай призводять до меншого навантаження на систему, але можуть затримувати сповіщення</span>`,
        initdelay: `Встановіть затримку між виявленням поточного <span class="hl">AppID</span> та початком відстеження процесів/досягнень<br><br><span class="ttdesc">Збільшення цього значення може уникнути ситуацій, коли Steam не може запустити поточну гру (через ініціалізацію додатка в Steamworks перед запуском гри)</span><br><br><span class="ttdesc">Також збільшення цього значення можна використовувати для обходу неправильного виявлення процесів перед запуском гри</span>`,
        releasedelay: `Налаштуйте, як довго фоновий процес Worker чекатиме перед перезапуском після звільнення поточної гри. Впливає як на автоматичне відстеження процесів, так і на Ігри з Автоматичним Звільненням<br><br><span class="ttdesc">Дозволяє довший часовий інтервал для повного звільнення Steamworks з програми. Збільшення цього значення може запобігти незвичній поведінці, наприклад відстеженню раніше закритої гри</span>`,
        maxretries: `Налаштуйте максимальну кількість повторних спроб пов’язати запущений процес із виявленим AppID. Впливає як на автоматичне відстеження процесів, так і на Ігри з Автоматичним Звільненням<br><br><span class="ttdesc">Повторні спроби виконуються раз на секунду. Якщо запущений процес не буде пов’язаний з поточним AppID після цієї кількості спроб, буде повернено недійсний процес. У таких випадках гру потрібно звільнити вручну через Системний трей > Параметри > Звільнити Гру</span>`,
        debug: "Відкрийте панель відлагодження, яка відображає детальну інформацію про відстеження процесів",
        userust: "Використовуйте альтернативну функцію на основі Rust, щоб перевірити, чи в даний момент запущені відстежені ігрові процеси на системі. Коли не позначено, буде використано стандартний контроль процесів на основі NodeJS.",
        notifydebug: "Створити вікно DevTools для всіх сповіщень. Корисно для відладки/вирішення проблем сповіщень",
        usecustomfiles: "Увімкнути завантаження користувацьких файлів для сповіщень. Рекомендується обережність для звичайних користувачів",
        showcustomfiles: "Відкрити розташування користувацьких файлів",
        log: "Відкрити вікно журналу додатка, яке відображає інформацію про активність процесу, попередження та помилки",
        reset: "Видалити всі дані конфігурації та перезапустити додаток",
        playback: "Призупинити/продовжити анімацію попереднього перегляду сповіщення",
        replay: "Перезапустити анімацію попереднього перегляду сповіщення",
        preset: "Виберіть шаблон сповіщення для налаштування",
        iconanim: "Перемкнути рамку та анімацію рідкісної іконки",
        alldetails: "Відображати всі текстові елементи в сповіщенні, включаючи ті, які за замовчуванням приховані для цього шаблону",
        usepercent: "Показати відсоток відкриття досягнення замість значення XP/S",
        displaytime: "Встановити кількість секунд, протягом яких буде відображатися сповіщення",
        scale: "Збільшити або зменшити розмір сповіщення",
        customtext: "Встановити користувацьке повідомлення, яке буде відображатися в сповіщенні",
        usegametitle: "Показати назву поточної гри в сповіщенні",
        customfont: "Завантажити користувацький шрифт для використання в сповіщенні",
        soundmode: "Виберіть один аудіофайл або випадково вибраний аудіофайл з папки, що містить кілька аудіофайлів, коли виникає сповіщення",
        soundfile: "Виберіть аудіофайл для відтворення при виникненні сповіщення",
        sounddir: "Виберіть папку, з якої буде випадково вибрано аудіофайл при виникненні сповіщення",
        volume: "Встановити гучність відтворення аудіофайлу",
        preview: "Попередній перегляд вибраного аудіофайлу або випадково вибраного аудіофайлу з папки",
        bgstyle: "Виберіть стиль фону сповіщення",
        gradientangle: "Встановити кут градієнта",
        bgimg: "Завантажити зображення для використання як фон сповіщення",
        bgachicon: "Використовувати іконку розблокованого досягнення як фон сповіщення",
        bgimgbrightness: "Встановіть яскравість зображення, що використовується як фон сповіщення",
        brightness: "Встановити яскравість графіки гри, що використовується як фон сповіщення",
        blur: "Встановіть рівень розмиття, який застосовується до фону сповіщення",
        roundness: "Встановити закругленість країв сповіщення",
        fontsize: "Встановити розмір шрифту, який використовується в сповіщенні",
        opacity: "Встановити загальну прозорість сповіщення",
        bgonly: "Встановити прозорість лише для фону сповіщення, залишаючи інші елементи повністю прозорими",
        glow: "Увімкніть ефект сяйва, що оточує сповіщення",
        glowcolor: "Встановіть колір ефекту сяйва",
        glowsize: "Встановіть розмір ефекту сяйва",
        glowx: "Встановіть горизонтальне зміщення ефекту сяйва",
        glowy: "Встановіть вертикальне зміщення ефекту сяйва",
        glowopacity: "Встановіть непрозорість ефекту сяйва",
        glowanim: "Виберіть попередньо визначену анімацію для застосування до ефекту сяйва",
        glowspeed: "Встановіть швидкість анімації, яка застосовується до ефекту сяйва",
        glowrarity: "Змінює колір ефекту світіння залежно від рідкості розблокованого досягнення",
        glowcolorbronze: "Колір світіння, який відображається, коли відсоток розблокування > $semirarity",
        glowcolorsilver: "Колір світіння, який відображається, коли відсоток розблокування < $semirarity та > $rarity",
        glowcolorgold: "Колір світіння, який відображається, коли відсоток розблокування < $rarity",
        mask: "Увімкніть маскування деяких частин сповіщення за допомогою власного зображення",
        maskimg: `Завантажте файл зображення, який буде використовуватися як маска<br><br><span class="ttdesc">У CSS, <code class="ttcode">mask-mode: alpha</code> працює протилежно до очікуваного - області прозорості в файлі зображення будуть приховані, а чорні/сірі області дозволять підлеглим елементам бути видимими</span>`,
        useoutline: "Показати контур навколо сповіщення",
        outline: "Виберіть тип контуру, який буде показано навколо сповіщення",
        outlinecolor: "Встановіть колір контуру навколо сповіщення",
        outlinewidth: "Встановіть ширину контуру навколо сповіщення",
        primarycolor: "Встановити основний колір сповіщення",
        secondarycolor: "Встановити вторинний колір сповіщення",
        tertiarycolor: "Встановити третинний колір сповіщення",
        fontcolor: "Встановити колір тексту, який відображається в сповіщенні",
        fontoutline: "Додати контур до всього тексту, який відображається в сповіщенні",
        fontoutlinecolor: "Встановити колір контуру тексту",
        fontoutlinescale: "Встановити товщину контуру тексту",
        fontshadow: "Додати тінь до всього тексту, який відображається в сповіщенні",
        fontshadowcolor: "Встановити колір тіні тексту",
        fontshadowscale: "Встановити товщину тіні тексту",
        fontshadowx: "Зсуває положення тіні тексту по горизонталі",
        fontshadowy: "Зсуває положення тіні тексту по вертикалі",
        iconroundness: "Встановити закругленість досягнення/іконки гри, яка відображається в сповіщенні",
        plat: "Завантажити зображення для використання як іконку 100%",
        usegameicon: "Заміна іконки розблокованого досягнення на іконку поточної гри",
        gameicontype: `Виберіть тип зображення, яке буде відображатися як іконка гри`,
        usecustomimgicon: "Заміна іконки розблокованого досягнення на файл зображення користувача",
        customimgicon: "Завантажити файл зображення, який буде використано як користувацька іконка",
        showhiddenicon: "Показати зображення, яке показує, що досягнення приховане в сповіщенні",
        hiddenicon: "Завантажити файл зображення для заміни прихованої іконки досягнення",
        logo: "Завантажити зображення для заміни іконки Логотипу",
        decoration: "Завантажити зображення для заміни іконки Декорації",
        showdecoration: "Перемкнути видимість іконки Декорації",
        replacelogo: "Замінити значок логотипу в сповіщенні обраним оздобленням",
        pos: "Встановити позицію сповіщення на екрані",
        usecustompos: "Увімкнути власну позицію для сповіщення",
        setcustompos: "Встановити власну позицію для сповіщення",
        copycustompos: "Застосувати власне розташування до всіх інших типів сповіщень",
        resetcustompos: "Скинути позицію сповіщення на позицію за замовчуванням",
        updatetheme: "Оновити поточну тему з обраними налаштуваннями персоналізації",
        savetheme: "Зберегти всі налаштовані параметри налаштування як нову тему",
        visibilitybtn: "Перемикання видимості елемента в персоналізованих переглядах та тестових сповіщеннях",
        delbtn: "Скидання елемента до значення за замовчуванням",
        imgpath: "Місце, де будуть збережені зображення сповіщень, згенеровані цією опцією",
        ssenabled: "Увімкнути або вимкнути генерування медіа для цього типу",
        checkforupdates: `Перевірте, чи була випущена нова версія програми на GitHub. Якщо оновлення доступне, воно буде автоматично завантажене та встановлене після підтвердження через діалогове вікно <span class="hl">Оновлення доступне</span>`,
        linkedgames: `Обійти <span class="hl">автоматичне відстеження процесів</span> для конкретних ігор Steam<br><br><span class="ttdesc">Ця опція повинна використовуватися лише у дуже конкретних сценаріях. Користувачі не повинні потребувати використання цієї опції в звичайних обставинах!</span>`,
        exclusionlist: `Запобігти відстеженню досягнень в конкретних іграх Steam за допомогою додатку<br><br><span class="ttdesc">Ця опція повинна використовуватися лише у дуже конкретних сценаріях. Користувачі не повинні потребувати використання цієї опції в звичайних обставинах!</span>`,
        inclusionlist: `Запобігати відстеженню всіх ігор Steam додатком, якщо не вказано інше<br><br><span class="ttdesc">Цю опцію слід використовувати лише у дуже специфічних випадках. Зазвичай користувачам не потрібно використовувати цю опцію!</span>`,
        ovx: "Горизонтальне зміщення сповіщення, відображеного на знімку екрану",
        ovy: "Вертикальне зміщення сповіщення, відображеного на знімку екрану",
        importtheme: `Імпортуйте налаштування через створений користувачем <span class="hl">файл теми</span>`,
        exporttheme: `Експортуйте обрану в даний момент <span class="hl">тему</span> для обміну<br><br><span class="ttdesc">Перед спробою експорту переконайтеся, що вибрана бажана <span class="hl">тема</span> (через меню <span class="hl">Вибрати тему</span>). Також переконайтеся, що налаштування було збережено в обраній <span class="hl">темі</span> (через меню <span class="hl">Зберегти тему</span>)<br><br><u>Будь-які налаштування, які ще не збережено в поточній <span class="hl">темі</span>, не будуть експортовані!</u></span>`,
        webhooks: "Використовуйте URL Webhook для публікації на сервері Discord щоразу, коли досягнення розблоковується",
        webhookmain: `Увімкнути або вимкнути публікацію інформації про досягнення на Discord-сервері при розблокуванні досягнення $main`,
        webhooksemi: `Увімкнути або вимкнути публікацію інформації про досягнення на Discord-сервері при розблокуванні досягнення $semi`,
        webhookrare: "Увімкнути або вимкнути публікацію інформації про досягнення на Discord-сервері при розблокуванні досягнення $rare",
        webhookplat: "Увімкнути або вимкнути публікацію інформації про досягнення на Discord-сервері при розблокуванні досягнення $plat",
        webhooktest: "Перемикання, чи слід надсилати тестову інформацію на сервер Discord, коли спрацьовують тестові сповіщення будь-якого типу",
        webhookurl: `Встановіть <span class="hl">URL Webhook</span> для потрібного сервера Discord<br><br><span class="ttdesc">URL Webhook використовується для публікації на сервері/каналі Discord від імені користувача або додатку. Для налаштування нового Webhook для сервера Discord користувач повинен мати роль на потрібному сервері, яка дозволяє створення Webhooks<br><br><u>URL Webhook є необхідним при використанні цієї опції</u><br><br>Зверніться до офіційної документації Discord для отримання додаткової інформації</span>`,
        webhookspoilers: `Додати тег спойлер до "Прихованих" досягнень при публікації на Discord`,
        webhookappid: "Показати AppID поточної гри в нижньому колонтитулі вбудованого webhook",
        unlockmsg: "Встановіть розташування повідомлення про розблокування/налаштованого тексту всередині $type",
        title: "Встановіть розташування заголовка досягнення всередині $type",
        desc: "Встановіть розташування опису досягнення всередині $type",
        notification: "сповіщення",
        screenshot: "знімок екрану",
        percentpos: "Встановіть розташування відсотка рідкісності всередині $type",
        sspercentpos: "Встановіть розташування відсотка рідкісності всередині $type",
        hiddeniconpos: "Встановіть розташування прихованого/таємного значка досягнення всередині $type",
        sshiddeniconpos: "Встановіть розташування прихованого/таємного значка досягнення всередині $type",
        decorationpos: "Встановіть розташування елемента оздоблення всередині $type",
        ssdecorationpos: "Встановіть розташування елемента оздоблення всередині $type",
        percentbadge: "Показати відсоток розблокування всередині значка, розташованого над іконкою досягнення/гри",
        sspercentbadge: "Показати відсоток розблокування всередині значка, розташованого над іконкою досягнення/гри",
        percentbadgepos: "Встановити позицію значка",
        sspercentbadgepos: "Встановити позицію значка",
        percentbadgecolor: "Встановити колір фону значка",
        sspercentbadgecolor: "Встановити колір фону значка",
        percentbadgefontcolor: "Встановіть колір шрифту значка",
        sspercentbadgefontcolor: "Встановіть колір шрифту значка",
        percentbadgefontsize: "Встановити розмір значка",
        sspercentbadgefontsize: "Встановити розмір значка",
        percentbadgeroundness: "Встановити округленість значка",
        sspercentbadgeroundness: "Встановити округленість значка",
        percentbadgex: "Змістити положення елемента значка по горизонталі",
        sspercentbadgex: "Змістити положення елемента значка по горизонталі",
        percentbadgey: "Змістити положення елемента значка по вертикалі",
        sspercentbadgey: "Змістити положення елемента значка по вертикалі",
        percentbadgeimg: "Відобразити значок на основі рідкості як елемент значка",
        sspercentbadgeimg: "Відобразити значок на основі рідкості як елемент значка",
        percentbadgeimgbronze: "Значок, який відображається, коли відсоток розблокування > $semirarity",
        sspercentbadgeimgbronze: "Значок, який відображається, коли відсоток розблокування > $semirarity",
        percentbadgeimgsilver: "Значок, який відображається, коли відсоток розблокування < $semirarity та > $rarity",
        sspercentbadgeimgsilver: "Значок, який відображається, коли відсоток розблокування < $semirarity та > $rarity",
        percentbadgeimggold: "Значок, який відображається, коли відсоток розблокування < $rarity",
        sspercentbadgeimggold: "Значок, який відображається, коли відсоток розблокування < $rarity",
        percentbadgeimgplat: "Значок, який відображається, коли всі досягнення розблоковані",
        sspercentbadgeimgplat: "Значок, який відображається, коли всі досягнення розблоковані",
        resetpbimgs: "Скинути всі значки до значень за замовчуванням",
        elemsmatch: `Відповідає налаштуванням елементів сповіщень, встановленим у Налаштувальнику для цього типу сповіщення<br><br><span class="ttdesc">Деякі попередньо налаштовані сповіщення не можуть повністю відповідати налаштуванням Налаштувальника через відмінності між сповіщеннями на екрані та на основі скріншотів</span>`,
        themeswitch: `Автоматично переключитися на будь-яку збережену <span class="hl">Тему</span> при виявленні певної гри`,
        userthemesync: `Синхронізувати налаштування в обраній <span class="hl">Темі</span> з усіма іншими типами сповіщень`,
        showsystrayopts: `Відобразити всі параметри, які зазвичай знаходяться під <span class="hl">Системний Лоток</span> > <span class="hl">Параметри</span> у <span class="hl">Налаштуваннях</span> > <span class="hl">Інше.</span>`,
        releaseshortcut: "Використовувати зазначену комбінацію клавіш для запуску поточної відслідковуваної гри",
        themeselect: "Виберіть раніше збережену тему",
        statwin: `Показати налаштовувану статистику досягнень для поточної гри у зовнішньому вікні<br><br><span class="ttdesc">При використанні з опцією <span class="hl">Перекласти досягнення на мову Steam</span> деякі переклади можуть бути недоступні, поки конкретне досягнення не буде розблоковано</span>`,
        statwinaot: `Встановіть вікно статистики досягнень у режим "Завжди зверху", що дозволяє відображати вікно поверх ігрового вікна<br><br><span class="ttdesc">Коли ця опція увімкнена, вікно статистики досягнень більше не реєструватиме взаємодії з користувачем, такі як події "клік". Для повторного включення взаємодії з вікном цю опцію потрібно вимкнути</span>`,
        statwinshortcut: "Перемикання накладення статистики досягнень за допомогою заданого гарячого ключа",
        ssdisplay: "Показати попередній перегляд знятого скріншоту в сповіщенні",
        iconscale: "Збільшити або зменшити розмір іконки досягнення",
        showiconborder: "Відображати зображення як рамку навколо значка досягнення",
        iconborderimg: "Завантажити файл зображення для використання як рамку навколо значка досягнення",
        iconborderpos: "Визначити, чи відображати зображення рамки перед або позаду значка досягнення",
        iconborderscale: "Збільшити або зменшити розмір рамки значка в сповіщенні",
        iconborderx: "Змінити горизонтальне зміщення рамки значка в сповіщенні",
        iconbordery: "Змінити вертикальне зміщення рамки значка в сповіщенні",
        iconborderrarity: "Використовувати рідкість",
        iconborderimgbronze: "Зображення рамки іконки, яке відображається, коли відсоток розблокування > $semirarity",
        iconborderimgsilver: "Зображення рамки іконки, яке відображається, коли відсоток розблокування < $semirarity та > $rarity",
        iconshadowcolor: "Встановити колір тіні навколо іконки досягнення при розблокуванні рідкісного досягнення",
        iconanimcolor: "Встановити колір анімації за іконкою досягнення при розблокуванні рідкісного досягнення",
        logoscale: "Збільшити або зменшити розмір елемента логотипу в сповіщенні",
        decorationscale: "Збільшити або зменшити розмір елемента декорації в сповіщенні",
        usecustomfontsizes: `Окремо збільшити або зменшити розмір текстових елементів у сповіщенні<br><br><span class="ttdesc">Не можна гарантувати збереження початкового макету сповіщення при зміні індивідуальних значень розміру шрифтів</span>`,
        unlockmsgfontsize: "Збільшити або зменшити розмір текстового елемента повідомлення про розблокування",
        titlefontsize: "Збільшити або зменшити розмір текстового елемента заголовка досягнення",
        descfontsize: "Збільшити або зменшити розмір текстового елемента опису досягнення",
        webhookembedcolormain: "Встановити колір, що використовується у вебхуці при розблокуванні досягнення $main",
        webhookembedcolorsemi: "Встановити колір, що використовується у вебхуці при розблокуванні досягнення $semi",
        webhookembedcolorrare: "Встановити колір, що використовується у вебхуці при розблокуванні досягнення $rare",
        webhookembedcolorplat: "Встановити колір, що використовується у вебхуці при розблокуванні досягнення $plat",
        raemus: "Показувати сповіщення, коли гри виявляються в підтримуваних емуляторах",
        rauser: "Встановіть ім'я користувача Retro Achievements для відслідковування досягнень",
        rakey: `Встановіть Web API ключ, який буде використовуватись для автентифікації в API Retro Achievements<br><br><span class="ttdesc">Web API ключ можна скопіювати або відновити, увійшовши на сайт Retro Achievements і перейшовши в розділ <span class="hl">Налаштування > Ключі > Web API Key</span><br><br>🔒 Наданий ключ буде зашифрований перед збереженням в локальній системі (якщо поточна операційна система підтримує шифрування)</span>`,
        rapercenttype: "Встановіть, чи слід показувати відсотки досягнень Hardcore або Softcore у сповіщеннях",
        retroarch: `Показувати повідомлення Retro Achievements для ігор, емульованих за допомогою RetroArch<br><br><span class="ttdesc"><span class="hl">RetroArch > Налаштування > Логування</span> повинно бути налаштоване за такими параметрами:<br><br><ul><li><span class="hllb">Рівень детальності логування</span>: <span class="hlgreen">УВІМК.</span></li><li><span class="hllb">Рівень логування фронтенду</span>: <span class="hlgreen">1 (Інформація)</span></li><li><span class="hllb">Логування в файл</span>: <span class="hlgreen">УВІМК.</span></li><li><span class="hllb">Часова мітка для лог-файлів</span>: <span class="hlred">ВИМК.</span></li></ul></span>`,
        dolphin: `Показувати повідомлення Retro Achievements для ігор, емульованих за допомогою Dolphin<br><br><span class="ttdesc"><span class="hl">Dolphin > Перегляд > Показати налаштування журналу</span> повинно бути налаштоване за такими параметрами:<br><br><ul><li><span class="hllb">Рівень детальності</span>: <span class="hlgreen">Інформація</span></li><li><span class="hllb">Виведення журналу</span> > <span class="hlgreen">Запис в файл</span></li><li><span class="hllb">Типи журналів</span> > <span class="hlgreen">Досягнення (RetroAchievements)</span></li></ul></span>`,
        pcsx2: `Показувати повідомлення Retro Achievements для ігор, емульованих за допомогою PCSX2<br><br><span class="ttdesc"><span class="hl">PCSX2 > Інструменти > Увімкнути запис у файл</span> повинно бути увімкнено</span>`,
        duckstation: `Показувати сповіщення Retro Achievements для ігор, емульованих через Duckstation<br><br><span class="ttdesc">❗ Файл <span class="dialogcode" style="background-color: var(--mediumgrey);">RA_Integration-x64.dll</span> потрібно завантажити та перемістити в <span class="hl">каталог установки Duckstation</span></span><br><br><span class="ttdesc"><span class="hl">Duckstation > Налаштування > Досягнення > RAIntegration (Тільки для розробників)</span> має бути увімкнено</span>`,
        ppsspp: `Показувати сповіщення Retro Achievements для ігор, які емітуються через PPSSPP<br><br><span class="ttdesc"><span class="hl">Settings > Tools > Developer Tools > General > Log to File</span> має бути ввімкнено та налаштовано з такими параметрами:<br><br><ul><li><span class="hllb">Achievements</span>: <span class="hlgreen">Info</span></span>`,
        retroarchpath: `Встановіть шлях до лог-файлу RetroArch <span class="hl">"retroarch.log"</span><br><br><span class="ttdesc">За умовчанням, лог-файл <span class="hl">"retroarch.log"</span> зберігається в <span class="hllb">%SYSTEMDRIVE%\\RetroArch-Win64\\Logs</span></span>`,
        dolphinpath: `Встановіть шлях до лог-файлу Dolphin <span class="hl">"dolphin.log"</span><br><br><span class="ttdesc">За умовчанням, лог-файл <span class="hl">"dolphin.log"</span> зберігається в одному з наступних місць:<br><br><ul><li><span class="hllb">%APPDATA%\\Dolphin Emulator\\Logs</span></li><li><span class="hllb">%USERPROFILE%\\Documents\\Dolphin Emulator\\Logs</span></li><li>🐧 <span class="hllb">$XDG_DATA_HOME/dolphin-emu/Logs</span></li></ul></span>`,
        pcsx2path: `Встановіть шлях до лог-файлу PCSX2 <span class="hl">"emulog.txt"</span><br><br><span class="ttdesc">За умовчанням, лог-файл <span class="hl">"emulog.txt"</span> зберігається в <span class="hllb">%USERPROFILE%\\Documents\\PCSX2\\Logs</span></span>`,
        duckstationpath: `Встановіть шлях до файлу журналу <span class="hl">"RALog.txt"</span> Duckstation<br><br><span class="ttdesc">За умовчанням, <span class="hl">"RALog.txt"</span> зберігається у <span class="hllb">%USERPROFILE%\\Downloads\\duckstation-windows-x64-release\\RACache</span></span>`,
        ppsspppath: `Встановіть шлях до файлу журналу <span class="hl">"log.txt"</span> PPSSPP<br><br><span class="ttdesc">За стандартних параметрів встановлення <span class="hl">"log.txt"</span> зберігається в <span class="hllb">%PROGRAMFILES%\\PPSSPP\\PSP\\memstick\\PSP\\SYSTEM\\DUMP</span></span>`,
        usecustomfontcolors: "Окремо налаштувати колір текстових елементів у сповіщенні",
        unlockmsgfontcolor: "Встановити колір першого текстового елемента",
        titlefontcolor: "Встановити колір другого текстового елемента",
        descfontcolor: "Встановити колір третього текстового елемента",
        exportachdata: `Експортувати дані досягнень у JSON-файл при розблокуванні досягнення<br><br><span class="ttdesc">Якщо увімкнено, <span class="ttcode">achdata.json</span> буде експортовано до:<br><br><ul><li><span class="hllb">%localappdata%\\Steam Achievement Notifier (V1.9)</span></li><li>🐧 <span class="hllb">~/.local/share/Steam Achievement Notifier (V1.9)</span></li></ul></span>`,
        textvspace: "Налаштуйте вертикальний інтервал між текстовими елементами сповіщення",
        ssmode: `Налаштуйте, чи потрібно робити знімки екрана всього екрана або поточного вікна гри<span style="color: red;">*</span><br><br><span class="ttdesc">Якщо <span class="hl">виконуваний файл</span> поточної гри не вдається знайти (<i>ані через <span class="hl">автоматичне відстеження процесів</span>, ані під час додавання як запису <span class="hl">Ігри з Автоматичним Звільненням</span></i>), цей параметр за замовчуванням використовуватиме режим "Екран"</span>`,
        replaynotify: "Повторити останнє сповіщення про досягнення",
        replaynotifyshortcut: "Повторити останнє сповіщення про досягнення за допомогою зазначеного швидкого доступу",
        replaynotifyempty: `<br><br><span class="ttdesc">Черга повторів пуста. Розблокуйте досягнення, щоб повторити сповіщення</span>`,
        customtrigger: "Активує симуляцію натискання клавіші/комбінації при розблокуванні досягнення. Може використовуватися для запуску гарячих клавіш, зареєстрованих у зовнішніх додатках",
        customtriggershortcut: `Активує вказану клавішу/комбінацію при розблокуванні досягнення<br><br><span class="ttdesc">Підтримує від 1 до 3 клавіш на одну швидку клавішу. Для натискань/комбінацій з менш ніж 3 клавішами натисніть потрібні клавіші та дочекайтеся завершення таймера (5 с)</span>`,
        customtriggerdelay: "Затримка вказаної клавіші/комбінації користувацького тригера",
        customtriggerusedisplaytime: `Затримка вказаної клавіші/комбінації користувацького тригера залежно від значення часу відображення для поточного типу повідомлення`,
        trophymode: "Замінити типи сповіщень Основні/Рідкі/100% на Бронза/Срібло/Золото/Платина",
        lognum: `Кількість попередніх файлів журналів, що зберігаються перед видаленням. Новий файл журналу створюється під час кожного запуску додатка<br><br><span class="ttdesc">Якщо встановлено 0, усі попередні файли журналів буде видалено під час виходу</span>`, 
        detectedappid: `Використати <span class="hl">AppID</span> поточно виявленої гри`,
        listmode: `Налаштувати поведінку <span class="hl">Списку виключень</span>/<span class="hl">Списку включень</span><br><br><span class="ttdesc">• <span class="hl">Виключення</span>: Ігнорувати лише ігри, зазначені в списку<br>• <span class="hl">Включення</span>: Ігнорувати всі ігри, крім тих, що зазначені в списку</span>`,
        notifymax: `Встановити максимальну кількість одночасно відображених сповіщень на екрані<br><br><span class="ttdesc">Збільшення кількості одночасно відображених сповіщень вимагає більше ресурсів і може знизити продуктивність</span>`,
        notifyspace: "Встановити відстань між одночасно відображеними сповіщеннями на екрані",
        audiocooldown: `Встановити час очікування перед відтворенням нового звуку для наступних сповіщень<br><br><span class="ttdesc">Звук не буде обмежено, якщо максимальна кількість сповіщень встановлена як 1</span>`,
        rauseemudir: "Зберігати знімки екрана/зображення сповіщень, отримані через RetroAchievements, у підпапку для поточного емулятора в межах вказаного каталогу шляху для знімків/зображень",
        ssext: "Встановити формат файлів знімків екрана, створених за допомогою опції Screenshot with Notification Overlay",
        notify1line: `Обмежити кількість рядків тексту, що відображаються у всіх сповіщеннях, до 1<br><br><span class="ttdesc">Рядки тексту, що не вміщуються в один рядок, будуть скорочені за допомогою "..."</span>`,
        copytheme: "Копіювати вибрану тему до іншого типу сповіщень",
        ssaddtosteam: "Автоматично додавати створені медіафайли до записів і знімків екрана поточної гри в Steam",
        appdatadir: "Відкрити розташування папки AppData додатку",
        backup: "Створіть резервну копію вмісту папки AppData додатку у вибраному місці, яка слугуватиме точкою відновлення для поточного стану додатку",
        restore: "Відновіть вміст папки AppData додатку з попередньої резервної копії",
        gametimerwin: "Показувати таймер на екрані, який відображає час, витрачений на розблокування всіх досягнень у поточній грі",
        gametimerwinshortcut: "Перемикати Таймер завершення гри за допомогою вказаної комбінації клавіш",
        gametimerwinaot: `Установити Таймер завершення гри в режим «Завжди поверх», дозволяючи відображати вікно поверх вікна гри<br><br><span class="ttdesc">Коли ввімкнено, Таймер завершення гри більше не реєструватиме взаємодії користувача, такі як події "click". Щоб знову ввімкнути взаємодію з вікном, цю опцію потрібно вимкнути</span>`,
        resetgametimer: "Скинути Таймер завершення гри для поточної гри",
        noshortcuts: `Вимикає всі комбінації клавіш у застосунку<br><br><span class="ttdesc">Коли ввімкнено, <u>усі комбінації клавіш у застосунку більше не працюватимуть</u>. Усі параметри, пов’язані з комбінаціями клавіш, також будуть приховані</span>`,
        extwinnotify: "Перемикати видимість усіх сповіщень на екрані під час використання Stream Notifications",
        usesanwatcher: `Увімкнути новий засіб відстеження ігрових процесів SAN<br><br><span class="ttdesc">Відмінності між новим SANWatcher і старими методами автоматичного відстеження процесів такі:<br><br><div class="wrapper sanwatcher"><span class="hl">УВІМК.</span><ul><li>Активно відстежує події запуску та завершення будь-яких процесів, що знаходяться в каталозі встановлення гри</li><li>Не потребує знання виконуваного файлу гри для вивільнення поточної гри</li><li>Поведінка попередніх запускників гри може відрізнятися, тому повна сумісність з усіма іграми Steam не гарантується</li></ul></div><br><div class="wrapper sanwatcher"><span class="hl" style="color: firebrick;">ВИМК.</span><ul><li>Сканує каталог встановлення гри на наявність запущених виконуваних файлів після запуску гри</li><li>Потребує знання виконуваного файлу гри для вивільнення поточної гри</li><li>Якщо процес гри не вдається визначити автоматично, користувач повинен вручну додати новий запис до <span class="hl">Ігри з Автоматичним Звільненням</span>, щоб ігри могли вивільнятися автоматично</li></ul></div>`,
        releasewaittime: `Укажіть, як довго SANWatcher чекатиме на запуск нових ігрових процесів перед звільненням поточної гри<br><br><span class="ttdesc">Наприклад, якщо поточна гра спочатку запускає передігровий лаунчер/вікно налаштувань перед запуском самої гри, цей параметр визначає кількість секунд, протягом яких SANWatcher чекатиме на появу вікна фактичної гри після закриття передігрового лаунчера/вікна налаштувань<br><br>Якщо протягом цього часу очікування буде виявлено новий активний ігровий процес, звільнення буде скасовано, і натомість відстежуватиметься новий активний процес<br><br>💡 Назва гри буде <span style="animation: release calc(var(--transition) * 2.5) linear alternate infinite;">блимати</span> у полі <span class="hl">Відображення гри</span>, поки поточна гра очікує на звільнення</span>`
    },
    update: {
        updateavailable: "Доступне оновлення",
        sub: [
            `<span id="newversion"></span>`,
            "Доступне нове оновлення Steam Achievement Notifier!",
            `Повні відомості про оновлення доступні на <span id="discordreleasenotes"></span> та <span id="githubreleasenotes"></span>`
        ],
        update: "Оновити"
    },
    linkgame: {
        content: {
            exepath: "Шлях до виконуваного файлу",
            managesub: [
                `Якщо після закриття вікна гри Steam усе ще показує гру як <i>У процесі гри</i>, спробуйте додати новий запис до <span class="hl">Ігри з Автоматичним Звільненням</span>`,
                `Додайте <span class="hl">AppID</span> конкретної гри разом з очікуваним <span class="hl">виконуваним файлом гри</span>, або <span class="hl">видаліть</span> наявний запис`,
                `Нові записи також можна додати, <i>клацнувши правою кнопкою миші</i> по <span class="hl">значку в Системному треї</span> > <span class="hl">Автоматичне Звільнення Гри</span> після виявлення гри`,
                `<span class="hl help" id="appidhelp"><u>Як знайти AppID гри в Steam?</u></span>`
            ],
            linknew: "Новий Запис",
            linknewsub: [
                `Додайте <span class="hl">AppID</span> нової гри разом з очікуваним <span class="hl">виконуваним файлом гри</span>`,
                `Після додавання записи можна <span class="hl">видалити</span> через попереднє меню <span class="hl">Ігри з Автоматичним Звільненням</span>`
            ],
            linkedit: "Редагувати Запис",
            linkeditsub: [
                `Відредагуйте <span class="hl">AppID</span> наявної гри разом з очікуваним <span class="hl">виконуваним файлом гри</span>`,
                `Після додавання записи можна <span class="hl">видалити</span> через попереднє меню <span class="hl">Ігри з Автоматичним Звільненням</span>`
            ],
            link: "Додати"
        }
    },
    exclusions: {
        content: {
            managesub: [
                `Додайте <span class="hl">AppID</span> будь-якої гри Steam до <span class="hl">Списку виключень</span>`,
                `Steam Achievement Notifier не буде намагатися відстежувати дані досягнень для жодної гри, якщо її <span class="hl">AppID</span> додано до <span class="hl">Списку виключень</span>`,
                `<span class="hl" id="appidhelp"><u>Як знайти AppID гри Steam?</u></span>`
            ],
            exclusionnew: "Нове виключення",
            exclusionnewsub: [
                `Введіть <span class="hl">AppID</span>, щоб додати до <span class="hl">Списку виключень</span>`
            ],
            exclusionedit: "Редагувати виключення",
            exclusioneditsub: [
                `Редагувати існуючий <span class="hl">AppID</span> у <span class="hl">списку виключень</span>`
            ]
        }
    },
    inclusions: {
        content: {
            managesub: [
                `Додайте <span class="hl">AppID</span> будь-якої гри Steam до <span class="hl">Списку включень</span>`,
                `Steam Achievement Notifier відстежуватиме дані про досягнення лише для ігор, <span class="hl">AppID</span> яких додано до <span class="hl">Списку включень</span>`,
                `<span class="hl help" id="appidhelp"><u>Як знайти AppID гри Steam?</u></span>`
            ],
            inclusionnew: "Нове включення",
            inclusionnewsub: [
                `Введіть <span class="hl">AppID</span>, щоб додати до <span class="hl">Списку включень</span>`
            ],
            inclusionedit: "Редагувати включення",
            inclusioneditsub: [
                `Редагувати наявний <span class="hl">AppID</span> у <span class="hl">Списку включень</span>`
            ]
        }
    },
    notificationelems: {
        title: "Елементи сповіщення",
        content: {
            unlockmsg: "Повідомлення про розблокування",
            title: "Назва досягнення",
            desc: "Опис досягнення",
            hiddeniconpos: "Схований значок",
            sshiddeniconpos: "Схований значок",
            decorationpos: "Оздоблення",
            ssdecorationpos: "Оздоблення",
            percentpos: "Відсоток рідкісності",
            sspercentpos: "Відсоток рідкісності",
            percentbadge: "Відсотковий значок",
            sspercentbadge: "Відсотковий значок",
            percentbadgepos: "Позиція значка",
            sspercentbadgepos: "Позиція значка",
            percentbadgecolor: "Колір значка",
            sspercentbadgecolor: "Колір значка",
            percentbadgefontcolor: "Колір шрифту значка",
            sspercentbadgefontcolor: "Колір шрифту значка",
            percentbadgefontsize: "Розмір значка",
            sspercentbadgefontsize: "Розмір значка",
            percentbadgeroundness: "Округленість значка",
            sspercentbadgeroundness: "Округленість значка",
            percentbadgex: "Горизонтальне зміщення",
            sspercentbadgex: "Горизонтальне зміщення",
            percentbadgey: "Вертикальне зміщення",
            sspercentbadgey: "Вертикальне зміщення",
            percentbadgeimg: "Використовувати значок",
            sspercentbadgeimg: "Використовувати значок",
            percentbadgeimgbronze: "Рідкість: > $semirarity",
            sspercentbadgeimgbronze: "Рідкість: > $semirarity",
            percentbadgeimgsilver: "Рідкість: < $semirarity & > $rarity",
            sspercentbadgeimgsilver: "Рідкість: < $semirarity & > $rarity",
            percentbadgeimggold: "Рідкість: < $rarity",
            sspercentbadgeimggold: "Рідкість: < $rarity",
            resetpbimgs: "Скинути значки",
            elemsmatch: "Відповідність налаштуванням Налаштувальника",
            ssdisplay: "Попередній перегляд скріншоту"
        }
    },
    themeswitch: {
        content: {
            managesub: [
                `Додайте <span class="hl">AppID</span> будь-якої гри, щоб автоматично перемикати <span class="hl">Темы</span> при виявленні`,
                `Для кожного типу сповіщення можна вибрати будь-яку збережену <span class="hl">Тему</span>, а також бажаний монітор, який буде використовуватися як <span class="hl">Джерело Скріншоту</span>`,
                `<span class="hl" id="appidhelp"><u>Як знайти AppID гри Steam?</u></span>`
            ],
            themeswitchnew: "Нова автоматична зміна",
            themeswitchnewsub: [
                `Введіть <span class="hl">AppID</span> гри разом із бажаним монітором, який буде використовуватися як <span class="hl">Джерело Скріншоту</span>`,
                `Виберіть, на яку <span class="hl">Тему</span> перемикатися для кожного типу сповіщення, коли виявлено <span class="hl">AppID</span> цієї гри`
            ],
            themeswitchedit: "Редагувати автоматичне перемикання",
            themeswitcheditsub: [
                `Редагувати потрібний монітор, який використовуватиметься як <span class="hl">джерело знімків екрана</span> для <span class="hl">AppID</span> цієї гри`,
                `Змінити, на яку <span class="hl">тему</span> перемикатися для кожного типу повідомлення, коли виявлено <span class="hl">AppID</span> цієї гри`
            ],
            themes: "Темы",
            src: "Джерело Скріншоту",
            themedeleted: "Тему видалено"
        }
    }
}

export const missingdepssub = (opt: string,dep: string) => [
    `Схоже, ви намагаєтесь увімкнути опцію <span class="hl">${opt}</span>, але ця опція не може бути увімкнена без попередньої установки пакету <code class="dialogcode">${dep}</code>`,
    `Будь ласка, виконайте <code class="dialogcode" style="user-select: text;">sudo apt-get install ${dep}</code>, щоб встановити цю залежність`
]