export const translations = {
    global: {
        main: "Головна",
        rare: "Рідкісний",
        plat: "100%",
        topleft: "Зверху ліворуч",
        topcenter: "Зверху по центру",
        topright: "Зверху праворуч",
        bottomleft: "Знизу ліворуч",
        bottomcenter: "Знизу по центру",
        bottomright: "Знизу праворуч",
        ok: "OK",
        preview: "Попередній перегляд",
        save: "Зберегти",
        back: "Назад",
        settings: "Налаштування",
        appversion: "Версія додатка",
        image: "Зображення",
        audio: "Аудіо",
        folder: "Папка",
        font: "Шрифт",
        select: "Вибрати",
        gametitle: "Назва гри",
        congrats: "Вітаємо!",
        achievementunlocked: "Досягнення розблоковано",
        gamecomplete: "100% завершено",
        achievementdesc: "Клацнули кнопку показу тестового сповіщення",
        gamecompletedesc: "Ви розблокували всі досягнення!",
        defaultcustomfont: "За замовчуванням (Шрифт не вибрано)",
        defaultsoundfile: "За замовчуванням (Файл не вибрано)",
        defaultsounddir: "За замовчуванням (Папка не вибрано)",
        nowtracking: "Зараз відстежується досягнення для:",
        nopreview: "Попередній перегляд недоступний для місцевої операційної системи",
        options: "Опції",
        resetwindow: "Скинути вікно",
        show: "Показати",
        exit: "Вийти",
        releasegame: "Звільнити гру",
        releasegamesub: [
            `Перезапустіть фоновий процес Worker і звільніть поточну гру від відстеження`,
            `Спробуйте цю опцію, якщо ви нещодавно закрили гру, але Steam все ще показує її як запущену, або якщо Steam Achievement Notifier все ще показує, що він відстежує гру, яка вже була закрита`
        ],
        noupdateavailable: "Немає доступних оновлень",
        latestversion: "Встановлено останню версію",
        missingdeps: "Відсутня залежність",
        missingdepssub: [
            `Здається, ви намагаєтеся увімкнути опцію <span class="hl">Зробити знімок екрану в Steam</span>. Однак на Linux знімки екрану не можуть бути автоматично запущені без попередньої установки пакунка <code class="dialogcode">xdotool</code>`,
            `Будь ласка, виконайте <code class="dialogcode" style="user-select: text;">sudo apt-get install xdotool</code>, щоб встановити цю залежність, що забезпечить можливість знімків екрану в Steam на цьому пристрої`
        ],
        restartapp: "Перезапустити додаток",
        restartappsub: [
            `Якщо речі не працюють правильно, скористайтеся цією опцією, щоб закрити та знову відкрити додаток`,
            `Якщо проблема залишається після перезапуску додатка, будь ласка, подумайте про повідомлення про неї, використовуючи вбудовані посилання на домашньому екрані`
        ]
    },
    app: {
        content: {
            game: "Гру не виявлено",
            customise: "Налаштувати",
            test: "Показати тестове сповіщення"
        }
    },
    settings: {
        language: {
            title: "Мова"
        },
        os: {
            title: "Операційна система",
            content: {
                desktop: "Створити ярлик на робочому столі",
                startwin: "Стартувати при вході",
                startmin: "Мінімізувати запуск",
                nohwa: "Вимкнути апаратне прискорення",
                litemode: "Легкий режим"
            }
        },
        notifications: {
            title: "Сповіщення",
            content: {
                rarity: "Відсоток рідкості",
                rareonly: "Тільки рідкі",
                all: "Всі",
                off: "Вимк.",
                showpercent: "Показати відсоток",
                soundonly: "Тільки звук",
                extwin: "Сповіщення про потік",
                audiosrc: "Джерело аудіо",
                notify: "Повідомити",
                app: "Додаток",
                nowtracking: "Показати сповіщення про відстеження",
                nowtrackingscale: "Шкала відстеження",
                shortcuts: "Сповіщення ярлики"
            }
        },
        media: {
            title: "Медіа",
            content: {
                steamss: "Зробити знімок екрану Steam",
                screenshots: "Додаткове медіа",
                off: "Вимкн.",
                overlay: "Снимок екрана з наложенням сповіщення",
                monitors: "Джерело знімка екрана",
                ovpos: "Позиція накладання",
                ovmatch: "Співпадіння з користувачем встановленої позиції",
                ovpath: "Шлях знімка екрана",
                ssdelay: "Затримка знімка екрана",
                notifyimg: "Зображення повідомлення",
                imgpath: "Шлях до зображення"
            }
        },
        accessibility: {
            title: "Доступність",
            content: {
                noanim: "Вимкнути анімацію вікна додатка",
                nvda: "Увімкнути підтримку NVDA",
                tooltips: "Показати підказки"
            }
        },
        advanced: {
            title: "Розширені",
            content: {
                pollrate: "Частота опитування",
                releasedelay: "Затримка випуску",
                maxretries: "Максимальна кількість спроб обробки",
                debug: "Панель відлагодження",
                userust: "Альтернативний режим обробки",
                notifydebug: "Показувати сповіщення про налагодження",
                usecustomfiles: "Використовувати користувацькі файли додатка",
                showcustomfiles: "Показувати користувацькі файли додатка"
            }
        },        
        misc: {
            title: "Різне",
            content: {
                checkforupdates: "Перевірити оновлення",
                log: "Журнал додатка",
                reset: "Скинути додаток"
            }
        }
    },    
    customiser: {
        preset: {
            title: "Попереднє налаштування",
            content: {
                preset: "Попереднє сповіщення",
                iconanim: "Рідкісна анімація значка",
                alldetails: "Показати всі деталі",
                usepercent: "Використовувати відсоток",
                displaytime: "Час відображення",
                scale: "Масштаб",
                customtext: "Власний текст",
                usegametitle: "Використовувати назву гри",
                customfont: "Власний шрифт"
            }
        },
        sound: {
            title: "Звук",
            content: {
                soundmode: "Режим звуку",
                file: "Файл",
                folder: "Випадковий",
                soundfile: "Звуковий файл",
                sounddir: "Каталог звуків",
                volume: "Гучність"
            }
        },
        style: {
            title: "Стиль",
            content: {
                bgstyle: "Стиль фону",
                solid: "Однотонний",
                gradient: "Градієнт",
                img: "Зображення",
                gameart: "Мистецтво гри",
                gradientangle: "Кут градієнта",
                bgimg: "Зображення фону",
                bgimgbrightness: "Яскравість",
                brightness: "Яскравість",
                roundness: "Круглість",
                fontsize: "Розмір шрифту",
                opacity: "Непрозорість",
                bgonly: "Тільки фон"
            }
        },
        colors: {
            title: "Кольори",
            content: {
                primarycolor: "Основний колір",
                secondarycolor: "Другорядний колір",
                tertiarycolor: "Третинний колір",
                fontcolor: "Колір шрифту",
                fontoutline: "Контур шрифту",
                fontoutlinecolor: "Колір контуру шрифту",
                fontshadow: "Тінь шрифту",
                fontshadowcolor: "Колір тіні шрифту"
            }
        },
        icons: {
            title: "Іконки",
            content: {
                iconroundness: "Круглість іконки",
                plat: "Логотип 100%",
                usegameicon: "Використовувати іконку гри",
                logo: "Логотип",
                decoration: "Декорація",
                showdecoration: "Показати декорацію",
                rarity: "Рідкість",
                showhiddenicon: "Показати приховану іконку",
                hiddenicon: "Прихована іконка",
                replacelogo: "Замінити Логотип"
            }
        },
        position: {
            title: "Позиція",
            content: {
                pos: "Позиція на екрані",
                usecustompos: "Використовувати власну позицію",
                setcustompos: "Встановити",
                resetcustompos: "Скинути"
            }
        },
        theme: {
            title: "Тема",
            content: {
                savetheme: "Зберегти тему",
                sub: [
                    `Збережені <span class="hl">Теми користувача</span> можна вибрати з меню <span class="hl">Вибрати тему</span> на головному екрані.`,
                    `Переконайтеся, що <span class="hl">Назва теми</span> є <u>унікальною</u> - назва, яка відповідає існуючій темі, <u>перезапише попередню</u>!`
                ],
                placeholder: "Назва теми",
                theme: "Тема"
            }
        }
    },
    logwin: {
        content: {
            tagline: "Ось що відбулося з моменту запуску додатка:",
            copylog: "Копіювати вміст журналу"
        }
    },
    reset: {
        content: {
            sub: `
                <div class="wrapper" id="resetsub">
                    <span>Ви впевнені?</span>
                    <span>Всі раніше налаштовані дані, <u>включаючи Користувацькі налаштування</u>, будуть скинуті до значень за замовчуванням.</span>
                    <span>🛑 Цю дію неможливо скасувати!</span>
                </div>
            `,
            reset: "Скинути"
        }
    },
    error: {
        content: {
            subtitle: "Додаток Steam Achievement Notifier стикнувся з проблемою і потребує закриття.",
            details: "Ось деталі помилки:",
            sub: "Натисніть кнопки нижче, щоб повідомити про цю проблему через обрану вами платформу.",
            report: "Повідомити",
            log: "Журнал додатка",
            exit: "Вихід"
        }
    },
    tooltips: {
        game: "Гра, для якої відстежуються досягнення",
        usertheme: "Виберіть раніше збережену тему",
        customise: "Налаштування сповіщень про досягнення",
        test: "Показати тестове сповіщення з усіма налаштуваннями",
        kofi: "Пожертвувати на Ko-Fi!",
        discord: "Приєднуйтесь до Discord!",
        github: "Повідомити про проблему",
        lang: "Виберіть мову користувальницького інтерфейсу, яка використовується в додатку",
        desktop: "Перемикнути ярлик на робочому столі для запуску додатку",
        startwin: "Автоматичний запуск Steam Achievement Notifier після входу в систему",
        startmin: "При запуску приховувати вікно інтерфейсу додатку, поки воно не буде відкрите зі Системного трею",
        nohwa: `Вимкніть апаратне прискорення, що може покращити продуктивність на системах з обмеженими ресурсами або системах без відведеного GPU<br><br><span class="ttdesc">Додаток перезапуститься після включення/виключення цієї опції</span>`,
        litemode: "Вимкнути всі інтерактивні елементи інтерфейсу, забезпечуючи обмежену функціональність додатку через іконку Системного трею. Це може покращити використання ресурсів додатком",
        rarity: "Відсоток, при якому сповіщення про рідкі досягнення будуть відображатися. Будь-яке досягнення з відсотком розблокування вище цього значення буде відображатися як головне сповіщення",
        showpercent: "Відображати відсоток розблокування досягнення в сповіщенні для вибраних типів",
        soundonly: "Вимкнути сповіщення, відтворюючи лише звуки, встановлені через Налаштування",
        extwin: "Створити приховане фонове вікно, яке дублює будь-які поточно відображувані сповіщення на екрані. Це вікно можна додати як джерело захоплення вікна для використання в програмному забезпеченні трансляції, такому як OBS",
        audiosrc: "Виберіть джерело (або вимкніть) звуку, створеного додатком",
        nowtracking: "Відображати сповіщення, що повідомляє користувача про відстеження досягнень для запущеної гри",
        nowtrackingscale: `Встановіть розмір сповіщення про відстеження`,
        shortcuts: "Запуск тестового сповіщення за допомогою гарячих клавіш. Гарячі клавіші можна налаштувати для кожного типу сповіщення",
        steamss: "Зробити знімок екрана Steam при розблокуванні досягнення",
        screenshots: "Виберіть тип додаткових медіафайлів, які будуть створені при відображенні сповіщення",
        monitors: "Монітор, який буде захоплено при знімку екрана",
        ovpos: "Позиція накладання сповіщення на знімку екрана",
        ovmatch: "Відповідність позиції екрана, встановленої в Налаштуваннях, для цього типу сповіщення",
        ovpath: "Місце збереження знімків, створених цією опцією",
        ssdelay: "Затримка від моменту виникнення сповіщення до знімку екрана",
        sspreview: "Показати попередній перегляд того, як буде виглядати збережений знімок екрана",
        noanim: "Вимкнути всі анімації та ефекти переходу вікон додатку",
        nvda: "Увімкнути копіювання інформації про досягнення в буфер обміну при розблокуванні досягнення для подальшого читання програмним забезпеченням для читання екрана, таким як NVDA",
        tooltips: "Відображати підказки при наведенні на певні елементи інтерфейсу",
        pollrate: `Встановіть інтервал оновлення для даних досягнень під час гри<br><br><span class="ttdesc">Продуктивність може збільшитися/зменшитися в залежності від значення або апаратного забезпечення системи. Вищі значення зазвичай призводять до меншого навантаження на систему, але можуть затримувати сповіщення</span>`,
        releasedelay: `Встановлює, як довго процес в фоні чекає на перезапуск після випуску поточної гри. Впливає як на автоматичне відстеження процесів, так і на ручно зв'язані ігри.<br><br><span class="ttdesc">Надає більший проміжок часу для повного звільнення Steamworks від додатка. Збільшення цього значення може запобігти непередбачуваній поведінці, такій як відстеження раніше закритої гри</span>`,
        maxretries: `Встановлює максимальну кількість спроб зв'язати робочий процес з виявленим AppID. Впливає як на автоматичне відстеження процесів, так і на ручно зв'язані ігри.<br><br><span class="ttdesc">Спроби зв'язку виконуються один раз на секунду. Якщо робочий процес не зв'язаний з поточним AppID після цієї кількості спроб, буде повернено недійсний процес. У таких випадках гру слід звільнити вручну через Системний лоток > Налаштування > Звільнити гру</span>`,
        debug: "Відкрийте панель відлагодження, яка відображає детальну інформацію про відстеження процесів",
        userust: "Використовуйте альтернативну функцію на основі Rust, щоб перевірити, чи в даний момент запущені відстежені ігрові процеси на системі. Коли не позначено, буде використано стандартний контроль процесів на основі NodeJS.",
        notifydebug: "Створити вікно DevTools для всіх сповіщень. Корисно для відладки/вирішення проблем сповіщень",
        usecustomfiles: "Увімкнути завантаження користувацьких файлів для сповіщень. Рекомендується обережність для звичайних користувачів",
        showcustomfiles: "Відкрити розташування користувацьких файлів",
        log: "Відкрити вікно журналу додатка, яке відображає інформацію про активність процесу, попередження та помилки",
        reset: "Видалити всі дані конфігурації та перезапустити додаток",
        playback: "Призупинити/продовжити анімацію попереднього перегляду сповіщення",
        replay: "Перезапустити анімацію попереднього перегляду сповіщення",
        preset: "Виберіть шаблон сповіщення для налаштування",
        iconanim: "Перемкнути рамку та анімацію рідкісної іконки",
        alldetails: "Відображати всі текстові елементи в сповіщенні, включаючи ті, які за замовчуванням приховані для цього шаблону",
        usepercent: "Показати відсоток відкриття досягнення замість значення XP/S",
        displaytime: "Встановити кількість секунд, протягом яких буде відображатися сповіщення",
        scale: "Збільшити або зменшити розмір сповіщення",
        customtext: "Встановити користувацьке повідомлення, яке буде відображатися в сповіщенні",
        usegametitle: "Показати назву поточної гри в сповіщенні",
        customfont: "Завантажити користувацький шрифт для використання в сповіщенні",
        soundmode: "Виберіть один аудіофайл або випадково вибраний аудіофайл з папки, що містить кілька аудіофайлів, коли виникає сповіщення",
        soundfile: "Виберіть аудіофайл для відтворення при виникненні сповіщення",
        sounddir: "Виберіть папку, з якої буде випадково вибрано аудіофайл при виникненні сповіщення",
        volume: "Встановити гучність відтворення аудіофайлу",
        preview: "Попередній перегляд вибраного аудіофайлу або випадково вибраного аудіофайлу з папки",
        bgstyle: "Виберіть стиль фону сповіщення",
        gradientangle: "Встановити кут градієнта",
        bgimg: "Завантажити зображення для використання як фон сповіщення",
        bgimgbrightness: "Встановіть яскравість зображення, що використовується як фон сповіщення",
        brightness: "Встановити яскравість графіки гри, що використовується як фон сповіщення",
        roundness: "Встановити закругленість країв сповіщення",
        fontsize: "Встановити розмір шрифту, який використовується в сповіщенні",
        opacity: "Встановити загальну прозорість сповіщення",
        bgonly: "Встановити прозорість лише для фону сповіщення, залишаючи інші елементи повністю прозорими",
        primarycolor: "Встановити основний колір сповіщення",
        secondarycolor: "Встановити вторинний колір сповіщення",
        tertiarycolor: "Встановити третинний колір сповіщення",
        fontcolor: "Встановити колір тексту, який відображається в сповіщенні",
        fontoutline: "Додати контур до всього тексту, який відображається в сповіщенні",
        fontoutlinecolor: "Встановити колір контуру тексту",
        fontshadow: "Додати тінь до всього тексту, який відображається в сповіщенні",
        fontshadowcolor: "Встановити колір тіні тексту",
        iconroundness: "Встановити закругленість досягнення/іконки гри, яка відображається в сповіщенні",
        plat: "Завантажити зображення для використання як іконку 100%",
        usegameicon: "Замінити стандартну іконку сповіщення на іконку поточної гри",
        showhiddenicon: "Показати зображення, яке показує, що досягнення приховане в сповіщенні",
        hiddenicon: "Завантажити файл зображення для заміни прихованої іконки досягнення",
        logo: "Завантажити зображення для заміни іконки Логотипу",
        decoration: "Завантажити зображення для заміни іконки Декорації",
        showdecoration: "Перемкнути видимість іконки Декорації",
        replacelogo: "Замінити значок логотипу в сповіщенні обраним оздобленням",
        pos: "Встановити позицію сповіщення на екрані",
        usecustompos: "Увімкнути власну позицію для сповіщення",
        setcustompos: "Встановити власну позицію для сповіщення",
        resetcustompos: "Скинути позицію сповіщення на позицію за замовчуванням",
        savetheme: "Зберегти всі налаштовані параметри налаштування як нову тему",
        visibilitybtn: "Перемикання видимості елемента в персоналізованих переглядах та тестових сповіщеннях",
        delbtn: "Скидання елемента до значення за замовчуванням",
        link: `Відкрити <span class="hl">Меню управління пов’язаними іграми</span>`,
        imgpath: "Місце, де будуть збережені зображення сповіщень, згенеровані цією опцією"
    },
    update: {
        updateavailable: "Доступне оновлення",
        sub: [
            `<span id="newversion"></span>`,
            "Доступне нове оновлення Steam Achievement Notifier!",
            `Повні відомості про оновлення доступні на <span id="discordreleasenotes"></span> та <span id="githubreleasenotes"></span>`
        ],
        update: "Оновити"
    },
    "linkgame": {
        "content": {
            "exepath": "Шлях до виконуваного файлу",
            "nodata": "Немає даних",
            "manage": "Керування Пов'язаними Іграми",
            "managesub": [
                `Вручну зв'яжіть <span class="hl">виконуваний файл</span> гри з певним <span class="hl">AppID</span>, або <span class="hl">від'єднайте</span> існуючий`,
                `Steam Achievement Notifier більше не буде використовувати <span class="hl">автоматичне відстеження процесів</span> для будь-яких <span class="hl">пов'язаних ігор</span> - замість цього, вказаний <span class="hl">виконуваний файл</span> буде відстежуватися, коли буде виявлено відповідний <span class="hl">AppID</span>`,
                `<span class="hl" id="appidhelp"><u>Як знайти AppID гри Steam?</u></span>`
            ],
            "new": "Новий...",
            "linknew": "Нова Пов'язана Гра",
            "linknewsub": [
                `Створіть нове посилання між <span class="hl">виконуваним файлом гри</span> та пов'язаним <span class="hl">AppID</span>`,
                `Після створення посилання можна <span class="hl">від'єднати</span> його через попереднє вікно <span class="hl">Керування Пов'язаними Іграми</span>`
            ],
            "link": "Посилання",
            "findappid": "Знайти AppID",
            "findappidsub": [
                `Кожна гра Steam має унікальний номер, пов'язаний з нею - називається <span class="hl">AppID</span>. Ви можете знайти AppID, пов'язаний з будь-якою грою Steam, перевіривши один із наступних способів:`,
                `У <span class="hl">клієнті Steam</span>, клацніть правою кнопкою миші на гру у своїй <span class="hl">бібліотеці</span> та виберіть <i>Властивості</i> > <i>Оновлення</i> - тут буде перелічено AppID`,
                `URL сторінки <span class="hl">магазину</span> гри - це буде номер, вказаний після <span class="hl">app/</span>: <code class="appidhelpcode">https://store.steampowered.com/app/<span class="hl">4000</span></code>`,
                `Веб-сайти, такі як <span class="hl">SteamDB</span> - розділ <span class="hl">Інформація про Додаток</span> буде перелічувати AppID для кожної гри`
            ]
        }
    }
}